[{"id":"project-1764271674391","name":"Liu Donglan","createdAt":"2025-11-27T19:27:54.391Z","documents":[{"id":"01051c79-8e0a-4669-9135-728b0b754c00","project_id":"project-1764271674391","file_name":"Exhibit A1.pdf","file_type":"application/pdf","file_size":8096631,"page_count":8,"ocr_text":"--- Page 1 ---\nExhibit A-1\n\n--- Page 2 ---\n9/5/24,2:42 PM\nPublic Inquiry\nDepartment of State\nDivision of Corporations\nEntity Information\nReturn to Results\nReturn to Search\nEntity Details\nENTITY NAME: KINGS ELEVATOR PARTS INC.\nDOSID:6464635\nFOREIGN LEGAL NAME:\nFICTITIOUS NAME:\nENTITY TYPE: DOMESTIC BUSINESS CORPORATION\nDURATION DATE/LATEST DATE OF DISSOLUTION:\nSECTIONOF LAW: BUSINESS CORPORATION-402 BUSINESS CORPORATION LAW-BUSINESS CORPORATION LAW\nENTITY STATUS: ACTIVE\nDATE OF INITIAL DOS FILING: 04/22/2022\nREASON FOR STATUS:\nEFFECTIVE DATE INITIAL FILING: 04/22/2022\nINACTIVE DATE:\nFOREIGN FORMATION DATE:\nSTATEMENT STATUS: PAST DUE\nCOUNTY: QUEENS\nNEXT STATEMENT DUE DATE: 04/30/2024\nJURISDICTION: NEW YORK, UNITED STATES\nNFP CATEGORY: NO-ANSWER\nNAME HISTORY\nFILING HISTORY\nMERGER HISTORY\nASSUMED NAME HISTORY\nENTITY DISPLAY\nService of Process on the Secretary of State as Agent\nThe Post Office address to which the Secretary of State shall mail a copy of any process against the corporation served upon the\nSecretary of State by personal delivery:\nName: KINGS ELEVATOR PARTS INC.\nAddress: 154-05 BARCLAY AVE, FLUSHING, NY, UNITED STATES, 11355\nElectronic Service of Process on the Secretary of State as agent: Not Permitted\nChief Executive Officer's Name and Address\nName:\nAddress:\nPrincipal Executive Office Address\nAddress:\nRegistered Agent Name and Address\nName:\n1/2\nhttps:/apps.dos.ny.gov/publiclnquiry/EntityDisplay\n\n--- Page 3 ---\n9/5/24,2:42PM\nPublic Inquiry\nAddress:\nEntity Primary Location Name and Address\nName:\nAddress:\nFarmcorpflag\nIs The Entity A Farm Corporation:NO\nStock Information\nShare Value\nNumber Of Shares\nValue Per Share\nNO PAR VALUE\n200\n$0.00000\nhttps:/apps.dos.ny.gov/publiclnquiry/EntityDisplay\n2/2\n\n--- Page 4 ---\nSTATE OF NEW YORK\nDEPARTMENT OF STATE\nI hereby certify that the annexed copy for KINGS ELEVATOR PARTS INC., File\nNumber 220422001322 has been compared with the original document in the\ncustody of the Secretary of State and that the same is true copy of said original.\nWITNESS my hand and official seal of the\nDepartment of State, at the City of Albany,\nSTATE OF NEW YORK\non April 22， 2022.\nBrandac uf-\nDEPARTMENT ONOSTATE\nBrendan C. Hughes\nExecutive Deputy Secretary of State\nAuthentication Number: 100001441349 To Verify the authenticity of this document you may access the\nDivision of Corporation's Document Authentication Website at http:/ecorp.dos.ny.gov\n\n--- Page 5 ---\nCERTIFICATE OF INCORPORATION\nof\nKINGS ELEVATOR PARTS INC.\nUnder Section 402 of the Business Corporation Law\nFIRST:\nThe Name of the corporation is: KINGS ELEVATOR PARTS INC.\nSECOND:\nThis corporation is formed to engage in any lawful act or activity for which a\ncorporation may be organized under the Business Corporation Law, provided\nthat it is not formed to engage in any act or activity requiring the consent or\napproval of any state official, department, board, agency or other body without\nsuch consent or approval first being obtained.\nTHIRD:\nThe county, within this state, in which the office of the corporation is to be\nlocated is QUEENS\nFOURTH:\nThe total number and value of shares of common stock which the corporation\nshall have authority to issue is 200 SHARES WITH NO PAR VALUE\nFIFTH:\nThe Secretary of State is designated as agent of the corporation upon whom\nprocess against it may be served. The address within or without this state to\nwhich the Secretary of State shall mail a copy of any process against the\ncorporation served upon him or her is:\nKINGS ELEVATOR PARTS INC.\n154-05 BARCLAY AVE\nFLUSHING, NY 11355\nI certify that I have read the above statements, I am authorized to sign this Certificate of\nIncorporation, that the above statements are true and correct to the best of my knowledge and\nbelief and that my signature typed below constitutes my signature.\nQING XIANG WANG (Signature)\nQING XIANG WANG, INCORPORATOR\n154-05 BARCLAY AVE\nFLUSHING, NY 11355\nFiled by:\nWANG C/O VINCENT HUANG CPA P.C.\n758 58TH ST STE B5\nBROOKLYN, NY 11220\nFiled with the NYS Department of State on 04/22/2022\nFiling Number: 220422001322 DOS ID: 6464635\n\n--- Page 6 ---\nIRS\nDEPARTMENT OF THE TREASURY\nINTERNAL REVENUE SERVICE\nCINCINNATI OH 45999-0023\nDate of this notice: 04-22-2022\nEmployer Identification Number:\n88-1927324\nForm: SS-4\nNumber of this notice: CP 575 A\nKINGS ELEVATOR PARTS INO\n154-05 BARCLAY AVE\nFLUSHING, NY 11355\nFor assistance you may call us at:\n1-800-829-4933\nIF YOU WRITE, ATTACH THE\nSTUB AT THE END OF THIS NOTICE.\nWE ASSIGNED YOU AN EMPLOYER IDENTIFICATION NUMBER\nThank you for applying for an Employer Identification Number (EIN). We assigned you\nEIN 88-1927324. This EIN will identify you, your business accounts, tax returns, and\ndocuments, even if you have no employees. Please keep this notice in your permanent\nrecords.\nTaxpayers request an EIN for their business. Some taxpayers receive CP575 notices when\nanother person has stolen their identity and are opening a business using their information.\nIf you did not apply for this EIN, please contact us at the phone number or address listed\non the top of this notice.\nWhen filing tax documents, making payments, or replying to any related correspondence,\nit is very important that you use your EIN and complete name and address exactly as shown\nabove. Any variation may cause a delay in processing, result in incorrect information in\nyour account, or even cause you to be assigned more than one EIN. If the information is\nnot correct as shown above, please make the correction using the attached tear-off stub\nand return it to us.\nBased on the information received from you or your representative, you must file\nthe following forms by the dates shown.\nForm 1120\n07/15/2023\nIf you have questions about the forms or the due dates shown, you can call us at\nthe phone number or write to us at the address shown at the top of this notice. If you\nneed help in determining your annual accounting period (tax year), see Publication 538，\nAccounting Periods and Methods.\nWe assigned you a tax classification (corporation, partnership, etc.) based on\ninformation obtained from you or your representative. It is not a legal determination\nof your tax classification, and is not binding on the IRS. If you want a legal\ndetermination of your tax classification, you may request a private letter ruling\nfrom the IRS under the guidelines in Revenue Procedure 2020-1， 2020-1 I.R.B. 1 (or\nsuperseding Revenue Procedure for the year at issue). Note: Certain tax classification\nelections can be requested by filing Form 8832， Entity Classification Election.\nSee Form 8832 and its instructions for additional information.\nIMPORTANT INFORMATION FOR S CORPORATION ELECTION:\nIf you intend to elect to file your return as a small business corporation,\nan election to file a Form 1120-S, U.S. Income Tax Return for an S Corporation,\nmust be made within certain timeframes and the corporation must meet certain tests.\nAll of this information is included in the instructions for Form 2553， Election by\na Small Business Corporation.\n\n--- Page 7 ---\n(IRS USE ONLY)\n575A\n04-22-2022\nKING\nB\n9999999999\nSS-4\nIf you are required to deposit for employment taxes (Forms 941， 943， 940， 944， 945，\nCT-1, or 1042)， excise taxes (Form 720)， or income taxes (Form 1120)， you will receive a\nWelcome Package shortly, which includes instructions for making your deposits\nelectronically through the Electronic Federal Tax Payment System (EFTPS). A Personal\nIdentification Number (PIN) for EFTPS will also be sent to you under separate cover.\nPlease activate the PIN once you receive it, even if you have requested the services of a\ntax professional or representative. For more information about EFTPS, refer to\nPublication 966,lectronic choices to pay All your Federal Taxes.If you need to\nmake a deposit immediately, you will need to make arrangements with your Financial\nInstitution to complete a wire transfer.\nThe IRS is committed to helping all taxpayers comply with their tax filing\nobligations. If you need help completing your returns or meeting your tax obligations,\nAuthorized e-file Providers, such as Reporting Agents or other payroll service\noroviders,are available to assist you.Visit www.irs.gov/mefbusproviders for a\nlist of companies that offer IRS e-file for business products and services.\nIMPORTANT REMINDERS:\n*\nKeep a copy of this notice in your permanent records. This notice is issued only\none time and the IRS will not be able to generate a duplicate copy for you. You\nmay give a copy of this document to anyone asking for proof of your EIN.\nUse this EIN and your name exactly as they appear at the top of this notice on all\nyour federal tax forms.\n* Refer to this EIN on your tax-related correspondence and documents.\n* Provide future officers of your organization with a copy of this notice.\nYour name control associated with this EIN is KING. You will need to provide this\ninformation along with your EIN, if you file your returns electronically.\nSafequard your EIN by referring to Publication 4557， Safeguarding Taxpayer\nData: A Guide for Your Business.\nYou can get any of the forms or publications mentioned in this letter by\nvisiting our website at www.irs.gov/forms-pubs or by calling 800-TAX-FORM\n(800-829-3676).\nIf you have questions about your EIN, you can contact us at the phone number\nor address listed at the top of this notice. If you write, please tear off the\nstub at the bottom of this notice and include it with your letter.\nThank you for your cooperation.\n\n--- Page 8 ---\n(IRS USE ONLY)\n575A\n04-22-2022 KING B 9999999999 SS-4\nKeep this part for your records.\nCP 575 A (Rev. 7-2007)\nReturn this part with any correspondence\nso we may identify your account. Please\nCP 575 A\ncorrect any errors in your name or address.\n9999999999\nYour Telephone Number Best Time to Call DATE OF THIS NOTICE: 04-22-2022\n()\nEMPLOYER IDENTIFICATION NUMBER: 88-1927324\nFORM: SS-4\nNOBOD\nINTERNAL REVENUE SERVICE\nKINGS ELEVATOR PARTS INC\nCINCINNATI OH 45999-0023\n154-05 BARCLAY AVE\n..........l.....l....\nFLUSHING, NY 11355","ocr_status":"completed","exhibit_number":"A-1","exhibit_title":"Exhibit A1_pdf","created_at":"2025-11-27T19:28:04.411698"},{"id":"db5489c9-7911-4bdd-ba15-82c6ee05cf3f","project_id":"project-1764271674391","file_name":"Exhibit A2.pdf","file_type":"application/pdf","file_size":23064161,"page_count":20,"ocr_text":"--- Page 1 ---\nExhibit A-2\n\n--- Page 2 ---\n9\n98\nSee Reuerse for\nertain Befinitions\nIncorporated under the laws of the State of New York\nKINGS ELEVATOR PARTS INC.\nTotal Authorized Issue\n200 Shares Without Par Value\nCommon Stock\nChis is to certify that\nQing Xiang Wancy\nis the ofoner of\nKings Elevator parts Inc.\nfaully paid and\nnon-assesable sheres of the above Caporation transferable only on the bookis of the argoraltion bay\nthe holder thereef in person or bay a duly athorined Cobttorney uhon suerrenden of this ertificuate\nfroherly endorsed.\nitness, the seal of the Corporation and the signatures of its dudy authorized oficers.\nated\nSecretary\nPresident\nCORPKIT NEW YORK\n\n--- Page 3 ---\n8\n102\nSee Reuerse for\nertain efinitions\nIncorporated under the laws of the State of New York\nKINGS ELEVATOR PARTS INC.\nTotal Authorized Issue\n200 Shares Without Par Value\nCommon Stock\nhis to certify that Fuzhou shinestone Trade Co.,Ltd\nis the oumer of\nkings Elevator parts Fnc.\nfally aid and\nnon-clisescble shures of the alove corperation transferable only on the bocks of the ophoration bay\nthe holder theref in ferson or bay a dndly antherised Caolternery ufron serrender of this er lificale\nArcherdy endorsed.\nitness, the seal of the Corporation and the signatures of its duly autherized oficers.\nTated\nSecretary\nPresident\nCORPKIT NEW YORK\n\n--- Page 4 ---\nBYLAWS\nOF\nKINGS ELEVATOR PARTS INC.\nA New York Corporation.\nARTICLE L OFFICES AND AGENT\n1)Principal Office. [5402]\nThe principal office of the corporation in the State of New York shall be located in the\nCity of\nFlushing\nNew York.The corporation may have such other\noffices, either within or without the State of New York, as the Board of Directors may\ndesignate or as the business of the corporation may require from time to time.\n2)Registered office. [402]\nThe registered office of the corporation required to be maintained in the State of New\nYork New York may be, but need not be, identical with the principal office or place of\nbusiness in the State of New York, and the address of the registered office may be changed\nfrom time to time by the Board of Directors in accord with the law of New York.\n3) Registered Agent. [305， 402]\n..\nThe Registered Agent of the corporation required by law shall be the Secretary of State and\nthe post office address to which he shall send process shall be as initially designated in the\narticles of incorporation and may resign or change address or be changed by the Board of\nDirectors from time to time in accord with the law of New York.\nARTICLE II. SHAREHOLDERS\nSection 1. Annual Meeting. [5 602]\nThe annual meeting of the shareholders of the Corporation shall be held on the date\nfixed, by the Directors, and each successive annual meeting shall be held, for the purpose of\nelecting Directors, and transacting such other business as may properly come before the\nmeeting. If the day fixed for the annual meeting shall be a legal holiday in the State of New\nYork such meeting shall be held on the next succeeding business day. If the election of\nDirectors shall not be held on the day designated herein for any annual meeting of the\nShareholders, or at any adjournment thereof, the Board of Directors shall cause the election to\nbe held at a special meeting of the Shareholders as soon thereafter as conveniently may be.\nA Shareholder may demand a regular meeting be held pursuant to New York law.\n\"All references are to the Mckinney's Consolidated Laws of New York Annotated, Chapter 4， cited as\nBusiness Corporution Law 101 et seq., current through L. 2009. These bylaws have been prepared from\nstandard compilations and due to possible statutory changes and special considerations each user should\nconfirm the statutory accuracy and client requirements before using these bylaws and forms.\nNY Bylaws-I\n一一一\n\n--- Page 5 ---\nSection 2. Special Meetings. [8 602， 603， 616]\nSpecial meetings of the Shareholders, for any purpose or purposes, unless otherwise\nprescribed by statute, may be called by the Chairman of the Board of Directors, or the\nPresident or by the Board of Directors, and shall be called by the President at the request of\nany person owning the number of outstanding shares of the corporation entitled to vote at the\nmeeting as set forth in New York law.\nSection 3. Place of Meeting. [5 605]\nThe Board of Directors may designate any place, either within or without the State of\nNew York, as the place of meeting for any annual meeting or for any special meeting called\nby the Board of Directors. A waiver of notice signed by all Shareholders entitle to vote at a\nmeeting may designate any place, either within or without the State of New York, as the\nplace for the holding of such meeting. If no designation is made, or if a special meeting be\notherwise called, the place of meeting shall be the registered office of the corporation in the State of New York.\nSection 4. Notice of Meeting. [55108， 605， 606]\nWritten or printed notice stating the place, day and hour of the meeting and, in case of\na special meeting, the purpose or purposes for which the meeting is called, and other contents\nrequired by law, shall be delivered not less than ten nor more than 60 days before the date of\nthe meeting, either personally or by mail, but or at the direction of the Chairman, President,\nor the Secretary, or the officer of persons called the meeting, to each Shareholder of record\nentitled to vote at such meeting. If mailed, such notice shall be deemed to be delivered when\ndeposited in the United States mail, addressed to the Shareholder at his address as it appears\non the records of the corporation, with postage thereon prepaid. Notice may be transmitted\nelectronically if consented to by the Shareholder. Written waiver of notice or attendance at\nsuch meeting without protest by the Shareholder shall be equivalent to the giving of such\nnotice and cure any deficiency therein. Notice of any adjourned meeting shall be given as\nprovided by New York law. Exceptions to this notice are those set forth in New York law.\nSection 5. Fixing of Record Date. [5604]\nSubject to applicable law, for the purpose of determining Shareholders entitled to\nnotice of or to vote at any meeting of Shareholders or any adjournment thereof, or\nShareholders entitled to receive payment of any dividend, or in order to make a determination\nof Shareholders for any other proper purpose, the Board of Directors or an authorized officer\nmay fix in advance a date as the record date for any such determination of Shareholders, such\ndate in any case to be not more than 60 days and, in case of a meeting of Shareholders, not\nless than ten days prior to the date on which the particular action, requiring such\ndetermination of Shareholders, is to be taken, or in the case of a merger, consolidation, share\nexchange, dissolution or sale, lease or exchange of assets, such notice as required by law. If\nno record date is fixed for the determination of Shareholders entitled to notice of or to vote at\na meeting of Shareholders, or Shareholders entitled to receive payment of a dividend, the date\non which the resolution of the Board of Directors declaring such meeting or dividend is\nadopted, as the case may be, shall be the record date for such determination of Shareholders.\nWhen a determination of Shareholders entitled to vote at any meeting of Shareholders has\nbeen made as provided in this section, such determination shall apply to any adjournment\nthereof.\nNY Bylaws-2\n\n--- Page 6 ---\nSection 6. Electronic Communications. [s ]\nA meeting of the Shareholders in the form of a conference among Shareholders may\nbe held by electronic communication as permitted by New York law.\nSection 7. Voting Lists. [55 607.612]\nThe officer or agent having charge of the stock transfer books for shares of the\ncorporation shall make a complete list of the Shareholders entitled to vote at such meeting, or\nany adjournment thereof, arranged in alphabetical order, with the address of an the number of\nshare held by each, which list shall be kept on file at the registered office of the corporation\nand shall be subject to inspection by any Shareholder at any time during usual business hours.\nSuch list shall also be produced and kept open at the time and place of the meeting and shall\nbe subject to the inspection of any Shareholder during the whole time of the meeting. The\noriginal stock transfer book shall be prima facie evidence as to who are the Shareholders\nentitled to examine such list of transfer books or to vote at any meeting of Shareholders.\nSection 8. Quorum. [55608.616]\nA majority of the outstanding shares of the corporation entitled to vote, represented in\nperson or by proxy, shall constitute a quorum at a meeting of Shareholders. If less than a\nmajority of the outstanding shares are represented at a meeting, a majority of the shares so\nrepresented may adjourn the meeting from time to time without further notice. At such\nadjourned meeting at which a quorum shall be present or represented, any business may be\ntransacted which might have been transacted at the meeting as originally notified. The\nShareholders present at a duly organized meeting may continue to transact business until\nadjournment, notwithstanding the withdrawal of enough Shareholders to leave less than a\nquorum unless such presence was only for the sole purpose of objection to notice given.\nSection 9. Proxies. [ 609]\nAt all mectings of Shareholders, a Shareholder may vote by proxy executed in writing\nor by electronic transmission by the Shareholder or by his duly authorized attorney in fact.\nSuch proxy shall be filed with the secretary of the corporation before or at the time of the\nmeeting. No proxy shall be valid after eleven months from the date of its execution, unless\notherwise provided in the proxy.\nSection 10. Voting of Shares. [55 614， 617]\n10.1. Cumulative Voting. [5 618]\nUnless the articles provide that there shall be cumulative voting, each Shareholder\nentitled to vote for directors has the right to cast one vote per share per each director to be\nelected to the board of directors. Directors shall, except as otherwise required by this chapter\nor by the by-laws or certificate of incorporation as permitted by New York law, be elected by\na plurality of the votes cast at a meeting of shareholders by the holders of shares entitled to\nvote in the election.\nNY Bylaws-3\n\n--- Page 7 ---\n10.2. Vote. [ 613， 614]\nEvery shareholder of record shall be entitled at every meeting of shareholders to one\nvote for every share standing in his name on the record of shareholders, subject to Section 11\nhereof. Corporate action, other than as set forth in Section 11， shall be authorized by a\nmajority of qualified votes cast at a Shareholder's meeting. A Shareholder is deemed to have\nvoted all of the shares owned by such shareholder in the same way, absent direction voting\nshares differently.\n10.3. Voting by Beneficial Owners. [55 612]\nUpon compliance with New York law, beneficial owners, rather than the actual\nShareholder, may vote the shares.\n10.4 Voting by Non-Shareholders. [55 625， 703]\nIf the articles or law provide for voting by creditor, security holder, or other person,\nsuch person shall have such right to vote.\nSection 11. Informal Action by Shareholders. [5 615]\nAny action required to be taken at any meeting of the Shareholders, or any other\naction which may be taken at a meeting of the Shareholders, may be taken without a meeting\nif a consent in writing, setting forth the action so taken, shall be signed by all of the\nShareholders entitled to vote with respect to the subject matter thereof. Such action is\neffective when signed by all the Shareholders, unless a different time is provided in such\nwritten action. All such action shall comply with New York law.\nSection 12. Voting Inspectors. [55 610. 611]\nAt any Shareholder meeting, the chairman of the meeting may appoint one or more persons\nas inspectors for such meeting with duties pursuant to law.\nARTICLE IL.BOARD OF DIRECTORS\nSection 1. General Powers. [ 701]\nThe business and affairs of the corporation shall be managed under the direction of its\nBoard of Directors under the authority granted by the law of New York.\nSection 2. Number, Tenure, Election, Removal, Resignation. Vacancies and\nQualification. [ 702 to 706， 710]\nDirectors shall be natural persons. The first Board of Directors may be named in the\narticles or elected by Incorporators or Shareholders. The number of directors of the\ncorporation shall be determined by resolution of the Board of Directors or Shareholders or as\nset forth in the articles, but shall in the absence of such designation be the number of\nShareholders of the corporation entitled to elect directors or three (3). whichever is less. and\nmay be increased or decreased in accordance with New York law. Directors may be elected\nto fill vacancies and newly created directorships by the Board of Directors. Each director\nshall hold office until the next annual meeting of Shareholders and until his successor shall\nhave been elected and qualified; or elected for a term not to exceed five (5) years. A Director\nmay resign by filing his resignation with the Secretary, to take effect as set forth in such\nresignation, which shall have the effect of creating a vacancy. The articles or these bylaws\nNY Bylaws-4\n1\n\n--- Page 8 ---\nshall determine Directors' qualifications, but a Director need not be a resident of the State of\nNew York or Shareholder of the corporation.\nSection 3. Regular Meetings. [5 710]\nA regular meeting of the Board of Directors shall be held without other notice than\nthis Bylaw immediately after, and at the same place as, the annual meeting of Shareholders.\nThe Board of Directors may provide, by resolution, the time and place, either within or\nwithout the State of New York, for the holding of additional regular meetings without other\nnotice than such resolution.\nSection 4. Special Meetings. [5 700]\nSpecial meetings of the Board of Directors may be called by or at the request of the\nChairman, President or any Director. The person or persons authorized to call special\nmeetings of the Board of Directors may fix any place, either within or without the State of\nNew York, as the place for holding any special meeting of the Board of Directors called by\nthem.\nSection 5. Notice. [ 108. 711]\nNo notice shall be required for any regular meeting of the Board of Directors. Notice\nof any special meeting of the Board of Directors shall be given at least three(3) days\npreviously thereto by written notice delivered personally or mailed to each Director at his\nbusiness address, or by telegram. If mailed, such notice shall be deemed to be delivered\nwhen deposited in the United States mail so addressed with postage thereon prepaid. If\nnotice be given by telegram, such notice shall be deemed to be delivered when the telegram is\ndelivered to the telegraph company. Any Director may waive notice of any meeting in a\nwriting to be filed with the minutes of such meeting. The attendance of a Director at a\nmeeting shall constitute a waiver of notice of such meeting, except where a Director attends a\nmeeting for the express purpose of objecting to the transaction of any business because the\nmeeting is not lawfully called or convened. Neither the business to be transacted at, the\npurpose of, any regular or special meeting of the Board of Directors need be specified in the\nnotice or waiver of notice of such meeting.\nSection 6. Quorum. [5 707， 709]\nA majority of the Directors currently holding office shall constitute a quorum for the\ntransaction of business at any meeting of the Board of Directors, but if less than all Directors\nare present at a meeting, a majority of the Directors present may adjourn the meeting from\ntime to time without further notice. A Director may give advance written consent or\nopposition to a proposal to be acted on at a Board of Directors meeting in accordance with\nNew York law.\nSection 7. Manner of Acting. [ 708. 709]\nThe act of a majority of the Directors present at a meeting shall be the act of the\nBoard of Directors. All members may consent in writing to an action without a meeting.\nNY Bylaws-5\n\n--- Page 9 ---\nSection 8. Electronic Meetings. [5 708]\nAny one or more of the Directors may participate in a meeting of the Board of\nDirectors or any Committee thereof by means of a conference telephone or similar\ncommunications equipment allowing all persons to hear each other at the same time. Such\nparticipation shall constitute presence in person at such meetings\nSection 9. Vacancies. [5 705]\nAny vacancy occurring in the Board of Directors may be filled by the vote of the\nremaining Directors though less than a quorum of the Board of Directors in accordance with\nNew York law. A director elected to fill a vacancy shall be elected for the unexpired term of\nhis predecessor in office.\nSection 10. Compensation. [5 713]\nThe Board of Directors may fix the compensation of directors serving in any capacity.\nSection 11. Presumption of Assent.\nA Director of the corporation who is present at a meeting of the Board of Directors\nat which action on any corporate matter is taken shall be presumed to have assented to the\naction taken unless his dissent shall be entered in the minutes of the meeting or unless he\nshall file his written dissent to such action with the person acting as the secretary of the\nmeeting within three (3) days after the adjournment of the meeting. Such right to dissent\nshall not apply to a Director who voted in favor of such action.\nSection 12. Removal. [ 706]\nThe Shareholders or Directors of the corporation may remove a Director pursuant to\nNew York law.\nSection 13. Board Committees. [5 712]\nThe Board of Directors may establish committees and subcommittees having the\nauthority of the board pursuant to New York law.\nSection 14. Shareholder Management. [ 620， 715]\nThe Shareholders may take any action that the Board of Directors has the power to\nmake pursuant to New York law.\nSection 15. Board Action by Consent. [5 708]\nAny action required to be taken by the Board of may be taken without a meeting if\nconsent in writing, setting forth the action so taken, shall be signed by all of the Directors\nentitled to vote with respect to the subject matter thereof. Such action is effective when\nsigned by all the Directors, unless a different time is provided in such written action. All\nsuch action shall comply with New York law.\nNY Bylaws-6\n\n--- Page 10 ---\nARTICLE IV.OFFICERS\nSection 1. Number. [5 715]\nThe officers of the corporation may be a Chairman of the Board of Directors.\nPresident, Chief Executive Officer, one or more vice-presidents (the number thereof to be\ndetermined by the Board of Directors), a Secretary, and a Treasurer or Chief Financial\nOfficer, each of whom shall be elected by the Board of Directors. Such other officers and\nassistant officers as may be deemed necessary may be elected or appointed by the Board of\nDirectors. Any two or more offices may be held by the same person.\nSection 2. Election and Term of Office; Resignation. [5 716]\nThe officers of the corporation to be elected by the Board of Directors shall be elected\nannually by the Board of Directors at the first meeting of the Board of Directors held after\neach annual meeting of the Shareholders, or as soon thereafter as is convenient. Each officer\nshall hold office until his successor shall have been duly elected and shall have qualified or\nuntil his death or until he shall resign or shall have been removed in the manner hereinafter\nprovided. In the absence of an election or appointment, the person exercising such powers\nare deemed to have been elected to such offices under New York law.\nSection 3. Removal. [5 716]\nAny officer or agent elected or appointed by the Board of Directors may be removed\nby the Board of Directors whenever in its judgment the best interests of the corporation\nwould be served thereby, but such removal shall be without prejudice to the contract rights, if\nany, of the person so removed.\nSection 4.Vacancies.[5715]\nA vacancy in any office because of death, resignation, removal, disqualification or\notherwise may be filled by the Board of Directors for the unexpired portion of the term and\nuntil the successor shall have been chosen and qualified.\nSection 5. Officers. [ 715]\nThe Board of Directors may appoint the following officers:\n5.1. Chairman of the Board of Directors. The Board of Directors shall elect the\nChairman of the Board of Directors from its membership. He shall preside at the meetings of\nthe Board and Shareholders and perform such other duties as may be assigned to him by the\nBoard of Directors from time to time.\n5.2. President/CEO. The President shall be the Chief Executive Officer of the\ncorporation and, subject to the control of the Board of Directors. shall in general supervise\nand control all of the business and affairs of the corporation. He shall, when the Chairman of\nthe Board of Directors is absent, preside at all meetings of the Shareholders and of the Board\nof Directors. He may sign, with the Secretary or any other proper officer of the corporation\nthereunto authorized by the Board of Directors, certificates for shares of the corporation, any\ndeeds, mortgages, bonds, contracts, or other instruments which the Board of Directors has\nauthorized to be executed, except in cases where the signing and execution thereof shall be\nexpressly delegated by the Board of Directors or by these bylaws to some other officer or\nNY Bylaws-7\n\n--- Page 11 ---\nagent of the corporation, or shall be required by law to be otherwise signed or executed; and\nin general shall perform all duties incident to the office of President and such other duties as\nmay be prescribed by the Board of Directors from time to time.\n5.3. The Vice-Presidents. In the absence of the President or in the event of his\ndeath, inability or refusal to act, the vice-president (or in the event there be more than one\nvice-president, the vice-presidents in the order designated at the time of their election, or in\nthe absence of any designation, then in the order of their election) shall perform the duties of\nthe President, and when so acting, shall have all the powers of and be subject to all the\nrestrictions upon the President. Any vice-president may sign, with the Secretary or an\nAssistant Secretary, certificates for shares of the corporation; and shall perform such other\nduties as from time to time may be assigned to him by the President or by the Board of\nDirectors.\n5.4. The Secretary. The Secretary shall: (a) keep the minutes of the Shareholders'\nand of the Board of Directors' meetings in one or more books provided for that purpose; (b)\nsee that all notices are duly given in accordance with the provisions of these bylaws or as\nrequired by law;(c) be custodian of the corporate records and of the seal of the corporation\nand see that the seal of the corporation is affixed to all documents the execution of which on\nbehalf of the corporation under its seal is duly authorized; (d) keep a register of the post\noffice address of each Shareholder which shall be furnished to the Secretary by such\nShareholder; (e) sign with the President, or vice-president, certificates for shares of the\ncorporation, the issuance of which shall have been authorized by resolution of the Board of\nDirectors; (f) have general charge of the stock transfer books of the corporation; and (g) in\ngeneral perform all duties incident to the office of Secretary and such other duties as from\ntime to time may be assigned to him by the President or by the Board of Directors.\n5.5. The Treasurer/CFO. The Treasurer shall be the Chief Financial Officer of the\ncorporation and shall have charge and custody of and be responsible for all funds and\nsecurities of the corporation and shall keep regular books of all receipts and disbursements of\nthe corporation, and in general shall perform such other duties as may be assigned to him by\nthe Board of Directors or the President. The Treasurer shall disburse out of the funds of the\ncorporation payment of such just demands against the corporation as may from time to time\nbe authorized by the Board of Directors. The Treasurer shall sign or countersign all checks,\nnotes and such other instruments or obligations as require his signature, and shall perform all\nduties incident to his office, or that are properly required of him by the Board of Directors.\nprovided, however, that by resolution of the Board of Directors' authority and responsibility\nfor the signing of checks, notes and other obligations may be assigned to either the President\nor Treasurer or such other officer or officers as the Board of Directors may designate from\ntime to time.\nSection 6. Transfer of Authority.\nIn case of the absence of any officer of the corporation or for any other reason the\nBoard of Directors deems sufficient, the Board of Directors may transfer the powers or duties\nof that officer to any other officer, Director or employee of the corporation and any officer\nmay delegate their duties to persons functioning in subordinate offices.\nNY Bylaws-8\n\n--- Page 12 ---\nSection 7. Compensation.\nThe salaries of the principal officers shall be fixed from time to time by the Board of\nDirectors. No officer shall be prevented from receiving his salary by reason of the fact that\nhe is also a Director of the corporation.\nARTICLE V.CONTRACT\nSection 1. Contracts.\nThe Board of Directors may authorize any officer or officers, agent or agents, to enter\ninto any contract or execute and deliver any instrument in the name of and on behalf of the\ncorporation, and such authority may be general or confined to specific instances.\nARTICLE VI. CERTIFICATES FOR SHARES AND THEIR TRANSFER\nSection 1. Determination of Shares.\nThe Board of Directors shall determine if some or all of any or all classes and series\nof its shares shall be un-certificated or certificated shares.\nSection 2. Certificates for Shares. [5 508]\nIf the Board of Directors determines to issue Certificates representing fully paid and\nnon-assessable shares of the common stock of the corporation, such certificates shall be in\nsuch form as shall be similar to that annexed to the minutes of the first meeting of the Board\nof Directors or otherwise as determined by the Board of Directors. Such certificates shall be\nsigned by the President or a vice-president and by the Secretary or an Assistant Secretary and\nthe Corporation Seal shall be affixed thereto. All certificates for shares shall be\nconsecutively numbered or otherwise identified. The name and address of the person to\nwhom the shares represented thereby are issued, with the number of shares and date of issue,\nshall be entered on the stock transfer books of the corporation. All certificates surrendered to\nthe corporation for transfer shall be canceled and no new certificate shall be issued until the\nformer certificate for a like number of shares shall have been surrendered and canceled,\nexcept that in case of a lost, destroyed or mutilated certificate a new one may be issued\ntherefore upon such terms and indemnity to the corporation as the Board of Directors may\nprescribe.\nSection 3. Transfer of Shares.\nTransfer of shares of the corporation shall be made only on the stock transfer books of\nthe corporation by the holder of record thereof or by his legal representative, who shall\nfurnish proper evidence of authority to transfer, or by his attorney there-unto authorized by\npower of attorney duly executed and filed with the Secretary of the corporation, and on\nsurrender for cancellation of the certificate for such shares. The person in whose name shares\nstand on the books of the corporation shall be deemed by the corporation to be the owner\nthereof for all purposes. The Board of Directors or Shareholders may impose a restriction on\nthe transfer of shares in accordance with New York law.\nNY Bylaws-9\n\n--- Page 13 ---\nSection 4. Lost or Destroyed Certificates. [Uniform Commercial Code, Article 8]\nThe holder of any certificate representing shares of the corporation or document\nrepresenting uncertificated shares shall immediately notify the corporation of any loss or\ndestruction of the certificate(s) representing same. The corporation may issue a new\ncertificate in the place of any certificate theretofore issued by it alleged to have been lost or\ndestroyed. On production of such evidence of loss or destruction as the Board of Directors in\nits discretion may require, the Board of Directors may, in its discretion, require the owner of\nthe lost or destroyed certificate, or such person's legal representatives, to give the corporation\na bond in such sum as the Board may direct, and with such surety or sureties as may be\nsatisfactory to the Board of Directors to indemnify the corporation against any claims, loss,\nliability, or damage it may suffer on account of the issuance of the new certificate. A new\ncertificate may be issued without requiring any such evidence, bond, or indemnity subject to\nthe discretion of the Board of Directors.\nARTICLE VIL.FISCAL YEAR\nThe fiscal year of the corporation shall begin on the first day of January (and end on\nthe thirty-first day of December) in each year. The Board of Directors shall have the power\nto change the fiscal year by-resolution duly adopted.\nARTICLE VIII. NAME. [55 301， 302， 303]\nThe exclusive name of this corporation that has been reserved as required by law shall\nbe as above written\nARTICLE IX.SEAL.[S1077\nThe Board of Directors shall provide a corporate seal which shall have inscribed\nthereon the (1) word \"Seal\" or \"Corporate Seal\", and may contain(2) the name of the\ncorporation, (2) the state of incorporation, and may contain (3) abbreviations or combinations\nof such terms and be affixed, engraved, printed, placed, stamped or in any other manner be\nreproduced on any document.\nARTICLE X.WAIVER OF NOTICE\nWhenever any notice is required to be given to any Shareholder or Director of the\ncorporation under the provisions of these bylaws or under the provisions of the articles of\nincorporation or under the provisions of the New York law, a waiver thereof in writing.\nsigned by the person or persons entitled to such notice, whether before or after the time stated\ntherein, shall be deemed equivalent to the giving of such notice.\nARTICLE XI. AMENDMENTS. [5 601. 602]\nThese bylaws may be altered, amended or repealed and new bylaws may be adopted\nby Shareholders or the Board of Directors at any regular or special meeting of the Board of\nDirectors or Shareholders by a vote of such Shareholders or Directors entitled to vote in\naccordance with the laws of New York.\nNY Bylaws-10\n\n--- Page 14 ---\nARTICLE XIL FURTHER AUTHORITIES\nThe Board of Directors may grant, delegate or assign to any officer of the corporation\nany of the duties and authorities herein above designated to be performed by any officer or\nmay enlarge or restrict the duty and authority of any officer, either temporarily or\npermanently, as long as such powers and authorities shall not be inconsistent with these\nbylaws.\nARTICLE XII SEVERABILITY\nAny provision of these bylaws, or any amendment or alteration thereof, which has\nbeen constructed to be in violation of New York law, as amended, and any amendment or\nreplacement thereto, shall not in any way render the remaining provisions invalid.\nARTICLE XIV. DIRECTOR AND OFFICER INDEMNIFICATION [55 721 to 726]\nThe corporation shall indemnify any person acting on its behalf in accord with the law\nof New York. The indemnification provided hereby shall not be deemed exclusive of any\nother right to which anyone seeking indemnification thereunder may be entitled under any\nbylaw, agreement, or otherwise, both as to action in his official capacity and as to action in\nanother capacity while holding such office. The corporation may purchase and maintain\ninsurance on the behalf of any Director, officer, agent, employee or former Director or officer\nor other person, against any liability asserted against them and incurred by him.\nAdopted this\n26 th day of\nAgrtl\n2022 by the Incorporators/Board of Directors.\n[5404.601]\nSecretary\nAttest:\n[Seal]\nwhay Cing Xioung\nPresidentpcorporator\nNY Bylaws.11\n\n--- Page 15 ---\nKINGS ELEVATOR PARTS INC.\n154-05 BARCLAY AVE, FLUSHING NY 11355\nMINUTES OF MEETING OF THE BOARD OF SHAREHOLDERS\nOF\nKINGS ELEVATOR PARTS INC.\n1. The meeting was held at 154-05 Barclay Ave, Flushing NY 11355. It was determined that a quorum\nwas present in person, and the meeting could conduct business.\n2. Qing Xiang Wang was in attendance.\n3. There was presented to the meeting:\nA copy of the certificate of incorporation\nA copy of the by-laws of the corporation adopted by the incorporator\nStock certificates(If decided to produce)\nThe corporate record book\n4. The shareholders ratified and approved all documents presented.\n5. Upon motion duly made, seconded and unanimously carried, it was resolved Shareholders:\nQing Xiang Wang\nFuzhou Shinestone Trade Co., LTD.\nMinutes of Meeting of Shareholders\nPage 1\n\n--- Page 16 ---\nKINGS ELEVATOR PARTS INC.\n154-05 BARCLAY AVE,FLUSHING NY 11355\n6. Upon motion duly made, seconded and unanimously carried, it was resolved that Shares percentage\nlisted:\nName\nShares Percentage\nShares\nQING XIANG WANG\n49%\n98\nFUZHOU SHINESTONE TRADE CO., LTD.\n51%\n102\n7. Upon motion duly made, seconded and unanimously carried, it was resolved that the joint and\nindividual acts of the incorporator(s) listed on the article of certificate, were taken on behalf of the\ncorporation, are approved, ratified, and adopted as acts of the corporation.\nThere was no further business, and upon motion made, seconded, and unanimously carried, it was\nRESOLVED, that all the items and documents have been examined by all shareholders, and are approved\nand adopted, and that all actions taken thus far have been ratified and approved by the shareholders of\nthe Corporation\nThere being no further business, upon motion made and carried, the meeting was adjourned.\nCiemay iang vong\nQING XIANG WANG\n121512023\npignature\nPrinted Name\nDate\nMinutes of Meeting of Shareholders\nPage 2\n\n--- Page 17 ---\nTD\nBank\nAmerica's Most Convenient Bank\nT\nSTATEMENT OF ACCOUNT\nKINGS ELEVATOR PARTS INC\nPage:\n1of4\n15405 BARCLAY AVE\nStatement Period:\nJun 01 2024-Jun 30 2024\nFLUSHING NY 11355\nCust Ref#:\n4414084460-717-T-##\nPrimary Account #：\n441-4084460\nTD Business Convenience Plus\nKINGS ELEVATOR PARTS INC\nAccount#441-4084460\nACCOUNT SUMMARY\nBeginning Balance\n80,401.51\nAverage Collected Balance\n242,398.64\nElectronic Deposits\n46,697.00\nInterest Earned This Period\n0.00\nOther Credits\n500,000.00\nInterest Paid Year-to-Date\n0.00\nAnnual Percentage Yield Earned\n0.00%\nChecks Paid\n101,675.88\nDays in Period\n30\nElectronic Payments\n2,370.39\nOther Withdrawals\n136,568.63\nService Charges\n3.00\nEnding Balance\n386,480.61\nTotal for this cycle\nTotal Year to Date\nGrace Period OD/NSF Refund\n$0.00\n$70.00\nDAILY ACCOUNT ACTIVITY\nElectronic Deposits\nPOSTING DATE\nDESCRIPTION\nAMOUNT\n06/25\nCCD DEPOSIT, INNOCORE PRO ELE KEP\n35,000.00\n06/26\nCCD DEPOSIT, INNOCORE PRO ELE KEP\n11,697.00\nSubtotal:\n46,697.00\nOther Credits\nPOSTING DATE\nDESCRIPTION\nAMOUNT\n06/14\nWIRE TRANSFER INCOMING, FUZHOU SHINESTONE TRADE CO.,LTD\n500,000.00\nSubtotal:\n500,000.00\nChecks Paid\nNo.Checks:17\n*Indicates break in serial sequence or check processed electronically and listed under Electronic Payments\nDATE\nSERIAL NO.\nAMOUNT\nDATE\nSERIALNO.\nAMOUNT\n06/05\n151\n1,241.30\n06/04\n164\n10,455.00\n06/05\n154*\n1,241.30\n06/17\n165\n70.00\n06/03\n159*\n30,000.00\n06/14\n166\n1,132.53\n06/04\n161*\n82.04\n06/18\n167\n536.75\n06/28\n162\n1,298.07\n06/17\n169*\n963.62\n06/04\n163\n854.96\n06/24\n170\n38,500.00\nCall1-800-937-2000for24-hourBank-by-Phoneservicesorconnecttowww.tdbank.com\nBank Deposits FDIC Insured | TD Bank, N.A.| Equal Housing Lender\n\n--- Page 18 ---\nHow to Balance your Account\nPage:\n2 of 4\nBegin by adjusting your account register\nYour ending balance shown on this\nas follows:\nstatement is:\nEnding\n386,480.61\n. Subtract any services charges shown\nBalance\non this statement.\n2. List below the amount of deposits or\ncredit transfers which do not appear\n. Subtract any automatic payments,\non this statement. Total the deposits\nTotal\n+\ntransfers or other electronic with-\nand enter on Line 2.\nDeposits\ndrawals not previously recorded.\n. Add any interest earned if you have\n3. Subtotal by adding lines 1 and 2.\nan interest-bearing account.\n4. List below the total amount of\nSub Total\n. Add any automatic deposit or\noverdraft line of credit.\nwithdrawals that do not appear on\nthis statement. Total the withdrawals\n. Review all withdrawals shown on this\nand enter on Line 4.\nTotal\nstatement and check them off in your\nWithdrawals\naccount register.\n5. Subtract Line 4 from 3. This adjusted\n. Follow instructions 2-5 to verify your\nbalance should equal your account\nending account balance.\nbalance.\nAdjusted\nBalance\nDEPOSITS NOT\nDOLLARS\nCENTS\nWITHDRAWALS NOT\nDOLLARS\nCENTS\nWITHDRAWALS NOT\nDOLLARS\nCENTS\nON STATEMENT\nONSTATEMENT\nON STATEMENT\nTotal\nTotal Deposits\nWithdrawals\nFOR CONSUMER ACCOUNTS ONLY-IN CASE OF ERRORS OR\nFOR CONSUMER LOAN ACCOUNTS ONLY-BILLING RIGHTS\nQUESTIONS ABOUT YOUR ELECTRONIC FUNDS TRANSFERS:\nSUMMARY\nIf you need information about an electronic fund transfer or if you believe there is an\nIn case of Errors or Questions About Your Bil:\nerror on your bank statement or receipt relating to an electronic fund transfer,\nIf you think your bil is wrong, or if you need more information about a transaction on\ntelephone the bank immediately at the phone number listed on the front of your\nyour bill, write us at P.O. Box 1377， Lewiston, Maine 04243-1377 as soon as\nstatement or write to:\npossible. We must hear from you no later than sixty (60) days after we sent you the\nTD Bank, N.A., Deposit Operations Dept, P.O. Box 1377， Lewiston,\nFIRST bil on which the error or problem appeared. You can telephone us, but doing\nMaine 04243-1377\nso wil not preserve your rights. In your letter, give us the following information:\nWe must hear from you no later than sixty(60) calendar days after we sent you the\n.Your name and account number.\nfirst statement upon which the error or problem first appeared. When contacting the\n.The dollar amount of the suspected error.\nBank, please explain as clearly as you can why you believe there is an error or why\n. Describe the error and explain, if you can, why you believe there is an error.\nmore information is needed. Please include:\nIf you need more information, describe the item you are unsure about.\nYou do not have to pay any amount in question while we are investigating, but you\n.Your name and account number.\n. A description of the error or transaction you are unsure about.\nare stil obligated to pay the parts of your bill that are not in question. While we\n. The dollar amount and date of the suspected error.\ninvestigate your question, we cannot report you as delinquent or take any action to\nWhen making a verbal inquiry, the Bank may ask that you send us your complaint in\ncollect the amount you question.\nwriting within ten(10) business days after the first telephone call.\nFINANCE CHARGES: Although the Bank uses the Daily Balance method to calculate\nWe will investigate your complaint and will correct any error promptly. If we take more\nthe finance charge on your Moneyline/Overdraft Protection account(the term \"ODP\"\nor \"OD\" refers to Overdraft Protection), the Bank discloses the Average Daily Balance\nthan ten(10) business days to do this, we will credit your account for the\non the periodic statement as an easier method for you to calculate the finance\namount you think is in error, so that you have the use of the money during the time it\ncharge. The finance charge begins to accrue on the date advances and other debits\ntakes to complete our investigation.\nare posted to your account and wil continue until the balance has been paid in full.\nINTEREST NOTICE\nTo compute the finance charge, multiply the Average Daily Balance times the Days in\nTotal interest credited by the Bank to you this year will be reported by the Bank to the\nPeriod times the Daily Periodic Rate (as listed in the Account Summary section on\nInternal Revenue Service and State tax authorities. The amount to be reported will be\nthe front of the statement). The Average Daily Balance is calculated by adding the\nreported separately to you by the Bank.\nbalance for each day of the billing cycle, then dividing the total balance by the number\nof Days in the Billing Cycle. The daily balance is the balance for the day after\nadvances have been added and payments or credits have been subtracted plus or\nminus any other adjustments that might have occurred that day. There is no grace\nperiod during which no finance charge accrues. Finance charge adjustments are\nincluded in your total finance charge.\n\n--- Page 19 ---\nTD\nBank\nAmerica's Most Convenient Bank\nSTATEMENT OF ACCOUNT\nKINGS ELEVATOR PARTS INC\nPage:\n3of 4\nStatement Period:\nJun 01 2024-Jun 30 2024\nCust Ref#:\n4414084460-717-T-##\nPrimary Account #：\n441-4084460\nDAILY ACCOUNT ACTIVITY\nChecks Paid(continued)\n*Indicates break in serial sequence or check processed electronically and listed under Electronic Payments\nDATE\nSERIAL NO.\nAMOUNT\nDATE\nSERIAL NO.\nAMOUNT\n06/24\n171\n7,847.44\n06/28\n178*\n1,016.26\n06/24\n172\n3,399.08\n06/25\n179\n1,905.00\n06/28\n174*\n1,132.53\nSubtotal:\n101,675.88\nElectronic Payments\nPOSTING DATE\nDESCRIPTION\nAMOUNT\n06/07\nCCD DEBIT, NYS DTF WT TAX PAYMNT 000000114702454\n432.34\n06/07\nELECTRONIC PMT-WEB, T-MOBILE PCS SVC 4904967\n65.90\n06/14\nCCD DEBIT, IRS USATAXPYMT 274456695603698\n1,724.75\n06/21\nCCD DEBIT, CON ED OF NY CECONY 91817758419\n147.40\nSubtotal:\n2,370.39\nOther Withdrawals\nPOSTING DATE\nDESCRIPTION\nAMOUNT\n06/03\nWIRE TRANSFER OUTGOING, G Technologies Co Ltd\n31,119.13\n06/03\nWIRE TRANSFER FEE\n50.00\n06/14\nWIRE TRANSFER FEE\n15.00\n06/18\nWIRE TRANSFER OUTGOING, G TECHNOLOGIES CO. LTD\n105,334.50\n06/18\nWIRE TRANSFER FEE\n50.00\nSubtotal:\n136,568.63\nService Charges\nPOSTING DATE\nDESCRIPTION\nAMOUNT\n06/28\nPAPER STATEMENT FEE\n3.00\nSubtotal:\n3.00\nDAILY BALANCE SUMMARY\nDATE\nBALANCE\nDATE\nBALANCE\n05/31\n80,401.51\n06/18\n395,032.39\n06/03\n19,232.38\n06/21\n394,884.99\n06/04\n7,840.38\n06/24\n345,138.47\n06/05\n5,357.78\n06/25\n378,233.47\n06/07\n4,859.54\n06/26\n389,930.47\n06/14\n501,987.26\n06/28\n386,480.61\n06/17\n500,953.64\nPlease see important information on the back page\nCall1-800-937-2000for24-hourBank-by-Phoneservicesorconnecttowww.tdbank.com\nBank Deposits FDIC Insured | TD Bank, N.A. | Equal Housing Lender\n\n--- Page 20 ---\nBank\nAmerica's Most Convenient Bank\nSTATEMENT OF ACCOUNT\nKINGS ELEVATOR PARTS INC\nPage:\n4 of 4\nStatement Period:\nJun 01 2024-Jun 30 2024\nCust Ref #：\n4414084460-717-T-##\nPrimary Account #：\n441-4084460\nImportant Notice About Your Account\nWe're committed to keeping you informed when it comes to your banking. Effective immediately, we're\nupdating our Business Deposit Account Agreement (BDAA) for our business, commercial and government\nbanking accounts. Here's a summary of the changes:\nEliminating the Non-Sufficient Funds (NSF) Fee. We will no longer be charging you a\nNon-Sufficient Funds Fee for returned checks or other unpaid items when your available account\nbalance is not sufficient to pay the item. If an item returned unpaid is re-presented to us for payment,\nwe may, in our sole discretion, pay the re-presented item (creating an overdraft).\nWithdrawal Policy. We may require advance notice or place reasonable restrictions on when and\nhow you make any large cash withdrawal or cash checks.\nVisa Debit Cards and Preventing Misuse. We can issue up to five Visa Debit Cards per account.\nPlease contact us immediately when a signer or cardholder no longer has authority to use your\naccount so we can remove their access to your account.\nDisputes, Account Restrictions, Legal Process. If we are notified of a dispute or suspect\nimproper account activity, we can restrict your account until it is resolved to our satisfaction. We may\naccept legal process electronically.\nTD Early Pay. ACH credits coded as direct deposits may be credited to your account and funds\nmade available up to two business days early, subject to these terms.\nZelle®. Small Business customers may send or receive funds using Zelle subject to eligibility criteria\nand limitations, and the Zelle service terms.\nMiscellaneous. You are responsible for ensuring that any person who conducts transactions on your\naccount is aware of and complies with the BDAA. We have added terms and conditions for receiving\ncertain bonuses and promotions.\nAll updates and the full details mentioned above are included in the updated BDAA that can be viewed\nanytimeattdbank.com/exc/pdf/business-deposit-agreement.pdf. If you have any questions, call us at\n1-800-493-7562 or visit a TD Bank near you.\nCall1-800-937-2000for24-hourBank-by-Phoneservicesorconnecttowww.tdbank.com\nBank Deposits FDIC Insured | TD Bank, N.A. | Equal Housing Lender","ocr_status":"completed","exhibit_number":"A-2","exhibit_title":"Exhibit A2_pdf","created_at":"2025-11-27T19:30:22.566245"},{"id":"fd6e1c92-a55f-4137-af81-a9ebac447c7a","project_id":"project-1764271674391","file_name":"Exhibit A3.pdf","file_type":"application/pdf","file_size":30219025,"page_count":20,"ocr_text":"--- Page 1 ---\nExhibit A-3\n\n--- Page 2 ---\nForm\n1120\nU.S. Corporation Income Tax Return\nOMB No.1545-0123\nFor calendar year 2023 or tax year beginning Apr 1， 2023， ending Mar 31,20 24\nDepartment of the Treasury\n-------\nGoto www.irs.gov/Form1120 forinstructions and the latest information.\n2023\nInternal Revenue Service\nA Check if:\nName\nB Employer identification number\n1a Consolidated return\n(attach Form 851)\nTYPE\nKINGS ELEVATOR PARTS INC\n88-1927324\nb Life/nonlife consoli-\nOR\nNumber, street, and room or suite no. If a P.O. box, see instructions.\nC Date incorporated\ndated return.\n2 Personal holding co.\nPRINT\n154-05 BARCLAY AVE\n04/22/2022\n(attach Sch. PH).\nCity or town, state or province, country, and ZIP or foreign postal code\nD Total assets (see instructions)\n3\n3 Personal service corp.\n(see instructions).\nFLUSHING\nNY 11355\n$\n670,867\n4 Schedule M-3 attached\nE Check if: (1) Initial return\n(2)\nFinal return\n(3)\nName change\n(4)\nAddress change\n1a\nGross receipts or sales\n1a\n741,227\nb\nReturns and allowances. . .. . .. . . . . .......\n1b\nc\n1c\n741,227\n2\nCost of goods sold (attach Form 1125-A).\n2\n588,257\n3\nGross profit. Subtract line 2 from line 1c. ....................\n3\n152,970\nawooul\nDividends and inclusions(Schedule C, line 23)..............\n4\n4567890\nInterest .............................\n5\nGross rents .............................\n6\nGross royalties ...···.···················..\n7\nCapital gain net income (attach Schedule D(Form 1120)......\n8\nNet gain or (loss) from Form 4797， Part Il, line 17 (attach Form 4797)\n9\nOther income(see instructions-attach statement)........\n10\n11\nTotal income. Add lines 3 through 10...\n11\n152,970\nCompensation of officers (see instructions-attach Form 1125-E)\n12\nSalaries and wages (less employment credits)\n13\n11,680\nRepairs and maintenance ...\n14\nBad debts..······\n15\n(suoponpap uo suoneywll Jo suononnsu]aas)suononpaa\n13141567181502232428080\nRents.··········\n16\n54,300\nTaxes and licenses .....\n17\n2,592\nInterest(see instructions)...\n18\n19\nDepreciation from Form 4562 not claimed on Form 1125-A or elsewhere on return (attach Form 4562)\n20\n4,720\nDepletion . .......\n21\nAdvertising . ........\n22\nPension, profit-sharing, etc., plans\n23\nEmployee benefit programs\n24\nEnergy efficient commercial buildings deduction (attach Form 7205).....\n25\nOther deductions (attach statement). Other Deductions Statement\n26\n76,861\nTotal deductions. Add lines 12 through 26\n27\n150,153\nTaxable income before net operating loss deduction and special deductions. Subtract line 27 from line 11..\n28\n2,817\nNet operating loss deduction (see instructions)...........\n29a\nb\nSpecial deductions (Schedule C, line 24). ............\n29b\nc\nAdd lines 29a and 29b . .........······...····...\n29c\nTaxable income. Subtract line 29c from line 28. See instructions.............\n30\n2,817\nTotal tax (Schedule J, Part I, line 11)...................\n31\n592\nReserved for future use............·.·...........\n32\nsquawhed\nTotal payments and credits (Schedule J, Part ll, line 23)................\n33\n592\nEstimated tax penalty. See instructions. Check if Form 2220 is attached..........\n34\n0\nAmount owed. If line 33 is smaller than the total of lines 31 and 34， enter amount owed.......\n35\nOverpayment. If line 33 is larger than the total of lines 31 and 34， enter amount overpaid.....\n36\n0\nEnter amount from line 36 you want: Credited to 2024 estimated tax\nRefunded\n37\nUnder penalties of perjury, I declare that I have examined this returm,including accompanying schedules and statements, and to the best of my knowledge and belief,it is tue, correct, and\nSign\ncomplete. Declaration of preparer (other than taxpayer) is based on all information of which preparer has any knowledge.\nMay the IRS discuss this return\nHere\nPRESIDENT\nwith the preparer shown below?\nSee instructions.  Yes No\nSignature of officer\nDate\nTitle\nPrint/Type preparer's name\nPreparer's signature\nDate\nPTIN\nPaid\nCheck □if\nPreparer\nVINCENT HUANG, CPA\nVINCENT HUANG, CPA\n08/21/2024\nself-employed\nP01561199\nUse Only\nFirm's name\nVINCENT HUANG CPA P.C.\nFirm's EIN 85-2476956\nFirm's address\n758 58TH ST STE B5 BROOKLYN NY 11220\nPhone no.(718)765-0008\nFor Paperwork Reduction Act Notice, see separate instructions. REV 05/09/24 PRO\nForm 1120(2023)\nBAA\n\n--- Page 3 ---\nForm 1120(2023)\nPage2\nSchedule C\nDividends, Inclusions, and Special Deductions\n(a)Dividends and\n(b)%\n(c)Special deductions\n(see instructions)\ninclusions\n(a)×(b)\n1 Dividends from less-than-20%-owned domestic corporations (other than debt-financed\n50\n2 Dividends from 20%-or-more-owned domestic corporations (other than debt-financed\nstock).·······················\n65\nSee\n3 Dividends on certain debt-financed stock of domestic and foreign corporations..\ninstructions\n4 Dividends on certain preferred stock of less-than-20%-owned public utilities...\n23.3\n5 Dividends on certain preferred stock of 20%-or-more-owned public utilities. . ..\n26.7\n6 Dividends from less-than-20%-owned foreign corporations and certain FSCs...\n50\n7 Dividends from 20%-or-more-owned foreign corporations and certain FSCs...\n65\n8 Dividends from wholly owned foreign subsidiaries ...........\n100\nSee\n9 Subtotal. Add lines 1 through 8. See instructions for limitations...\ninstructions\n10 Dividends from domestic corporations received by a small business investment\ncompany operating under the Small Business Investment Act of 1958....\n100\n11 Dividends from affiliated group members.\n100\n12 Dividends from certain FSCs...\n100\n13 Foreign-source portion of dividends received from a specified 10%-owned foreign\ncorporation (excluding hybrid dividends) (see instructions).\n100\n14 Dividends from foreign corporations not included on line 3， 6， 7， 8， 11， 12， or 13\n(including any hybrid dividends)...\n15 Reserved for future use ....\n16a Subpart F inclusions derived from the sale by a controlled foreign corporation(CFC) of\nthe stock of a lower-tier foreign corporation treated as a dividend (attach Form(s)5471)\n100\nb Subpart F inclusions derived from hybrid dividends of tiered corporations (attach Form(s)\n·······\nc Other inclusions from CFCs under subpart F not included on line 16a, 16b, or 17(attach\nForm(s)5471)(see instructions).....\n·········\n17 Global Intangible Low-Taxed Income (GILTI)(attach Form(s) 5471 and Form 8992)..\n18 Gross-up for foreign taxes deemed paid . .............\n19 IC-DISC and former DISC dividends not included on line 1， 2， or 3......\n20 Other dividends .....................\n21 Deduction for dividends paid on certain preferred stock of public utilities. ...\n22 Section 250 deduction (attach Form 8993)...........\n23 Total dividends and inclusions. Add column (a), lines 9 through 20. Enter here and on\n24 Total special deductions. Add column (c), lines 9 through 22. Enter here and on page 1， line 29b.......\nREV 05/09/24 PRO\nForm 1120(2023)\n\n--- Page 4 ---\nForm 1120(2023)\nPage 3\nSchedule J\nTax Computation and Payment(see instructions)\nPart I-Tax Computation\n1 Income tax. See instructions........................\n1\n592\n2\n2 Base erosion minimum tax amount (attach Form 8991)........\n2\n3 Corporate alternative minimum tax from Form 4626， Part lI, line 13 (attach Form 4626)........\n3\n4 Add lines 1,2， and 3.................\n4\n592\n5a Foreign tax credit (attach Form 1118)...............\n5a\nb Credit from Form 8834(see instructions). . ............\n5b\nc General business credit (see instructions-attach Form 3800)........\n5c\nd Credit for prior year minimum tax (attach Form 8827)..........\n5d\ne Bond credits from Form 8912................\n5e\n6\n6 Total credits. Add lines 5a through 5e.....\n6\n7 Subtract line 6 from line 4...................\n7\n592\n8 Personal holding company tax (attach Schedule PH (Form 1120). ......\n8\n9a Recapture of investment credit (attach Form 4255)...........\n9a\nb Recapture of low-income housing credit (attach Form 8611).... ....\n9b\nc Interest due under the look-back method-completed long-term contracts (attach\nForm 8697).······················\n9c\nd Interest due under the look-back method-income forecast method (attach Form 8866)\n9d\nPart Il-Payments and Refundable Credits\n12\n13\n14\nCurrent year's estimated tax payments\n15\nCurrent year's refund applied for on Form 4466\n16\nCombine lines 13， 14， and 15...\n17\nTax deposited with Form 7004...\n18\nWithholding(see instructions)...\n19\nTotal payments. Add lines 16， 17， and 18.\n20\nRefundable credits from:\na\nForm 2439.........，\nb\nCOPY\ne Alternative tax on qualifying shipping activities (attach Form 8902).....\n9e\nf Interest/tax due under section 453A(c).\n9f\ng Interest/tax due under section 453(1).\n9g\n9z\n10 Total. Add lines 9a through 9z ...\n10\n11 Total tax. Add lines 7， 8， and 10. Enter here and on page 1， line 31\n11\n592\nReserved for future use. ...\n12\nPreceding year's overpayment credited to the current year.\n13\n14\n15\n(\n16\n17\n592\n18\n19\n592\n20a\nForm 4136.........\n20b\nc\nReserved for future use . ....\n20c\nz\nOther(attach statement-see instructions)\n20z\n21 Total credits. Add lines 20a through 20z..\n21\n22\nElective payment election amount from Form 3800\n22\n23 Total payments and credits. Add lines 19， 21， and 22. Enter here and on page 1， line 33........\n23\n592\nREV 05/09/24 PRO\nForm 1120(2023)\n\n--- Page 5 ---\nForm 1120(2023)\nPage4\nSchedule K Other Information (see instructions)\n1 Check accounting method: a Cash\nb  Accrual\nc□Other (specify)\nYes\nNo\n2 See the instructions and enter the:\na Business activity code no. 444180\nb Business activity ELEVATOR PARTS\nc Product or service ELEVATOR PARTS\n3 Is the corporation a subsidiary in an affiliated group or a parent-subsidiary controlled group?..........\n×\nIf \"Yes,\"enter name and EIN of the parent corporation\n4 At the end of the tax year:\na Did any foreign or domestic corporation, partnership (including any entity treated as a partnership), trust, or tax-exempt\norganization own directly 20% or more, or own, directly or indirectly, 50% or more of the total voting power of all classes of the\ncorporation's stock entitled to vote? If \"Yes,\" complete Part I of Schedule G(Form 1120) (attach Schedule G)......\n×\nb Did any individual or estate own directly 20% or more, or own, directly or indirectly, 50% or more of the total voting power of all\nclasses of the corporation's stock entitled to vote? If \"Yes,\" complete Part Il of Schedule G (Form 1120) (attach Schedule G).\n×\n5 At the end of the tax year, did the corporation:\na Own directly 20% or more, or own, directly or indirectly, 50% or more of the total voting power of all classes of stock entitled to vote of\nany foreign or domestic corporation not included on Form 851， Affiliations Schedule? For rules of constructive ownership, see instructions\n×\nIf \"Yes,\"complete (i) through (iv) below.\n(i)Employe\n(iv)Percentage\n(i)Name of Corporation\nIdentification Number\n(lii)Country of\nOwned in Voting\n(if any)\nIncorporation\nStock\nb Own directly an interest of 20% or more, or own, directly or indirectly, an interest of 50% or more in any foreign or domestic partnership\n(including an entity treated as a partnership) or in the beneficial interest of a trust? For rules of constructive ownership, see instructions\n×\nIf \"Yes,\"complete (i) through (iv) below.\n(i)Employer\n(i)Name of Entity\nIdentification Number\n(ii)Country of\n(iv)Maximum\n(if any)\nOrganization\nPercentage Owned in\nProfit,Loss, or Capital\n6 During this tax year, did the corporation pay dividends (other than stock dividends and distributions in exchange for stock) in\nexcess of the corporation's current and accumulated earnings and profits? See sections 301 and 316........\n×\nIf \"Yes,\" file Form 5452， Corporate Report of Nondividend Distributions. See the instructions for Form 5452.\nIf this is a consolidated return, answer here for the parent corporation and on Form 851 for each subsidiary.\n7 At any time during this tax year, did one foreign person own, directly or indirectly, at least 25% of the total voting power of all\n7\nclasses of the corporation's stock entitled to vote or at least 25% of the total value of all classes of the corporation's stock?.\n×\nFor rules of attribution, see section 318. If \"Yes,\"enter:\n(a)Percentage owned 51.\nand(b)Owner's country CH\n(c)The corporation may have to file Form 5472， Information Return of a 25% Foreign-Owned U.S. Corporation or a Foreign\nCorporation Engaged in a U.S. Trade or Business. Enter the number of Forms 5472 attached 1\n8 Check this box if the corporation issued publicly offered debt instruments with original issue discount.......\nIf checked, the corporation may have to file Form 8281， Information Return for Publicly Offered Original Issue Discount Instruments.\n9 Enter the amount of tax-exempt interest received or accrued during this tax year $\n9\n10\nEnter the number of shareholders at the end of the tax year (if 100 or fewer)\n11\nIf the corporation has an NOL for the tax year and is electing to forego the carryback period, check here (see instructions).□\nIf the corporation is filing a consolidated returm, the statement required by Regulations section 1.1502-21(b)(3) must be attached\nor the election will not be valid.\n12 Enter the available NOL carryover from prior tax years (do not reduce it by any deduction reported on page 1， line 29a) $\nForm 1120(2023)\nREV 05/09/24 PRO\n\n--- Page 6 ---\nForm 1120(2023)\nPage 5\nSchedule K\nOther Information (continued from page 4)\nAre the corporation's total receipts (page 1， line 1a, plus lines 4 through 10) for the tax year and its total assets at the end of the\nYes\nNo\n13\ntax year less than $250,0002....\n×\n···············\nIf \"Yes,\" the corporation is not required to complete Schedules L, M-1, and M-2. Instead, enter the total amount of cash\ndistributions and the book value of property distributions (other than cash) made during this tax year $\n14 Is the corporation required to file Schedule UTP (Form 1120)， Uncertain Tax Position Statement? See instructions\n×\nIf \"Yes,\"complete and attach Schedule UTP.\n15a Did the corporation make any payments that would require it to file Form(s) 1099？.\n×\nb If\"Yes,\"did or will the corporation file required Form(s) 1099？. ........\n16 During this tax year, did the corporation have an 80%-or-more change in ownership, including a change due to redemption of its\n×\nown stock?....\n·············\n17\nDuring or subsequent to this tax year, but before the filing of this return, did the corporation dispose of more than 65% (by value)\nof its assets in a taxable, non-taxable, or tax deferred transaction?...\n×\n18\nDid this corporation receive assets in a section 351 transfer in which any of the transferred assets had a fair market basis or fair\n×\nmarket value of more than $1 million?.........\n19\nDuring this corporation's tax year, did the corporation make any payments that would require it to file Forms 1042 and 1042-S\nunder chapter 3(sections 1441 through 1464) or chapter 4(sections 1471 through 1474) of the Code?.....\n×\n20\nIs the corporation operating on a cooperative basis?..\n+\n21\nDuring this tax year, did the corporation pay or accrue any interest or royalty for which the deduction is not allowed under\n×\nsection 267A? See instructions_\nIf \"Yes,\"enter the total amount of the disallowed deductions $\n22\nDoes this corporation have gross receipts of at least $500 million in any of the 3 preceding tax years? (See sections 59A(e)(2) and (3).)\n×\nIf\"Yes,\"complete and attach Form 8991.\n23 Did the corporation have an election under section 163() for any real property trade or business or any farming business in effect\n×\nduring this tax year? See instructions.\n24\nDoes the corporation satisfy one or more of the following? If \"Yes,\"complete and attach Form 8990. See instructions\n×\naThe corporation owns a pass-through entity with current, or prior year carryover, excess business interest expense.\nb The corporation's aggregate average annual gross receipts (determined under section 448(c) for the 3 tax years preceding the\ncurrent tax year are more than $29 million and the corporation has business interest expense.\nc The corporation is a tax shelter and the corporation has business i\ntexpens\n25 Is the corporation attaching Form 8996 to certify as a Qualified Opportunity Fund?\nIf \"Yes,\"enter amount from Form 8996， line 15\n8\n26\nSince December 22， 2017， did a foreign corporation directly or indirectly acquire substantially all of the properties held directly or\nindirectly by the corporation, and was the ownership percentage (by vote or value) for purposes of section 7874 greater than\n50%(for example, the shareholders held more than 50% of the stock of the foreign corporation)? If \"Yes,\" list the ownership\npercentage by vote and by value. See instructions.\n十\nPercentage:ByVote\nBy Value\n27\nAt any time during this tax year, did the corporation (a) recelve a digital asset (as a reward, award, or payment for property or\nservices); or (b) sell, exchange, or otherwise dispose of a digital asset (or a financial interest in a digital asset)? See instructions.\n×\n28 Is the corporation a member of a controlled group?.\n×\nIf \"Yes,\"attach Schedule O(Form 1120). See instructions.\n29 Corporate Alternative Minimum Tax:\na Was the corporation an applicable corporation under section 59(k)(1) in any prior tax year?........\n×\nIf \"Yes,\" go to question 29b. If \"No,\"skip to question 29c.\nb Is the corporation an applicable corporation under section 59(k)(1) in the current tax year because the corporation was an\napplicable corporation in the prior tax year?. . ...\nIf \"Yes,\"complete and attach Form 4626. If \"No,\"continue to question 29c.\nc Does the corporation meet the requirements of the safe harbor method as provided under section 59(k)(3)(A) for the current tax\nyear? See instructions..\nx\nIf “No,\"complete and attach Form 4626. If \"Yes,\" the corporation is not required to file Form 4626.\n30 Is the corporation required to file Form 7208 relating to the excise tax on repurchase of corporate stock (see instructions):\na Under the rules for stock repurchased by a covered corporation (or stock acquired by its specified affiliate)?..\n+\nb Under the applicable foreign corporation rules?..\n+\nc Under the covered surrogate foreign corporation rules?.\n+\nIf \"Yes” to either (a),(b), or (c), complete Form 7208， Excise Tax on Repurchase of Corporate Stock. See the Instructions for\nForm 7208.\n31 Is this a consolidated return with gross receipts or sales of $1 billion or more and a subchapter K basis adjustment, as described\nin the instructions, of $10 million or more?..\n×\nIf \"Yes,\"attach a statement. See instructions\nForm 1120(2023)\nREV05/09/24PRO\n\n--- Page 7 ---\nForm 1120(2023)\nPage6\nSchedule L\nBalance Sheets per Books\nBeginning of tax year\nEnd of tax year\nAssets\n(a)\n(b)\n(c)\n(d)\n1\nCash ............\n1,396.\n12,915.\n2a\nTrade notes and accounts receivable\n500,000.\nb\nLess allowance for bad debts...\n(\n(\n)\n500,000.\n3\nInventories. . . ........\n45,166.\n4\nU.S. government obligations...\n5\nTax-exempt securities(see instructions)\n6\nOther current assets (attach statement)\n7\nLoans to shareholders .......\n8\nMortgage and real estate loans .....\n9\nOther investments (attach statement)\n10a\nBuildings and other depreciable assets\n94,406.\nb\nLess accumulated depreciation.\n(\n4,720.)\n89,686.\n11a\nDepletable assets. ........\nb\nLess accumulated depletion.....\n)\n(\n)\n12\nLand (net of any amortization)...\n13a\nIntangible assets(amortizable only)\nb\nLess accumulated amortization .\n(\n)\n14\nOther assets(attach statement).\n23,100.\n15\nTotal assets..........\n396.\n670,867.\nLiabilities and Shareholders'Equity\n16\nAccounts payable.......\n20\n820.\n17\nMortgages, notes, bonds payable in less than 1 year\n18\nOther current liabilities (attach statement)..\n62.\n137,308.\n19\nLoans from shareholders.....,,\n30,000.\n20\nMortgages, notes, bonds payable in 1 year or more\n21\nOther liabilities(attach statement)....\n22\nCapital stock: a Preferred stock....\nb Common stock..\n500.\n500.\n500\n23\n500,000.\n24\nRetained earnings-Appropriated(attach statement)\n25\nRetained earnings-Unappropriated.\n14.\n2,239.\n26\nAdjustments to shareholders'equity(attach statement)\n27\nLess cost of treasury stock.....\n(\n)\n(\n)\n28\nTotal liabilities and shareholders'equity\n1,396.\n670,867.\nSchedule M-1\nReconciliation of Income (Loss) per Books With Income per Returm\nNote: The corporation may be required to file Schedule M-3. See instructions.\n1\nNet income (loss) per books.....\n2,225.\n7\nIncome recorded on books this year\n2\nFederal income tax per books.....\n592.\nnot included on this return(itemize):\n3\nExcess of capital losses over capital gains.\nTax-exempt interest $\n4\nIncome subject to tax not recorded on books\nthis year (itemize):\n8\nDeductions on this return not charged\n5\nExpenses recorded on books this year not\nagainst book income this year (itemize):\ndeducted on this return(itemize):\na\nDepreciation..$\na\nDepreciation....$\nb\nCharitable contributions $\nb Charitable contributions.$\nc Travel and entertainment.$\n9\nAdd lines 7 and 8......\n6\nAdd lines 1 through 5.\n2,817.\n10\nIncome(page 1， line 28)-line 6 less line 9\n2,817\nSchedule M-2 Analysis of Unappropriated\nRetained Earnings per Books(Schedule L, Line 25)\n1\nBalance at beginning of year\n·····\n14.\n5\n5 Distributions: a Cash. ....\n2\nNet income (loss) per books. . ....\n2,225.\nb Stock\n····\n3\nOther increases (itemize):\nc Property\n6\nOther decreases (itemize):\n7\nAdd lines 5 and 6\n4\nAdd lines 1， 2， and 3........\n2,239.\n8\nBalance at end of year (line 4 less line 7)\n2,239\nREV 05/09/24 PRO\nForm 1120(2023)\n\n--- Page 8 ---\nForm 1125-A\nCost of Goods Sold\nOMB No.1545-0123\n(Rev. November 2018)\nAttach to Form 1120,1120-C, 1120-F, 1120S, or 1065.\nDepartment of the Treasury\nInternal Revenue Service\nGotowww.irs.gov/Form1125A for the latestinformation.\nName\nEmployer identification number\nKINGS ELEVATOR PARTS INC\n88-1927324\n1 Inventory at beginning of year.............\n1\n2\nPurchases.··························\n2\n633,423\n3\nCost of labor.....·.···················\n3\n4\nAdditional section 263A costs (attach schedule). ....\n4\n5\nOther costs (attach schedule).......·······\n5\n6 Total. Add lines 1 through 5................\n6\n633,423\n7 Inventory at end of year. ......................\n7\n45,166\n8 Cost of goods sold. Subtract line 7 from line 6. Enter here and on Form 1120， page 1， line 2 or the\nappropriate line of your tax return. See instructions. . . ··.\n8\n588,257\n9a Check all methods used for valuing closing inventory:\n1)区 Cost\n(ii)□ Lower of cost or market\n(ii)□Other (Specify method used and attach explanation.)\nbCheck if there was a writedown of subnormal goods\nc Check if the LIFO inventory method was adopted this tax year for any goods (if checked, attach Form 970)......\nd If the LIFO inventory method was used for this tax year, enter amount of closing inventory computed\nunder LIFO..·······。。········\n9d\ne If property is produced or acquired for resale, do the rules of section 263A apply to the entity? See instructions..\n□\nYes\n区No\nfWas there any change in determining quantities, cost, or valuations between opening and closing inventory? If \"Yes,\"\nattach explanation .....\n···········\n□\nYes\n区No\nSection references are to the Internal\nmerchandise is an income-producing\nSmall business taxpayer. A small\nRevenue Code unless otherwise noted.\nfactor. See Regulations section 1.471-1.If\nbusiness taxpayer is a taxpayer that (a) has\ninventories are required, you generally\naverage annual gross receipts of $25\nWhat's New\nmust use an accrual method of accounting\nmillion or less(indexed for inflation)for the\nSmall business taxpayers. For tax years\nfor sales and purchases of inventory items.\n3 prior tax years, and (b) is not a tax shelter\nbeginning after December 31， 2017， the\nException for certain taxpayers. A small\n(as defined in section 448(d)(3). See Pub.\nfollowing apply.\nbusiness taxpayer(defined below), can\n538.\n.A small business taxpayer(defined\nadopt or change its accounting method to\nUniform capitalization rules. The uniform\nbelow), may use a method of accounting for\naccount for inventories in the same manner\ncapitalization rules of section 263A\ninventories that either: (1) treats inventories\nas material and supplies that are non-\ngenerally require you to capitalize, or\nas nonincidental materials and supplies, or\nincidental, or conform to its treatment of\ninclude in inventory, certain costs incurred\n(2)conforms to the taxpayer's financial\ninventories in an applicable financial\nin connection with the following.\naccounting treatment of inventories.\nstatement (as defined in section 451(b)(3).\n.The production of real property and\n.A smal business taxpayer is not required\nor if it does not have an applicable financial\ntangible personal property held in inventory\nto capitalize costs under section 263A.\nstatement, the method of accounting used\nor held for sale in the ordinary course of\nin its books and records prepared in\nbusiness.\nGeneral Instructions\naccordance with its accounting\n.Real property or personal property\nprocedures. See section 471(c)(3).\nPurpose of Form\n(tangible and intangible)acquired for resale.\nA small business taxpayer claiming\nUse Form 1125-A to calculate and deduct\n.The production of real property and\nexemption from the requirement to keep\ncost of goods sold for certain entities.\ninventories is changing its method of\ntangible personal property for use in its\naccounting for purposes of section 481.\ntrade or business or in an activity engaged\nWho Must File\nFor additional guidance on this method of\nin for profit.\nFilers of Form 1120， 1120-C,1120-F,\naccounting,see Pub.538,Accounting\nA smal business taxpayer(defined\n1120S, or 1065， must complete and attach\nPeriods and Methods. For guidance on\nabove)is not required to capitalize costs\nForm 1125-A if the applicable entity reports\nchanging to this method of accounting, see\nunder section 263A. See section 263A(i).\na deduction for cost of goods sold.\nForm 3115 and the Instructions for Form\nSee the discussion on section 263A\nInventories\n3115.\nuniform capitalization rules in the\ninstructions for your tax return before\nGenerally, inventories are required at the\ncompleting Form 1125-A. Also see\nbeginning and end of each tax year if the\nRegulations sections 1.263A-1 through\nproduction, purchase, or sale of\n1.263A-3. See Regulations section\n1.263A-4 for rules for property produced in\na farming business.\nFor Paperwork Reduction Act Notice, see instructions. BAA\nREV 05/09/24 PRO Form 1125-A(Rev.11-2018)\n\n--- Page 9 ---\nSCHEDULE G\nInformation on Certain Persons Owning the\n(Form 1120)\nCorporation's Voting Stock\nOMB No.1545-0123\n(Rev. December 2011)\nDepartment of the Treasury\nAttach to Form 1120.\nInternal Revenue Service\nSee instructions on page 2.\nName\nEmployer identification number(EIN)\nKINGS ELEVATOR PARTS INC\n88-1927324\nPart I\nCertain Entities Owning the Corporation's Voting Stock. (Form 1120， Schedule K, Question 4a). Complete\ncolumns (i)through(v) below for any foreign or domestic corporation, partnership (including any entity treated\nas a partnership), trust, or tax-exempt organization that owns directly 20% or more, or owns, directly or\nindirectly, 50% or more of the total voting power of all classes of the corporation's stock entitled to vote (see\ninstructions).\n(i)Name of Entity\n(ii)Employer Identification\nNumber(if any)\n(ii) Type of Entity\n(iv)Country of Organization\n(v) Percentage Owned in Voting Stock\nFUZHOU SHINESTONE TRAD\nForeign Corp\nCH\n51\nPart Il\nCertain Individuals and Estates Owning the Corporation's Voting Stock. (Form 1120， Schedule K,\nQuestion 4b). Complete columns (i) through (iv) below for any individual or estate that owns directly 20% or\nmore, or owns, directly or indirectly, 50% or more of the total voting power of all classes of the corporation's\nstock entitled to vote(see instructions).\n(i)Identifying Number\n()Country of\nCitizenship(see\n(iv)Percentage Owned\n(i)Name of Individual or Estate\n(if any)\ninstructions)\nin Voting Stock\nQING XIANG WANG\n059-80-6562\nUS\n49\nFor Paperwork Reduction Act Notice,\nREV 05/09/24 PRO\nSchedule G(Form 1120)(Rev.12-2011)\nsee the Instructions for Form 1120. BAA\n\n--- Page 10 ---\n2220\nUnderpayment of Estimated Tax by Corporations\nOMB No.1545-0123\nForm\nDepartment of the Treasury\nAttach to the corporation's tax return.\n20\n23\nInternal Revenue Service\nGo towww.irs.gov/Form2220 for instructions and the latest information.\nName\nEmployer identification number\nKINGS ELEVATOR PARTS INC\n88-1927324\nNote: Generally, the corporation is not required to file Form 2220 (see Part Il below for exceptions) because the IRS will figure any penalty\nowed and bill the corporation. However, the corporation may still use Form 2220 to figure the penalty. If so, enter the amount from page 2，\nline 38， on the estimated tax penalty line of the corporation's income tax return, but do not attach Form 2220.\nPart I\nRequired Annual Payment\n1 Total tax(see instructions).............\n·····\n1\n592.\n2a Personal holding company tax (Schedule PH(Form 1120)， line 26) included on line 1\n2a\nb Look-back interest included on line 1 under section 460(b)(2) for completed long-term\ncontracts or section 167(g) for depreciation under the income forecast method...\n2b\nc Credit for federal tax paid on fuels (see instructions). . .........\n2c\nd Total. Add lines 2a through 2c. .. ..............\n2d\n3 Subtract line 2d from line 1. If the result is less than $500， do not complete or file this form. The corporation\ndoes not owe the penalty\n3\n592.\n4 Enter the tax shown on the corporation's 2022 income tax return. See instructions. Caution: If the tax is zero or\nthe tax year was for less than 12 months, skip this line and enter the amount from line 3 on line 5....\n4\n4.\n5 Required annual payment. Enter the smaller of line 3 or line 4. If the corporation is required to skip line 4， enter\nthe amount from line 3\n5\n4.\nPart Il\nReasons for Filing-Check the boxes below that apply. If any boxes are checked, the corporation must file\nForm 2220 even if it does not owe a penalty. See instructions.\n6\nThe corporation is using the adjusted seasonal installment method.\n7\nThe corporation is using the annualized income installment method.\n8\nThe corporation is a “large corporation\"figuring its first required installment based on the prior year's tax.\nPart Ill\nFiguring the Underpayment\n(a)\n(b)\n(c)\n(d)\n9 Installment due dates. Enter in columns (a) through (d) the 15th day\nof the 4th (Form 990-PF filers: Use 5th month), 6th, 9th, and 12th\nmonths of the corporation's tax year.\n9\n07/15/23\n09/15/23\n12/15/23\n03/15/24\n10\nRequired installments. If the box on line 6 and/or line 7 above is\nchecked, enter the amounts from Schedule A, line 38. If the box on\nline 8(but not 6 or 7) is checked, see instructions for the amounts to\nenter. If none of these boxes are checked, enter 25%(0.25) of line 5\nabove in each column . . ...\n10\n1.\n1.\n1.\n1.\n11\nEstimated tax paid or credited for each period. For column (a) only,\nenter the amount from line 11 on line 15. See instructions\n、、·\n11\nComplete lines 12 through 18 of one column before going to the\nnext column.\n12\nEnter amount, if any, from line 18 of the preceding column....\n12\n13\nAdd lines 11 and 12 .............\n13\n14\nAdd amounts on lines 16 and 17 of the preceding column....\n14\n1.\n2.\n3.\n15\nSubtract line 14 from line 13. If zero or less, enter-0-.....\n15\n0.\n0.\n0.\n16\nIf the amount on line 15 is zero, subtract line 13 from line 14.\nOtherwise, enter-0-...............\n16\n1.\n2.\n17\nUnderpayment. If line 15 is less than or equal to line 10， subtract line\n15 from line 10. Then go to line 12 of the next column. Otherwise, go\nto line 18......··.·...··..\n17\n1.\n1.\n1.\n1.\n18\nOverpayment. If line 10 is less than line 15， subtract line 10 from line\n15. Then go to line 12 of the next column.........\n18\nGo to Part IV on page 2 to figure the penalty. Do not go to Part IV if there are no entries on line 17-no penalty is owed.\nFor Paperwork Reduction Act Notice, see separate instructions.\nREV 05/09/24 PRO\nForm 2220(2023)\nBAA\n\n--- Page 11 ---\nForm 2220(2023)\nPage 2\nPart IV Figuring the Penalty\n(a)\n(b)\n(c)\n(d)\n19 Enter the date of payment or the 15th day of the 4th month after the\nclose of the tax year, whichever is earlier. (C corporations with tax\nyears ending June 30 and S corporations: Use 3rd month instead of\n4th month. Form 990-PF and Form 990-T filers: Use 5th month\ninstead of 4th month.) See instructions.........\n19\n07/15/24\n07/15/24\n07/15/24\n07/15/24\n20\nNumber of days from due date of installment on line 9 to the date\nshown on line 19................\n20\n366\n304\n213\n122\n21\nNumber of days on line 20 after 4/15/2023 and before 7/1/2023\n21\nNumber of days on line 21\n22\nUnderpayment on line 17x\n365\n×7%(0.07)\n22\n$\n$\n$\n$\n23\nNumber of days on line 20 after 6/30/2023 and before 10/1/2023\n.\n23\n77\n15\nNumber of days on line 23\n24\nUnderpayment on line 17 x\n365\n×7%(0.07)\n24\n$\n0.\n$\n0.\n$\n$\n25\nNumber of days on line 20 after 9/30/2023 and before 1/1/2024\n25\n92\n92\n16\nNumber of days on line 25\n26\nUnderpayment on line 17×\n365\n×8%(0.08)\n26\n$\n0.\n$\n0.\n$\n0.\n$\n27\nNumber of days on line 20 after 12/31/2023 and before 4/1/2024\n27\n91\n91\n91\n16\nNumber of days on line 27\n28\nUnderpayment on line 17×\n366\n×8%(0.08)\n28\n$\n$\n0.|$\n0.\n$\n0.\n$\n0.\n29\nNumber of days on line 20 after 3/31/2024 and before 7/1/2024\n29\n91\n91\n91\n91\nNumber of days on line 29\n30\nUnderpayment on line 17×\n366\nx*%\n30\n$\n0.\n$\n0.\n$\n0.\n$\n0.\n31\nNumber of days on line 20 after 6/30/2024 and before 10/1/2024\n31\n15\n15\n15\n15\nNumber of days on line 31\n32\nUnderpayment on line 17x\n366\n×*%\n32\n$\n0.\n$\n0.\n$\n0.\n$\n0.\n33\nNumber of days on line 20 after 9/30/2024 and before 1/1/2025\n33\nNumber of days on line 33\n34\nUnderpayment on line 17x\n366\n×*%\n34\n$\n$\n$\n$\n35\nNumber of days on line 20 after 12/31/2024 and before 3/16/2025\n35\nNumber of days on line 35\n36\nUnderpayment on line 17×\n365\nx*%\n36\n$\n$\n$\n$\n37\nAdd lines 22， 24， 26,28， 30， 32， 34， and 36........\n37\n$\n0.\n$\n0.$\n0.\n$\n0.\n38\nPenalty. Add columns (a) through (d) of line 37. Enter the total here and on Form 1120， line 34； or the comparable line\nfor other income tax returns...........··........·....\n38\n$\n0.\n\"Use the penalty interest rate for each calendar quarter, which the IRS will determine during the first month in the preceding quarter.\nThese rates are published quarterly in an IRS News Release and in a revenue ruling in the Intermal Revenue Bulletin. To obtain this\ninformation on the Internet, access the IRS website at www.irs.gov. You can also call 800-829-4933 to get interest rate information.\nForm 2220(2023)\nREV 05/09/24 PRO\n\n--- Page 12 ---\nForm 2220(2023)\nPage 3\nSchedule A Adjusted Seasonal Installment Method and Annualized Income Installment Method\nSee instructions.\nForm 1120-S filers: For lines 1， 2， 3， and 21， “taxable income\" refers to excess net passive income or the amount on which tax is\nimposed under section 1374(a), whichever applies.\nPart I\nAdjusted Seasonal Installment Method\nCaution: Use this method only if the base period percentage for any 6 consecutive months is at least 70%.\nSee instructions.\n(a)\n(b)\n(c)\n(d)\n1 Enter taxable income for the following periods.\nFirst 3 months\nFirst 5 months\nFirst 8 months\nFirst 11 months\na Tax year beginning in 2020.........\n1a\nb Tax year beginning in 2021.........\n1b\nc Tax year beginning in 2022....\n1c\n2\nEnter taxable income for each period for the tax year beginning in\n2023. See the instructions for the treatment of extraordinary items\n2\n3\nEnter taxable income for the following periods.\nFirst4months\nFirst 6 months\nFirst 9 months\nEntire year\na Tax year beginning in 2020......\n3a\nb Tax year beginning in 2021. .........\n3b\nc Tax year beginning in 2022........\n3c\n4\nDivide the amount in each column on line 1a by the amount in\ncolumn(d) on line 3a ....\n4\n5\nDivide the amount in each column on line 1b by the amount in\ncolumn(d) on line 3b ....\n5\n6 Divide the amount in each column on line 1c by the amount in\ncolumn(d) on line 3c....\n6\n7\n7 Add lines 4 through 6.....\n8 Divide line 7 by 3.0...\n8\n9a Divide line 2 by line 8.....\n9a\nb Extraordinary items (see instructions)\n9h\nc Add lines 9a and 9b......\nc\n9c\n10\nFigure the tax on the amount on line 9c using the instructions\nfor Form 1120， Schedule J, line 1， or comparable line of\ncorporation's return.....\n10\n11a Divide the amount in columns (a) through(c) on line 3a by the\namount in column (d) on line 3a..\n11a\nb Divide the amount in columns (a) through (c) on line 3b by the\namount in column (d) on line 3b....\n11b\nc Divide the amount in columns (a) through (c) on line 3c by the\namount in column (d) on line 3c...\n11c\n12\nAdd lines 11a through 11c. .....\n12\n13\nDivide line 12 by 3.0.....\n13\n14\nMultiply the amount in columns (a) through(c) of line 10 by\ncolumns (a) through (c) of line 13. In column(d), enter the\namount from line 10， column(d)..........\n14\n15\nEnter any alternative minimum tax (trusts only) for each payment\nperiod. See instructions......\n15\n16\nEnter any other taxes for each payment period. See instructions\n16\n17\nAdd lines 14 through 16.........\n17\n18\nFor each period, enter the same type of credits as allowed on\nForm 2220， lines 1 and 2c. See instructions......\n18\n19\nTotal tax after credits. Subtract line 18 from line 17. If zero or\nless, enter-0-. . . . . . . ..... ....\n19\nREV05/09/24PRO\nForm 2220(2023)\n\n--- Page 13 ---\nForm 2220(2023)\nPage4\nPart Il\nAnnualized Income Installment Method\n(a)\n(b)\n(c)\n(d)\nFirst\nFirst\nFirst\nFirst\n20\nAnnualization periods (see instructions)........\n20\nmonths\nmonths\nmonths\nmonths\n21\nEnter taxable income for each annualization period. See\ninstructions for the treatment of extraordinary items....\n21\n22\nAnnualization amounts(see instructions).......\n22\n23a\nAnnualized taxable income. Multiply line 21 by line 22...\n23a\nb Extraordinary items (see instructions) . . . . ....\n23b\nc Add lines 23a and 23b.. ...........\n23c\n24\nFigure the tax on the amount on line 23c using the instructions\nfor Form 1120， Schedule J, line 1， or comparable line of\ncorporation's return. ... . .. .. . ....\n24\n25\nEnter any alternative minimum tax (trusts only) for each payment\nperiod. See instructions . . .. .. ......\n25\n26\nEnter any other taxes for each payment period. See instructions\n26\n27\nTotal tax. Add lines 24 through 26.........\n27\n28\nFor each period, enter the same type of credits as allowed on\nForm 2220， lines 1 and 2c. See instructions\n28\n29\nTotal tax after credits. Subtract line 28 from line 27. If zero or\nless, enter-0-.·······\n29\n30\nApplicable percentage ....\n30\n25%\n50%\n75%\n100%\n31\nMultiply line 29 by line 30 ............\n31\nPart Ill Required Installments\nNote: Complete lines 32 through 38 of one column before\n1st\n2nd\n3rd\n4th\ncompleting the next column.\ninstallment\ninstallment\ninstallment\ninstallment\n32\nIf only Part I or Part ll is completed, enter the amount in each\ncolumn from line 19 or line 31. If both parts are completed, enter\nthe smaller of the amounts in each column from line 19 or line\n31············\n32\n33\nAdd the amounts in all preceding columns of line 38. See\n33\n34\nAdjusted seasonal or annualized income installments.\nSubtract line 33 from line 32. If zero or less, enter-0-\n34\n35\nEnter 25%(0.25) of line 5 on page 1 of Form 2220 in each\ncolumn. Note: \"Large corporations,\" see the instructions for\nline 10 for the amounts to enter....\n35\n36\nSubtract line 38 of the preceding column from line 37 of the\npreceding column .......···，\n36\n37\nAdd lines 35 and 36......\n37\n38\nRequired installments. Enter the smaller of line 34 or line 37\nhere and on page 1 of Form 2220， line 10. See instructions.\n38\nREV 05/09/24 PRO\nForm 2220(2023)\n\n--- Page 14 ---\nForm\n5472\nInformation Return of a 25% Foreign-Owned U.S. Corporation or a\nForeign Corporation Engaged in a U.S. Trade or Business\n(Rev.December 2023)\n(Under Sections 6038A and 6038C of the Internal Revenue Code)\nOMBNo.1545-0123\nGoto www.irs.gov/Form5472 for instructions and the latest information.\nDepartment of the Treasury\nFor tax year of the reporting corporation beginning Apr 1， 2023， and ending Mar 31,2024\nInternal Revenue Service\nNote: Enter al information in English and money items in U.S. dollars.\nPart I\nReporting Corporation (see instructions). All reporting corporations must complete Part I.\n1a Name of reporting corporation\n1b Employer identification number\nKINGS ELEVATOR PARTS INC\n88-1927324\nNumber, street, and room or suite no. (If a P.O. box, see instructions.)\n1c Total assets\n154-05 BARCLAY AVE\nCity or town, state, and ZIP code (If a foreign address, see instructions.)\nFLUSHING, NY 11355\n$\n670,867.\n1d Principal business activity ELEVATOR PARTS\n1e Principal business activity code 444180\n1f Total value of gross payments made or received\n1g Total number of Forms 5472\n1h Total value of gross payments made or received\nreported on this Form 5472. See instructions.\nfiled for the tax year\nreported on all Forms 5472. See instructions.\n$\n500,000.\n1\n$\n500,000.\n1i Check here if this is a\n1j Check here if this is the initial year for\n1k Total number of Parts VIIl\n1I Country of incorporation\nconsolidated filing of\nwhich the U.S.reporting corporation\nattached to Form 5472\nForm 5472..□\nis filing a Form 5472....\n1\nUS\n1m Date of incorporation\n1n Country(ies)under whose laws the reporting\n1o Principal country(ies) where business is conducted\ncorporation files an income tax return as a resident\n04/22/2022\nUS US\nUS\n2 Check here if, at any time during the tax year, any foreign person owned, directly or indirectly, at least 50% of (a) the total voting power of all\nclasses of the stock of the reporting corporation entitled to vote, or (b) the total value of all classes of stock of the reporting corporation.\n3 Check here if the reporting corporation is a foreign-owned domestic disregarded entity (foreign-owned U.S. DE) treated as a corporation for\npurposes of section 6038A. See instructionsL\nPart Il\n25% Foreign Shareholder (see instructions)\nCheck here if any direct (or ultimate indirect)25% foreign shareholder listed in Part ll is a surrogate foreign\ncorporation under section 7874(a)(2)(B).□\n4a Name and address of direct 25% foreign shareholder\nFUZHOU SHINESTONE TRADE CO.,LTD 22F/2223,\n4b(1)U.S. identifying number, if any\n4b(2) Reference ID number(see instructions)\n4b(3) Foreign taxpayer identification number(FTIN), if any\n(see instructions)\nFOREIGNUS\nFOREIGNUS\n4c Principal country(ies)where\n4d Country of citizenship,\n4e Country(ies) under whose laws the direct 25% foreign\nbusiness is conducted\norganization, or incorporation\nshareholder files an income tax return as a resident\nCH\nCH\nCH CH\n5a Name and address of direct 25% foreign shareholder\n5b(1)U.S. identifying number, if any\n5b(2) Reference ID number(see instructions)\n5b(3)FTIN, if any(see instructions)\n5c Principal country(ies)where\n5d Country of citizenship,\n5e Country(ies) under whose laws the direct 25% foreign\nbusiness is conducted\norganization, or incorporation\nshareholder files an income tax return as a resident\n6a Name and address of ultimate indirect 25% foreign shareholder\n6b(1)U.S. identifying number, if any\n6b(2)Reference ID number(see instructions)\n6b(3)FTIN, if any(see instructions)\n6c Principal country(ies)where\n6d Country of citizenship,\n6e Country(ies) under whose laws the ultimate indirect 25% foreign\nbusiness is conducted\norganization, or incorporation\nshareholder files an income tax return as a resident\n7a Name and address of ultimate indirect 25% foreign shareholder\n7b(1)U.S. identifying number, if any\n7b(2) Reference ID number (see instructions)\n7b(3)FTIN,if any(see instructions)\n7c Principal country(ies)where\n7d Country of citizenship,\n7e Country(ies) under whose laws the ultimate indirect 25% foreign\nbusiness is conducted\norganization, or incorporation\nshareholder files an income tax return as a resident\nFor Paperwork Reduction Act Notice, see instructions. BAA\nCat.No.49987Y\nREV05/09/24 PRO\nForm 5472(Rev.12-2023)\n\n--- Page 15 ---\nForm 5472(Rev.12-2023)\nPage 2\nPart Ill\nRelated Party (see instructions). All reporting corporations must complete this question and the rest of Part Ill.\nCheck applicable box: Is the related party a foreign person or □U.S. person?\n8a Name and address of related party\nFUZHOU SHINESTONE TRADE CO. 22F/2223, R&F CENTER BUIL TAIJIANG DISTRICT FUZHOU FUJIAN,\n8b(1)U.S. identifying number, if any\n8b(2)Reference ID number(see instructions)\n8b(3)FTIN, if any (see instructions)\nFOREIGNUS\nFOREIGNUS\n8c Principal business activity WHOLESALES TRADING\n8d Principal business activity code 444180\n8e Relationship-Check boxes that apply:□ Related to reporting corporation □Related to 25% foreign shareholder 25% foreign shareholder\n8f Principal country(ies)where business is conducted\n8g Country(ies) under whose laws the related party files an income tax return as a\nresident\nCH\nCH\nPart IV\nMonetary Transactions Between Reporting Corporations and Foreign Related Party (see instructions)\nCaution: Part IV must be completed if the \"foreign person\" box is checked in the heading for Part Ill.\nIf estimates are used, check here.\n9 Sales of stock in trade (inventory).....................\n9\n9\n10\nSales of tangible property other than stock in trade.. ................\n10\n11\nPlatform contribution transaction payments received. ...............\n11\n12\nCost sharing transaction payments received.....................\n12\n13a\nRents received (for other than intangible property rights)..\n13a\nb\nRoyalties received (for other than intangible property rights)..\n13b\n14\nSales, leases, licenses, etc., of intangible property rights (for example, patents, trademarks, secret formulas)..\n14\n15\nConsideration received for technical, managerial, engineering, construction, scientific, or like services...\n15\n16\nCommissions received .. ...\n·*····\n16\n17\nAmounts borrowed(see instructions)a Beginning balance\nb Ending balance or monthly average\n17b\n18\nInterest received ......\n18\n19\nPremiums received for insurance or reinsurance.\n19\n20\nLoan guarantee fees received. ..\n20\n21\nOther amounts received (see instructions)..\n21\n500,000.\n22\nTotal. Combine amounts on lines 9 through 21...\n22\n500,000.\n23\nPurchases of stock in trade (inventory).\n23\n209,722.\n24\nPurchases of tangible property other than stock in trade\n24\n25\nPlatform contribution transaction payments paid..\n25\n26\nCost sharing transaction payments paid\n26\n27a\nRents paid (for other than intangible property rights).\n27a\nb\nRoyalties paid(for other than intangible property rights).\n27b\n28\nPurchases, leases, licenses, etc., of intangible property rights (for example, patents, trademarks, secret formulas)\n28\n29\nConsideration paid for technical, managerial, engineering, construction, scientific, or like services.....\n29\n30\nCommissions paid ......\n················\n30\n31\nAmounts loaned (see instructions)a Beginning balance\nb Ending balance or monthly average\n31b\n32\nInterest paid .............\n32\n33\nPremiums paid for insurance or reinsurance.....................\n33\n34\nLoan guarantee fees paid . .........................\n34\n35\nOther amounts paid (see instructions)\n35\n6 Total. Combine amounts on lines 23 through 35.\n36\n36\n209,722.\nPart V\nReportable Transactions of a Reporting Corporation That Is a Foreign-Owned U.S. DE (see instructions)\nDescribe on an attached separate sheet any other transaction as defined by Regulations section 1.482-1(i)(7),\nsuch as amounts paid or received in connection with the formation, dissolution, acquisition, and disposition\nof the entity, including contributions to and distributions from the entity, and check here.□\nPart VI\nNonmonetary and Less-Than-Full Consideration Transactions Between the Reporting Corporation\nand the Foreign Related Party(see instructions)\nDescribe these transactions on an attached separate sheet and check here.□\nREV 05/09/24 PRO Form 5472(Rev. 12-2023)\n\n--- Page 16 ---\nForm 5472(Rev. 12-2023)\nPage\nPart VIl Additional Information. All reporting corporations must complete Part Vl.\n37 Does the reporting corporation import goods from a foreign related party?..\n区Yes\n□No\n38a If \"Yes,\" is the basis or inventory cost of the goods valued at greater than the customs value of the imported goods?.\n□ Yes\n区No\nb If \"Yes,\"attach a statement explaining the reason or reasons for such difference.\nc If the answers to questions 37 and 38a are \"Yes,\" were the documents used to support this treatment of the imported\ngoods in existence and available in the United States at the time of filing Form 5472？..........\n□ Yes\n□No\n39 During the tax year, was the foreign parent corporation a participant in any cost sharing arrangement (CSA)?....\n□ Yes\n区No\nIf \"Yes,\"complete Part VIll as instructed below.\n40a During the tax year, did the reporting corporation pay or accrue any interest or royalty for which the deduction is not\nallowed under section 267A? See instructions..\n□ Yes\n区No\nb If “Yes,\"enter the total amount of the disallowed deductions..\n....$\n41a Is the reporting corporation claiming a foreign-derived intangible income (FDll) deduction (under section 250) with respect\nto any transactions with the foreign related party? If \"Yes,\" complete lines 41b, 41c, and 41d. See instructions...\n□ Yes\n No\nbEnter the amount of gross receipts derived from all sales of general property to the foreign related party that the reporting\ncorporation included in its computation of foreign-derived deduction eligible income(FDDEI). See instructions. .. $\nc Enter the amount of gross receipts derived from all sales of intangible property to the foreign related party that the\nreporting corporation included in its computation of FDDEl. See instructions...\n..$\nd Enter the amount of gross receipts derived from all services provided to the foreign related party that the reporting\ncorporation included in its computation of FDDEl. See instructions...\n..$\n42a Did the reporting corporation have any loan to or from the related party to which the safe-haven rate rules of Regulations\nsection 1.482-2(a)(2)i)(B) are applicable, and for which the reporting corporation used a rate of interest within the relevant\nsafe-haven range(100% to 130% of the applicable Federal rate (AFR) for the relevant term)?....\n□\nYes\n区No\nb Did the reporting corporation have any loan to or from the related party to which the safe-haven rate rules of Regulations\nsection 1.482-2(a)(2)(i)(B) are applicable, and for which the reporting corporation used a rate of interest outside the\nrelevant safe-haven range (100% to 130% of the AFR for the relevant term)?.\n□ Yes\n No\n43a Did the reporting corporation issue a covered debt instrument in any of the transactions desoribed in Regulations section\n1.385-3(b)(2) during the tax year with respect to a related party that is a c\ntion, or, did the reporting corporation issue\nor refinance indebtedness owed to a related party that is a corporation\naunng\n36 months before or after the date of a\ndistribution or acquisition described in Regulations section 1.385-3(b)(3\nby the reporting corporation, and either\nthe issuance or refinance of indebtedness, or the distribution or acquisition, occurred during the tax year?.....\n□Yes\n区 No\nIf the answer to question 43a is \"Yes,\"provide the following\n(1)The amount of such transaction(s), distribution(s), and acquis\nonis\n(2)The amount of such related party indebtedness\nPart VIll Cost Sharing Arrangement (CSA)\nNote: Complete a separate Part VIl for each CSA in which the reporting corporation was a participant during the tax year. Report all amounts in U.S.\ndollars. (See instructions.)\n44 Provide a brief description of the CSA with respect to which this Part Vil is being completed.\n45\nDuring the course of the tax year, did the reporting corporation become a participant in the CSA?\nYes\n□\nNo\n46\nWas the CSA in effect before January 5， 2009？\n□ Yes\n□No\n47 What was the reporting corporation's share of reasonably anticipated benefits for the CSA?..\n号\n48a\nEnter the total amount of stock-based compensation deductions claimed by the reporting corporation.....$\nb Enter the total amount of deductions for the tax year for stock-based compensation that was granted during the term of the CSA\nand is directly identified with, or reasonably allocable to, the intangible development activity under the CSA.....\n$\nc\nWas there any stock-based compensation granted during the term of the CSA to individuals who performed functions in\nbusiness activities that generate cost shared intangibles that was not treated as directly identified with, or reasonably\nallocable to, the intangible development activity?. ..\n□ Yes\n□No\n49a\nEnter the total amount of intangible development costs for the CSA.\n6\nEnter the amount of intangible development costs allocable to the reporting corporation based on the reporting corporation's\nreasonably anticipated benefits share\nPart IX\nBase Erosion Payments and Base Erosion Tax Benefits Under Section 59A(see instructions)\n50\nAmounts defined as base erosion payments under section 59A(d).\n51\nAmount of base erosion tax benefits under section 59A(c)(2)..\n52\nAmount of total qualified derivative payments as described in section 59A(h) made by the reporting corporation..\n53\nReserved for future use.\nForm 5472(Rev. 12-2023)\nREV 05/09/24 PRO\n\n--- Page 17 ---\n4562\nDepreciation and Amortization\nOMB No. 1545-0172\nForm\n(Including Information on Listed Property)\n2023\nDepartment of the Treasury\nAttach to your tax return.\nAttachment\nInternal Revenue Service\nGotowww.irs.gov/Form4562 for instructions and the latest information.\nSequence No. 179\nName(s)shown on return\nBusiness or activity to which this form relates\nIdentifying number\nKINGS ELEVATOR PARTS INC\nForm 1120 ELEVATOR PARTS\n88-1927324\nPart I\nElection To Expense Certain Property Under Section 179\nNote: If you have any listed property, complete Part V before you complete Part I.\n1 Maximum amount (see instructions). .. ....................\n1\n1,160,000.\n2 Total cost of section 179 property placed in service (see instructions). ..........\n2\n3 Threshold cost of section 179 property before reduction in limitation (see instructions)......\n3\n2,890,000.\n4 Reduction in limitation. Subtract line 3 from line 2. If zero or less, enter-0- ..........\n4\n5 Dollar limitation for tax year. Subtract line 4 from line 1. If zero or less, enter -0-. If married filing\nseparately, see instructions . ....... .. ...............\n5\n6\n(a)Description of property\n(b)Cost(business use only)\n(c)Elected cost\n7 Listed property. Enter the amount from line 29..... ....\n7\n8 Total elected cost of section 179 property. Add amounts in column (c), lines 6 and 7......\n8\n9 Tentative deduction. Enter the smaller of line 5 or line 8. .....\n9\n10 Carryover of disallowed deduction from line 13 of your 2022 Form 4562.......\n10\n11 Business income limitation. Enter the smaller of business income (not less than zero) or line 5. See instructions\n11\n12 Section 179 expense deduction. Add lines 9 and 10， but don't enter more than line 11\n·····\n12\n13 Carryover of disallowed deduction to 2024. Add lines 9 and 10， less line 12\n13\nNote: Don't use Part Il or Part Ill below for listed property. Instead, use Part V.\nPart  Special Depreciation Allowance and Other Depreciation (Don't include listed property. See instructions.)\n14 Special depreciation allowance for qualified property (other than listed property) placed in service\nduring the tax year. See instructions.\n··········\n14\n15 Property subject to section 168(f)(1) election\n···········\n15\n16 Other depreciation (including ACRS)\n16\nPart Ill MACRS Depreciation (Don't include listed property. See instructions.)\nSection A\n17 MACRS deductions for assets placed in service in tax years beginning before 2023.......\n17\n18 If you are electing to group any assets placed in service during the tax year into one or more general\nasset accounts, check here . ..\n··········\n□\nSection B-Assets Placed in Service During 2023 Tax Year Using the General Depreciation System\n(b)Month and year\n(c)Basis for depreciation\n(a)Classification of property\nplaced in\n(business/investment use\nd)Recovery\nperiod\n(e)Convention\n(1Method\n(g)Depreciation deduction\nservice\nonly-see instructions)\n19a 3-year property\nb 5-year property\n94,406\n5.0 yrs\nMQ\n200DB\n4,720.\nc 7-year property\nd 10-year property\ne 15-year property\nf 20-year property\ng 25-year property\n25 yrs.\nS/L\nh Residential rental\n27.5 yrs.\nMM\nS/L\nproperty\n27.5 yrs.\nMM\nS/L\ni Nonresidential real\n39 yrs.\nMM\nS/L\nproperty\nMM\nS/L\nSection C-Assets Placed in Service During 2023 Tax Year Using the Alternative Depreciation System\n20a Class life\nS/L\nb 12-year\n12yrs.\nS/L\nc 30-year\n30 yrs.\nMM\nS/L\nd 40-year\n40 yrs.\nMM\nS/L\nPart IV\nSummary(See instructions.)\n21 Listed property. Enter amount from line 28............\n21\n22 Total. Add amounts from line 12， lines 14 through 17， lines 19 and 20 in column (g), and line 21. Enter\nhere and on the appropriate lines of your return. Partnerships and S corporations-see instructions.\n22\n4,720.\n23 For assets shown above and placed in service during the current year, enter the\nportion of the basis attributable to section 263A costs. . . . . . ...\n23\nFor Paperwork Reduction Act Notice, see separate instructions.\nForm 4562(2023)\n\n--- Page 18 ---\nForm 1120\nOther Assets\n2023\nSchedule L\nName as Shown on Return\nEmployer Identification No.\nKINGS ELEVATOR PARTS INC\n88-1927324\nBeginning of\nEnd of\nOther Current Assets:\ntax year\ntax year\nTotals to Form 1120， Schedule L, line 6.\nBeginning of\nEnd of\nOther Investments:\nCOP\ntax year\ntax year\nTotals to Form 1120， Schedule L, line 9...............\nBeginning of\nEnd of\nOther Assets:\ntax year\ntax year\nRENT DEPOSIT\n23,100.\nTotals to Form 1120， Schedule L, line 14..............\n23,100.\n\n--- Page 19 ---\nForm 1120\nOther Liabilities\n2023\nSchedule L\nand Adjustments to Shareholders'Equity\nName\nEmployer Identification No.\nKINGS ELEVATOR PARTS INC\n88-1927324\nBeginning of\nEnd of\nOther Current Liabilities:\ntax year\ntax year\nCORP. TAX PAYABLE\n62.\n1,742.\nCUSTOMER DEPOSIT\n110,000.\nPAYROLL PAYABLE\n6,446.\nPAYROLL TAX PAYABLE\n3,720.\nRENT PAYABLE\n15,400.\nTotals to Form 1120， Schedule L, line 18..............\n62.\n137,308.\nBeginning of\nEnd of\nOther Liabilities:\ntax year\ntax year\nTotals to Form 1120， Schedule L, line 21\nBeginning of\nEnd of\nRetained Earnings-Appropriated:\ntax year\ntax year\nTotals to Form 1120， Schedule L, line 24..............\nBeginning of\nEnd of\nAdjustments to Shareholders'Equity:\ntax year\ntax year\nTotals to Form 1120， Schedule L, line 26..............\n\n--- Page 20 ---\nKINGS ELEVATOR PARTS INC\n88-1927324\n1\nAdditional Information From 2023 Federal Corporation Tax Return\nForm 1120： US Corporation Income Tax Return\nOther Deductions\nContinuation Statement\nDescription\nAmount\nBANK CHARGES\n811\nDELIVERY AND FREIGHT\n70,013\nINSURANCE\n3,364\nOFFICE EXPENSE\n231\nSUPPLIES\n73\nTELEPHONE\n459\nUTILITIES\n1,910\nTotal\n76,861\nForm 1120： US Corporation Income Tax Return-Smart Worksheet\nLine 17A\nItemization Statement\nDescription\nAmount\nNYS CORP. TAX\n650.\nNYC CORP. TAX\n500.\nTotal\n1,150.\nForm 5472： Information Return of 25% Foreign-Owned U.S. Corp\nPart IV, line 21\nItemization Statement\nDescription\nAmount\nAdditional Paid-in Capital\n500,000.\nTotal\n500,000.","ocr_status":"completed","exhibit_number":"A-3","exhibit_title":"Exhibit A3_pdf","created_at":"2025-11-27T19:33:57.190541"},{"id":"caef7400-168b-4163-b254-51120458a886","project_id":"project-1764271674391","file_name":"Exhibit A4.pdf","file_type":"application/pdf","file_size":44175790,"page_count":20,"ocr_text":"--- Page 1 ---\nExhibit A-4\n\n--- Page 2 ---\n2/94-A\nSTANDARD FORM OF COMMERCIAL LEASE\nThe Real Estate Board of New York, Inc.\nAgreement of Lease,Made as of this 26<day of Jamuary 2024,between\nT.C. Barclay LLC\nat\nparty of the first part, hereinafter referred to as OWNER, and\nKings Elevator Parts Inc.\nEIN:88-1927324\nat\nparty of the second part, hereinafter referred to as TENANT,\nWitnesseth: Owner hereby leases to Tenant and Tenant hereby hires from Owner\nin the building known as 154-01 Barclay Avenue, Flushing, NY 11355\nin the Borough of QUEENS, City of NEW YORK, for the term listed below (or until such term shall sooner cease and expire as\nhereinafter provided) to commence on the\n1\" day of January, 2024， and to end on the\n31\" day of May,2026\nboth dates inclusive, at an annual rental rate of $92,400.00 ($7,700.00 per month) with 3.0% increase beginning from Year 2.\nSee Rider Attached\nwhich Tenant agrees to pay in lawful money of the United States which shall be legal tender in payment of all debts and dues,\npublic and private, at the time of payment, in equal monthly installments in advance on the first day of each month during said\nterm,at the office of Owmer or such other place as Owner may designate,without any set off or deduction whatsoever,except that\nTenant shall pay the first monthly installment(s) on the execution hereof(unless this lease be a renewal).\nIn the event that, at the commencement of the term of this lease, or thereafter, Tenant shall be in default in the payment of\nrent to Owner pursuant to the terms of another lease with Owner or with Owner's predecessor in interest, Owner may at\nand the same shall be payable to Owner as additional rent.\nThe parties hereto, for themselves, their heirs, distributees executors, administrators, legal representatives,\nsuccessors and assigns, hereby covenant as follows:\nRent: 1. Tenant shall pay the rent as above and as hereinafter provided.\nOccupancy: 2. Tenant shal use and occupy demised premises for warehouse\nand for no other purpose. Tenant shall at all times conduct its business in a high grade and reputable manner, shall not violate Article 37 hereof, and shall keep\nshow windows and signs in a neat and clean condition.\nAlterations:\n3. Tenant shall make no changes in or to the demised\npremises of any nature without Owner's prior writen\nShall,throughout the term of this lease,take good care of the denised\nconsent Subject to the prior written consent of Owner,and to the\npremises and the fixtares and appurtenances therein,and the sidewalks\nprovisions of this article, Tenant, at Tenant's expense, may make alter-\nprovisions of this article, Tenant, at Tenant's expense, may make alter-\nadjacent thereto,and al its sole cost and expense,make all non-structural\nations, installation, additions or improvements which are non-structural and\nrepairs thereto as and when needed to preserve them in good working order\nelements, fire or other casualty, excepted. If the demised premises be or\nthe interior of the demised premises by using contractors or mechanics first\napproved in each instance by.Owner.Tenant shall,before making any\nbecome infested with vermin, Tenant shal at Tenant's expense, cause the\nsame to be exterminated from time to the satisfaction of Owner. Except as\nquasi-govemmental bodies and (upon completion) certificates of final\nallowance to the Tenant for the diminution of rental value and no liability on\napprovals and certificates to Owner and Tenant agrees to carry and will\nbusiness arising from Owner,Temant or others making or failing to makse any\ncause Tenant's contractors and sub-contractors to carry such workman's\ncomensation eneral liab conctors to cary such workman's\nbuilding including the erection or ents in or to any porion of the\ncompensation, general liability, personal and property damage insurance as\nOwner may require. If any mechanic's lien is filed against the demised\nshed, or in or to the demised premises or the fixtures, appurtenances or\nequipment thereof.It is specifically greed that Tenant shall be not entiuled\nto bave done for,or materials fumished to Tenant whether or wt cona\nto have done for, or materials furmished to, Tenant, whether or not done\ngrees thet Tenant's sole remedy lawe in such instance will be by waey oran\npursuant to this article, the same shall be discharged by Tenant within 30\nction fu ns sole remedy at law in such instance wil be by way of an\ndays thereafter, at Tenant's expense, by payment of filing the bond required\naction for damages for breach of contract. The provisions of this Article 4\nwith respect to the making of repairs shall not apply in the case of fire or\nby law.All fixtures and all paneling,peartitions,railings ad like\ninstallations,installed in the premises at any time,either by Tenant or by\nother Casualty which are dealt with in Article 9 hereof.\nWindow\nOwner and shall remain upon and be surrendered with the demised premises\n5. Tenant will not clean nor require, permit, suffer or\nCleaning:\nallow any window in the demised premises to be\nunles Owner, by notice to Tenant no later than twenty days prior to the date\nCleaned from the outside in violation of Section 202\nfixed as the termination of this lease,elects to relinquish Owmer's rights\nof the New York State Labor Law or any other applicable law or of the Rules\nthereto and to have them removed by Tenant, in which event, the same shall\nbe removed from the premises by Tenant prior to the expiration of this\nof the Board of Standards and Appeals, or of any other Board or body having\nor asserting jurisdiction.\nOwner title to or to prevent Tenant's removal of trade fixtures, moveable\nRequirements\noffice furniture and equipment, but upon removal of any such from the\n6. Prior to the commencement of the lease term,\nOf Lsw., Fire\nif Tenant is then in possession, and at all times\nInsurance:\nthereafter, Tenant, at Tenant's sole cost and ex-\npremises to the condition existing prior to installation and repair any\npesnse,shall promptly comply with all present and\ndamage to the demised premises or the building due to such removal. All\nfederal, municipal and local governments, departments, commissions and\nproperty permitted or required to be removed by Tenant at the end of the\nabandoned and may, at the election of Owner, either be retained as Owner's\nrules and regulations of the New York Board of Pire Underwriters or the\nInsurance Services Office, or any similar body which shall impose any\nproperty or may be removed from the premises by Owner at Tenant's\nviolation,order or duty upon Owner or Tenant with respect to the deraised\nexpense.\npremises, if the premises are on the street level, whether or not arising out\nRepairs:\n4. Owner shall maintain and repair the public\n r s se or manner or use of the premises or the building\nportions of the building, both exterior and interior,\n29 hereof, nothing herein shal require Tenant to make structural renairs or\nexcept that if Owner allows Tenant to erect on the outside of the building a\nalterations unles Tenant has by its manner of use of the demised premises or\nmethod of operation therein., violated any such laws, ordinances, orders,\nrules, regulations or requirements with respect thereto. Tenant shall not do\nand shall cause the same to be operated in a good and workmanlike manner\nor perit any act or thing to be dome in or to the demised premiges which is\nand shall make all repairs thereto necessary to keep same in good order and\ncontrary to law, or which will invalidate or be in conflict with public\ncondition, at Tenant's own cost and expense, and shall cause the same to be\ncovered by the insurance provided for hereafter in Article 8. Tenant\nliability, fire or other policies of insurance at any time carried by or for the\nbenefit of Owner. Tenant shall pay all costs, expenses, fines, penalties or\ndamages,\nT.c\n\n--- Page 3 ---\nwhich may be imposed upon Owner by reason of Tenant's failure to comply\nwith the provisions of this article. If the fire insurance rate shall, at the\nlook first to any insurance in its favor before making any claim against the\nbeginning of the lease or at any time thereafter,be higher than it otherwise\nother party for recovery for lass or damage resulting from fire or other\ncasualty,and to the extent that such insuranee is in force and collectible and\nwould be, then Tenant shal reimburse Owner, as additional rent hereunder,\nshall have been cherged because of such filure by Tenant,to comply with the\nwaiver all right of recovery with respect to subparagraphs(b),(d) and (e)\nterms of this article. In any action or proceeding wherein Owner and Tenant\nabove,mgainst the other or y one claiming through or under each of them\npremises issued by a body making fire insurance rates applicable to said\nto shall be deemed to include any loss or damage to the demised premises\npremises shall be conclusive evidence of the facts therein stated and of the\nandlor to ay personal property,equipment,trade fixtures,goods and\nseveral items and charges in the fire insurance rate then applicable to said\nmerchandise located therein. The foregoing release and waiver shal be in\npremises.\nthat such a release or waiver shall not invalidate the insurance reant\nSub-\n7. This lease is subjected and subordinate to all ground\necknowledges that Oamer will not carry insurance on Tenant's fumiture\nordination:\nor underlying leases and to all mortgages which may\nand/or furnishings or any fixtures or equipment, improvements, or appurte-\nnow or hereafter affect such leases or the real property\nrepair any damage thereto or replace the same.(f)Tenant hereby waives the\nconsolidations,replacements and extensions of any such undertving leases\nprovisions of Section 227 of the Real property Law and agrees that the\nconsolidations, replacements and extensions of any such underlying leases\nprovisions of this article shall govern and control in lieu thereof.\nand mortgages. This clause shall be self-operative and no further instrument\nof subordination shall be required by any ground or underlying lessor or by\nEminent\nany mortgagee, affecting any lease or the real property of which the demised\n10. If the whole or any part of the demised premises\nDomain:\npremises are a part. In confirmation of such subordination, Tenant shall from\nshal be acquired or condemned by Eminent Domain\ntime to time execute promptly any certificate that Owner may request.\nfor any public or quasi public use or purpose, then\nand in that event,the term of thas lease shall cease and terminate from the\nTenant's\n8.Oamer or its agents shall not be liable for any\ndate of title vesting in such proceeding and Tenant shall have no claim for\nLiabillty\ndamage to property of Tenant or of others entrusted\nthe value of any unexpired term of said lease.Tenant shall have the right to\nInsurance\nto employees of the building, nor for loss of or\nmake an independent claim to the condemning authority for the value of\nProperty Loss,\ndamage to any property of Tenant by thef or other-\nTenant's moving expenses and personal property,tde fixtaures and\nDamage,\nequipment, provided Tenant is entitled pursuant to the terms of the lease to\nwise, nor for any injury or damage to persons or\nremove such property, trade fixtures and equipment at the end of the term\nIndemnity:\nproperty resulting from any cause of whatsoever\nand provided further such claim does not reduce Owner's award\nnature,unless caused by or dure to the negligence of\nOwner, its agents, servants or employees. Owner or its agents will not be\nAssignment,\nliable for any such damage caused by other tenants or persons in, upon or\n11. Tenant, for itself, its heirs, distributes,\nabout said building or caused by operations in construction of any private,\npublie or quasi publie work.Tenant agrees,at Tenant's sole cast and\nexpense, to maintain general public liability insurance in standard form in\nshal not assign, morigage or encumber this agree-\nment, nor underlet, or suffer or permit the demised premises or any part\nfavor of Owner and Tenant against claims for bodily injury or death or\nthereof to be used by others, without the prior wrnnof\nproperty damage oeourring in or upon the demised premises,effective from\neach instance. Transfer of the majority of the stock of a corporate tenant or\ninsurance shall be in an amount and with carriers acceptable to the Owner.\ninsurance shall be in an amount and with carriers acceptable to the Owner.\nthe majority partnership interest of a partnership tenant shal be deemed an\nSuch policy or policies shall be delivered to the Owner. On Tenant's default\ntssiae r this ease be assigned,or if the demised premises or any part\nthereof be underlet or occupied by anybody other than Tenant, Owner or\nin obtaining or delivering any such policy or policies or failure to pay the\noccupant, and apply the net amount collected to the rent herein reserved, but\ncheres theretor. Owner may secure or pay the charges for any such policy or\nno such asignment, underletting, occupancy or collection shal be deemed \npolicies and charge the Tenant as additional rent therefor. Tenant shall\nindemnify and save harmless Owner against and from all liabilities,\nwaiver of the covenant, or a release of Tenant from the further performance\nobligations, damages, penalties, claims, costs and expenses for which Owner\nby Tenant of covenants on the part of Tenant herein contained. The consent\nshall not be reimbursed by insurance,including reasonable attomeys fees,\nby Owner to an assignment or underleting shall not in any wise be construed\npaid, suffered or incurred as a res o g reasonable atoneys ees\nto relieve Tenant from obtaining the express consent in writing of Owner to\ncontractors, employees, invitees. o enbreach by TenantTenant's aget\nany further assignment or underleting.\nthis lease,or the carelessness,negligence or improper conduct of the Tenant,\nTenant's agents, contracoreeece or improper conduct of the Tenant\nElectric\n12. Rates and conditions in respect to\nliability under this lease extends to the acts and omisions of any subtenant.\nsubmetering\nCurrent:\nor rent inclusion, as the case may be, to be added in\nand any agent, contractor, employee, invitee or license of any subtenant. In\ncase any action or proceeding is brought against Ormer by reason of any such\nRIDER attached hereto. Tenant covenants and\nclaim, Tenant, upon writen notice from Owner, wil, at Tenant's expense,\nagrees that at al times its use of electric current shall\nresist or defend such action or proceeding by counsel approved by Owner in\nmot exceed the capacity of existing feeders to the building or the risers or\nwriting, such approval not to be unreasonably withheld.\nwiring installation and Tenant may not use any electrical equipment which,\nin Owner's opinion, reasonably exercised, wil overload such installations or\nDestruction,\n9. (a)If the demised premises or any part thereof\ninterfere with the use thereaf by other tenant of the building.The change at\nFire,\nany time of the character of electric service shall in no wise make Owner\nshall be damaged by fire or other casualty,Tenant\nand Other\nliable or responsible to Tenant, for any loss, damages or expenses which\nshall give immediate notice thereof to Owner and\nTenant may sustain.\nCasualty:\nthis lease shall continue in full force and effect\nexcept as hereinafter set forth.(b) If the demised\nAccess to\npremises are partially damaged or rendered partially unusable by fire or\n13. Owner or Owner's agents shall have the right\nPremises:\nother casualty, the damages thereto shall be repaired by and at the expense\n(but shall not be obligated) to enter the demised\npremises in any emergency at any time, and at\nof Owner and the rent and other items of additional rent, until such repair\nshall be substantialy completed, shall be apportioned from the day\nfallowing the casualty aceording to the part of the premises which is usable.\nreasonably desirable to any portion of the building or which Conr m\nby tre or oer casaty, en the rent and other items of additional rent as\nhereafter expressly provided shal be proportionately paid up to the time of\nor for the purpose of complying with lwe on\nthe casualty and thenceforth shall ccase until the date when the premises\nor for the purpose of complying with lavs,reulations and other directions\nand replace pipes and conduits in and through the demise premises and to the\nshall have been repaired and restored by Owner (or sooner reoccupied in\nwalls,floors or ceiling,wherever practicable.Owner may,during the\nwalls,floorg or ceiling,wherever practicable.Owner may,during the\nabove), subject to Owner's right to elect not to restore the same as\nhereinafter provided.(if the demised premises are rendered wholly\nand equipment into said premises without the same constitution and eviction\nin progress nor to any damages by reason of loss or interruption of business\npart) if the building shall be so damaged that Owner shall decide to\nor otherwise. Throughout the ten hereo wner l  to cnr\ndemolish it or to rebuild it, then, in any of such events. Owner may elect to\nterminate this lease by written potice fo nt enwhn 0 das er\nsuch fire or casualty or 30 days after adjustment of the insurance claim for\nto prospective purchaser or mortgagees of the building,and during the last\nsuch fire or casualty, whichever is sooner, specifying a date for the\nsix months of the term for the purpose of showing the same to prospective\nsuch fire or casualty, whichever is sooner, specifying a date for the\ntenants and may, during said six months period, place upon the demised\nexpiration of the lease, which date shall not be more than 60 days after the\ngiving of such notice, and upon the date specified in such notice the term of\npremises the usual notice \"To Let\" and \"for Sale' which notices Tenant shall\nthis lease shal expire as fully and completely as if such date were the date\npermit to remain thereon without molestation. If Tenant is not present to\nset forth above for the termin compietely as it such date were the date\nopen and permit an entry into the demised premises,Owmer or Owner's\npermissible by master key or forcibly and provided reasonable care is\npermissible by master key or forcibly and provided reasonable care is\nOwner's rights and remedies against rent owing shall be paid up to such\ndate and any payments of rent made by Tenant which were on account of\nany period subsequent to such date shall be returned Unless owner shall\nany period subsequent to such date shall be returned Unless owner shall\nhereunder be affected.If during the last month of term Teent shall have\nserve a termination notice as provided for herein, Owner shall make the\nremoved al or substantially all of Tenant's pronerty therefromner may\nremoved all or substantially all of Tenant's property therefrom, Owner may\nrepairs and restorations under the conditions of (b) and (c) hereof, with all\nimmediately enter, alter, renovate or redecorate the demise premises without\nclaims. labor troubles and causes hev e to adument of nurance\ncleims,Iabor troubles and causes beyond Owner's control.After any such\ncompensation and such act shal have no effect on this lease or Tenant's\ncasualty,Tenant shall cooperate with Owmer's restoration by moving from\nobligations hereunder. Owner shall have the right at any time, without the\nthe premises as promptly as reasonable possible, all of Tenant's salvageable\nsame camstituting n eviction and without incurring liability to Tenent\nliability for rent shall resume five (5) days after writen notice from Owner\ntherefor to change the arrangement and/or location of public entrances,\npassageways, doors, doorways, corridors, clevators, stairs, toilets, or other\nthat the premises are substantially ready for Tenant's occupancy.(e)\npassageways, doors, doorways, corridors, clevators, stairs, toilets, or other\npublic parts of the building and to change the name, number or designation\nNothing contained herein-above shal relieve Tenant from liability that may\nby which the building may be known.\nexist as a result of damage from fire or other casualty. Notwithstanding the\nforegoing, including Owner's obligation to restore under subparagraph(b)\nVauit,\n14. No vaults, vault space or area, whether or not\nabove, each party shall\nVault Space,\nenclosed or covered, not within the property line of\nArea:\n/the building is leased hereunder, anything contained\n7.c\n\n--- Page 4 ---\nin or indicated on any sketch, blue print or plan, or anything contained\nelsewhere in this lease to the contrary notwithstanding. Owner makes no\ncovenanted to be paid and the net amount,if any,of the rents collected on\nrepresentation as to the location of the property line of the building. All\naccount of the subsequent lease or leases of the demised premises for each\nreults and vault space and all such areas mot within the property line of the\nmonth of the period which would otherwise have constituted the balance of\nand/or ocoupied under revocable license,and if anry such license be\npart of parts thereof shall not release or affect Tenant's liability for\nand/or occupied under a revocable license, and if any such license be\nrevoked,or if the amount of such spece or area be diminished or required by\ndamages.In compating such liquidated dlemages there shall be adlded to the\nsaid denciency such expenses as Owner may incur in connection with re-\nsubject to any liability nor shall Tenant be entitled to any compensation or\nletting,such as legal expenses,reasonable attomneys'fees,brokerage,\nadvertising and for keeping the demised premises in good order or for\ndiminution or abatement of rent,nor shall such revocation,diminution or\npreparing the same for re-letting.Any such liquidated camages shall be\nrequisition be deemed constructive or actual eviction. Any tax, fee or charge\nof municipal authorities for such vault or area shall be paid by Tenant.\npaid in monthly installments by Tenant on the rent day specified in this\nlease.Owner,inputting the demised premises in good order or preparing\nOecupancy: 15. Tenant wil not at any time use or occupy the\nthe same for re-rental may, at Owner's option, make such alterations,\ndemised premises in violation of Articles 2 or 37\nrepairs,replacements,andor decorations in the demised premises as Omrner,\nin Owner's sole judgement,considers advisable and necessary for the\npurpose of re-letting the demised premises,and the makine or such\ndemised premises are a part. Tenant has inspected the premises and accepts\nthem as is, subject to the riders annexed hereto with respect to Owner's work,\nalterations, repairs, replacements, and/or decorations shall not operate or be\nif any.In any event,Owner makes no representation asto the condition of\nconstrued to release Tenant from liability. Owner shal in no event be liable\nthe premises and Tenant agrees to accept the same subject to violations\nin any way whatsoever for failure to re-let the demised premises, or in the\nevent that the demised premises are re-let.for tailure to cote the rthe\nwhether or not of record.\nthereof under such re-letin re relet, for failure to collect the rent\nthereof under such re-letting, and in no event shall Tenant be entitled to\nBankruptcy:\n16. (a)Anything elsewhere in this lease to the\ncontrary notwithstanding,this lease may be\nbreach by tenant or any or the covenents or arovitione rechn r threalened\ncancelled by Landlord by the sending of a written notice to Tenant within a\nreasonable time after the happening of any one or more of the following\nhave the right of injunction and the right to invoke any remedy allowed at\nevents:(1) the commencement of a case in bankruptcy or under the laws of\nany state naming Tenant as the debtor; or (2) the making by Tenant of an\nassignment or any other arrangement for the benefit of creditors under any\nremedy,shall not prechade Oyner from any other remnedy,in law or in\nstate statute.Neither Tenant nor any person claiming through or under\nequity. Tenant hereby expressly waives any and all rights of redemption\ngranted by or under any present or future laws.\nentitled to possession of the premises demised but shall forthwith ouit and\nsurrender the premises. If this lease shall be assigned in accordance with its\nFee and\n19. If Tenant shall default in the observance or\nterms, the provisions of this Article 16 shal be applicable only to the party\nExpenses:\npertormance of any term or covenant on Tenant's\nthen owning Tenant's interest in this lease.\ntominti wei(b)it is stipulated and agreed that in the event of the\nof any of the terms or provisions in any article of this lease, after notice if\ntermination of this lease purswant to (a)hereot,Owner shall forthwith,\nrequired and upon expiration of any applicable grace period if any, (except\nnotwithstanding any other provisions of this lease to the contrary, be entitled\nin an emergency), then, unless otherwise provided elsewhere in this lease,\nthe difference between the rent reserved hereunder for unexpired portion of\nwner may immediately or at any time thereater and without notice\npremises for the same periad.In the computation of such damages the\nrent hereunder, makes any expenditures or incurs any obligations for the\ndate of termination and the fair and reasonable rental value of the demised\nin instituting, prosecuting or defending any actions or proceeding and\npremises for the period for which such installment was payable shall be\nprevails in any such action or proceeding, such sums so paid or obligations\ndiscounted to the date of termination at the rate of four percent(4%) per\nincurred with interest and costs shall be deemed to be additional rent\nannum. It such premises or any part thereof be re-let by the Owner for the\nunexpired term of said lease, or any part thereof, before presentation of proof\nrendition of any bill or steatement to Tenant therefor,and if Tenant's lease\nof such liquidated damages to any court commission or tribmal fair and\nterm shall have expired at the time of makcing such exebendibures se\nterm shall have expired at the time of making such expenditures or\nreasonable rental value for the part or the whole of the premises so re-letting\nincuring of such obligations, such sums shall be recoverable by Owner as\nshal be deemed to be the fair and reasonable rental value for the part or the\ndamages.\nwhole of the premiges so re-let during the termo of the re.etting not ine\n e emies so re-let during the term of the re-leting. Nothing\nherein contained shall limit or prejudice the right of the Owmer to prove for\nNo Repre-\n20. Neither Owner nor Owner's agent have made\nand obtain as liquidated allowed by any statute or rule of law in effect at the\nsentations by\nany representations or promises with respect to the\ntime when, and goveming the proceedings in which, such damages are to be\nme wen, and goveming the proceedings in which, such damages are to be\nowner:\nphysical condition of the building, the land upon\nproved,whether or not such amount be greater,equal to,or less than the\nwhich it is erected or the demised premises, the\namount of the difference referred to above.\nrents, leases, expenses of operation, or any other matter or thing affecting or\nDefault:\nrelated to the premises except as herein expressly set forth and no rights,\n17. (1)If Tenant defaults in fulfiling any of the\neasements or licenses are acquired by o \nCovenants of this lease other than the covenants\nexcept as expressly set forth in the provisions of this lease. Tenant has\nfor the payment of rent or additional rent, or if the demised premises become\ninspected the building and the demised premises and is thoroughly ac.\nvacant or deserted; or it any execution or atachment shal be issued against\n w ther condition, and agrees to take the same“as is\"and\ntaken or occupied by someny whereupon the demised premises shal be\ntaken or occupied by someone other than Tenant; or if this lease be rejected\nTenant shal be conclusive evidence that the said pree ad the lding\nTenant shal be conclusive evidence that the said premises and the building\nunder Section 365 of Title II of the U.S.Code (Bankruptcy Code);or if tenant\nof which the same form a part were in good and satisfactory condition at the\ndays after the commencement of theo the premses within thirty\nime sen possesion was so taken, except as to latent defects. All\nshal be the sole judge; then, in any one or more of such events, upon Owner\nare merged in this contract, which alone fully and completely expresses the\nagreement between Owner and Tenant and any executory agreement\nhave failed to comply with or remedy such defeult or if the sid delto\nhereafter made shall be ineffective to change,modify,discharge or effect an\nhave failed to comply with or remedy such default,or if the said default or\nabandonment of it in whole or in part,unless such executory agreement is in\nomission complained of shall be of a nature that the same cannot be\nwriting and signed by the party against whom enforcement of the change,\ncompletely cured or remedied within said fifteen(15) day period, and if\nmodification, discharge or abandonment is sought.\nmay serve a written five (5) days notice of cancellation of this lease upon\nEnd of\nTenant, and upon the expiration of said five (5) days, this lease and the term\n21. Upon the expiration or other termination of the\nTerm:\nthereunder shall end and expire as fully and completely as if the expiration of\nterm of this lease, Tenant shal quit and surrender to\nsuch five(5) day period were the day herein definitely fixed for the end and\norder and condition, ordinary wear excepted, and Tenant shall remove al its\nexpiration of this lease and the term thereof and Tenant shall then quit and\nproperty. Tenant's obligation to observe or perform this covenant shall\nsurrender the demised premises to Owner but Tenant shall remain liable as\nsurvive the expiration or other termination of this fease.If the lest day of\nhereinafter provided.\n(2)If the notice provided for in(1) hereof shall have\nbeen given, and the term shall expire as aforesaid; or if Tenant shall make\nexpire at noon on the preceding Saturday unless it be a legal holiday in\ndefault in the payment of the rent reserved herein or any item of additional\nwhich case it shall expire at noon on the preceding business day.\nrent herein mentioned or any part of either or in making any other payment\nQuiet\n22. Owner covenants and agrees with Tenant that\nenter the demised premises either by force or otherwise and the legal\nenter the demised premises either by force or otherwise, and the legal\nEnjoyment:\nupon Tenant paying the rent and additional rent and\nrepresentative of Tenant or other occupant of demised premises and remove\nobserving and performing all the terms, covenants\ntheir effects and hold the premises as if this lease had not been made, and\nand conditions, on Tenant's part to be observed and performed, Tenant may\nTenant hereby waivers the service of notice of intention to re-enter or to\npeaceably and quietly enjoy the premises hereby demised, subject, never-\ninstitute legal proceedings to that end.\ntheless, to the terms and conditions of this lease including, but not limited\nto, Article 33 hereof and to the ground leases, underlying leases and\nRemedies of\n18. In case of any such default, re-entry, expiration\nmortgages hereinbefore mentioned.\nOwner and\nend/or dispassess by summary proceedings or other\nWalver of\nwise, (a)the rent, and additional rent, shall become\nFailure to\n23. If Owner is unable t o give possession of the\nRedemption:\ndue thereupon and be paid up to the time of such\nGive\ndemised premises on the date of the commencement\nre-entry, dispossess and /or expiration.(b)Owner\nPossession:\nmay re-let the premises or any part of parts thereof, either in the name of\nRetention of posssose of the holding-overor\nOwner or other wise, for a term or terms, which may at Owner's option be\noccupants, or if the premises are located in a building being constructed,\nless than or exceed the period which would otherwise have constituted the\nbalance of the term of this lease and may grant concessions or free rent or\nbecause such building has not been sufficiently completed to make the\ncharge a higher rental than that in this lease.or foor the ll\npremises ready for occupancy or because of the fact that a certificate of\ncharge a higher rental than that in this lease,and lor (o)Tenant or the legal\noccupancy has not been procured or for any other reason,Owner shal not\nrepresentatives of Tenant shall also pay Ormmer liquidated damages for the\nbe subject to any liabiliry for failre i ive  eaonOwner shall not\nbe subjeet to any liabiliry for failure to give possession on id date and the\nfailure of Tenant to observe and perform said Tenant's covenants herein\ncontained, any deficiency between the rent hereby reserved and/or\nvalidity of the lease shall not be impaired under such circamstances,nor\nshall the same be construed in any wise to extend the term of this lease, but\n\n--- Page 5 ---\nthe rent payable hereunder shall be abated (provided Tenant is not responsible\nfor the inability to abtain possession or complete construction)until after\nSprinklers:\n29. Anything elsewhere in this lease to the contrary\nOwner shall have given Tenant written notice that the Owner is able to\nnotwithstanding, if the New York Board of Fire\ndeliver possession in the condition required by this lease. If permission is\nUnderwriters or the Insurance Services Office or any bureau,department or\ngiven to Tenant to enter into the possession of the demised premises or to\nthe instalation of a sprinkler systen or that any changes, modificaons.\noccupancy premises other than the demised premises prior to date specified\nthe instalation of a sprinkler system or that any changes, modifications,\nalterations, or additional sprinkler heads or other equipment be made or\nterms, covenants, conditions and y sal be deened to be under al the\nsupplied in an existing sprinkler system by reason of Tenant's business,or\nterms, covenants, conditions and provisions of this lease except the obligation\nthe location of partitions, trade fixtures, or other contents of the demised\nto pay the fixed annual rent set forth is page One of this lease. The provisions\npremises, or for any other reason, or if any such sprinkler system\nof this article are intended to constitute an express provision to the contrary\"\nwithin the meaning of Section 223-a of the New York Real Property Law.\nheads or omer such equipment, become necessary to prevent the imposi-\ntion of a penalty or charge against the ful allowance for a sprinkler system\nNo Waiver:\n24.The failure of Owner to seek redress for viola-\nin the fire insurance rate set by any said Exchange or by any fire insurance\ntion or, or to insist upon the strict performance of any\ncompany. Tenant shall, at Tenant's expense, promptly make such\ncovenant or condition of this lease or of any of the Rules or Regulations set\nforth or hereafter adopted by wne ay ot the Rules or Regulations set\nsprinkler system installations, changes, modifications, alterations, and\nsupply additional sprinkler heads or other equipment as required whether\nwould have originally constituted a violation from having al the force and\nthe work involved shal be structural or non-structural in nature. Tenant\neffect of an original violation.The receipt by Owmer of rent and/or additional\nshall pay to Owner as additional rent the sum of\n, on the first day of each\ndeemed a wavier of such breach and no provision of this lease shall he\nmonth during the term of this lease, as Tenant's portion of the contract price\ndeemed to have been waived by Owner unless such waiver be in writing\nfor sprinkler supervisory service.\nsigned by Owner.No payment by Tenant or receipt by Orner of a lesser\nElevators,\nHeat,\n30. As long as Tenant is not in default under any of\nthan on account of the carliest stipulated rent,nor shall any endorsement of\nthe covenants of this lease beyond the applicable\nCleaning:\nstatement of any check or any letter accompanying any check or payment as\ngrace period provided in this lease for the curing of\nsuch defaults, Owner shall, if and insofar as existing\nrent be deemed an accord and satisfaction, and Owner may accept such check\nfacilities permit furmish heat to the demised premises, when and as required\nrent or pursue any other remedy in this lease provided.No act or thing done\nby law,on business days from 8:00 a.m.to 6:00 p.m.and on Saturdays\nby Owner or Owner's agents during the term hereby demised shall be deemed\nfrom 8：00 a.m. to 1：00 p.m. Tenant shall at Tenant's expense, keep demised\nin acceptance of a surrender of said premises and no agreement to accept such\npremises clean and in order, to the satisfaction to owner, and if demised\nsurender shall be valid unless in writing signed by Owner. No employee of\nOwner or Owner's agent shall have any power to accept the keys of said\nexpense, make al repairs and replacement to the sidewalks and curbs\nexpenee, make al repairs and replacement to the sidewalks and curbs\npremises prior to the termination of the lease and the delivery of keys to any\nadjacent thereto,and kep said sidewalks and curbs free fram snow,ice,dirt\nsuch agent or employee shal not operate as a termination of the lease or a\nsurrender of the premises.\nTenant's refuse and rubbish from the building. Bills for the same shall be\nrendered by Owner to Tenant at such times as Owmer may eleet and shall\nWavier of\n25. It is mutually agreed by and between Owner and\nbe due and payable when rendered,and the amount of such bills shall be\nTriat by Jury:\nTenant that the respective parties hereto shall and\nThey hereby do waive trial by jury in any action,\nproceeding or counterclaim brought by either of the parties hereto against\nrefuse in the event that Tenant does not wish to have same done by\nrefuse in the event that Tenant does not wish to have same done by\nthe other (eaxcept for personal injury or property damage)on Bny meatters\nemployees of Owner. Under such circumstances, however, the removal of\nsuch refuse and rubbish by others shall be subject to such rules and\nrelationship of Owner and Tenant. Tenant's use of or ancy of said\nregulations as,in the judgment of Owner,e mecessary for the proper\npremises,and any emergency statutory or any other statutory remedy.It\noperation of the building.\nis further mutually agreed that in the event Owner commences any\nSecurity:\n31. Tenant has deposited with Owner the sum\npossession of the premises.Tenant wo\nformance and observance by Tenant of the terms\nwhatever nture or description in any such proceeding,including a\nformance and observance by Tenant of the terms,\ncounterclaim under Article 4 except for statutory mandatory counterclaims.\nprovisions and conditions of this lease: it is agreed that in the event Tenant\ndefaults in respect of any of the terms, provisions and conditions of this\nInabllity to\n26.This lease and the obligation of Tenant to pery\nPerform:\nOwner may use, apply or re thepyment of rent and additional rent\nrent hereunder and perform al of the other covenants\nOwner may use,apply or retain the whole or ny part of the security so\nand agreements hercunder on part of Tenant to be\ndeposited to the extent requined for the payment of any rent and edditional\nrent or any other sum as to which Tenant is in default or for any sum which\nunable to fuifill any of its obligations under this lease or to supply or is\nunable to muakce,or is deleyed in making any repair.additions,altereations or\ndefault in respecr of ny ot the tethed arce axrend by reason ot tenane's\ndecorations or is unable to supply or is delayed in supplying any\nincluding but not limited to any damages or deficiency in the re-letting of\nso doing by reason of strike or labor troubles, government preention or\nrestrictions or by reason of rroubles, govermment preemption or\nshal fully and faithflly coy by Owner. In the event that Tenant\nshal fully and faithfully comply with al of the terms, provisions, covenants\nsubdivision thereof of any govemment agency or by reason of the\ndate fixed a the end of the Lease and after delivery of entire possession\nby wa or other emergency,or when,in the judgement or oner.\nof the demised premises to Owner.In the event of sale of the land and\ntemporary interruption of such services is necessary by reason of accident,\nbuilding or leasing of the building, of which the demised premises form a\nmechanical breakdown, or to make repairs, alterations or improvements.\nlesse and Owner shal thereupon be released by Tenant from al liability\nBills and\n27. Except as otherwise in this lease provided, a bil,\nse e or such securty, and Tenant agrees to look to the new Owner\nNotices:\nsolely for the retumn of said security;and it is reed that the provisions\nstatement,notice or communication which Owner\nhereof shall apply to every transfer or assignment made of the security to\nmay desire or be require to give to Tenant, shall be\nor attempt to assign or encumber the monies deposited herein as security\ndeemed suficiently given or rendered if, in writing, delivered to Tenant\npersonally or sent by registered or certified mail sdare ssed reree ont e ent\nand that neither Owmer nor its successors or assigns shall be bound by arry\nbuilding of whic thetered or certified mail addressed to Tenant at the\nsuch assigament,encumbrance,attempted assignment or artempted\nbuilding of which the demised premised form a part or at the last known\nencumbrance.\nresidence address or business address of Tenant or left at any of the\nCaptions:\n32. The Captions are inserted only as a mater of\nsuch bill or statement and of the giving of such notice or communication\nconvenience and for reference and in no way\nshall be deemed to be the time when the same is delivered to Tenant,\ndefine, limit or describe the scope of this lease nor the intent of any\nprovision thereof.\nto Owner must be served by registered or certified mail addressed to Owner\nDefinitions:\nat the address first hereinabove given or at such other address as Owner\n33. The term \"Owner\"as used in this lease means\nshall designate by written notice.\nonly the Owner, or the mortgage in possession,\nfor the time being of the land and building(or the Owner of a lease of the\nWater\n28. If Tenant requires, uses or consumes water for\nbuilding or of the land and building) of which the demised premises form a\nany purpose in addition to ordinary lavatory pur-\npart, so that in the event of any sale or sales of said land and building or of\nsaid lease, or in the event of a lease of said butlding or of the land and\nposes (of which fact Tenant constitutes Owner to be\naid lease,or in the event of lease of said building,or of the land and\nthe sole judge)Owner may install a water meter and thereby measure\nthe cost of the meter and the cost of the ntant shall pay Owner fr\nof al covenants and obligations of Owner hereunder, and it shall be deemed\nand construed without further agreement between the parties of their\nthe duration of Tenant's occupancy Tenant shall keep said meter and\nsuccessors in interest, or between the parties and the purchaser, at any such\nsale, or the said lessee of the building, or of the land and building, that the\nid meer as and wheierees to pay for water consumed, as shown on\nany and all covenants and obligation of\npay the sewer rent, charge or any other tax, rent, levy or charge which now\nenter“and \"re-entry”as used in this lease are not restricted to their\nshall exchude Satundays,Sundays and all days designated holidays by the\nissued in connection with the use, consumption, maintenance or supply of\naplicable bay. undays and al days designated as holidays by the\napplicable building service wnion employees service contract or by the\nwater, water system or sewage connection or system. The bill\napplicable Operating Engineers contract other respect to HVAC service.\nrendered by Owner shall be payable by Tenant as additional rent. If the\nWherever it is expressly provided in this lease that consent shall not be\nunreasonably withheld, such consent shall not be unreasonably delayed.\nthrough a meter through which water is also supplied to other premises\nTenant shall pay t Owner as additional rent, on the first day of each month,\nAdjacent\n34.If an excaration shall be made upon\nOne Hundred Percent(100%)\nExcavation-\nland adjacent to the demised premises, or\nof the total meter charges, as Tenant's portion. Inde- pendently of and in\nShoring:\nshal be authorized to be made, Tenant\naddition to any of the remedies reserved to Owner hereinabove or elsewhere\nshall afford to the person cmusing or\nin this lease, Owner may sue for and collect any monies to be paid by Tenant\nsuthorized to cue such excvation,license to enter upon the demised\nor paid by Owner for any of the reasons or purposes hereinabove set forth.\npremises for the purpose of doing such work as said person shall deem\nnecessary to preserve the wall or the building of which demised premises\n\n--- Page 6 ---\nform a part from injury of damage and to indemnity against Owner, or\nshall directily bind any successors in interest to the Tenant.Teaant agrees\ndiminution or abatement of rent.\nthat if at any time Tenant violates any of the provisions of this Article,such\nviolation shal be deemed a breach of a substantial obligation of the terms of\nthis lease and objectionable conduct. Pormographic material is defined for\nRules and\n35. Tenant and tenant's servants, employees,\npurposes of this Article as any written or pictorial manner with prurient\nRegulations:\nagents,visitors, and licensees shal observe\nappeal or any objects of instrument that are primarily concerned with lewd\nfaithfully, and comply strictly with the Rules\nor prurient sexual activity. Obscene material is defined here as it is in Penal\nlaw 5235.00.\nand Regulations and such other and further reasonable Rules and Regulations\nas Oumer or Owner's agents may from time to time adopt.Notice of ny\nEstoppel\n38. Tenant, at any time, and from time to time, upon\nCertificate:\nelect.In case Tenant disputes the reasonableness of amy additional Rule or\nat least 1o days prior notice by Owner,shall execute\nreeulation hereafer made or adonted hy cussr e c dan bl eee or\nacknowledge and deliver to Owmer,and for to any\nRegulation hereafter made or adopted by Owner or Owner's agents, the\nparties hereto agree to submit the question of the reasonableness of such Rule\nother person, firm or corporation specified by Owner, a statement certifying\nother person, fmm or corporation specified by Owner, a statement certifying\nthat this lease is unmodified and in full force and effect (or,if there heve\nbeen modifications), stating the dates which the rent and additional rent\nupon the parties hereto. The right to dispute the reasonableness of any\nhave been paid, and stating whether or not there exists any defaults by\nadditional Rule or Regulation upon Tenant's part shall be deemed waived\nOwner under this lease, and, if so, specifying each such default.\nSuccessors\n39. The covenants, conditions and agreements\nthis lease contained shall be construed to impose upon Owner any duty or\nand Assigns:\ncontained in this lease shall bind and inure to the\nobligation to enforce the Rules and Regulations or terms, covenants or\nbenefit of Owner and Tenant and their respective\nconditions in any other lease, as against any other tenant and Owner shall not\nheirs, distributees, executors, administrators, successors, and except as\nbe liable to Tenant for violation of the same by any other tenant, its servants,\notherwise provide in this lease,their assigns.Tenant shall look anly to\nemployees, agents, visitors or licensees.\nOwner's estate and interest in the land and building for the satisfaction of\nTenant's remedies for the collection of a judgment (or other iudicial\nTenant's remedies for the collection of a judgment (or other judicial\nprocess)against Owner in the event of any default by Owner hereunder, and\nGlass:\n36. Owner shal replace, at the expense of Tenant,\nany and all plate and other glass damaged or broken\nor director thereof disclosed ar undiselosed shell he hie er\nfrom any cause whatsoever in and about the demised premises. Owner may\nexecution or other enforcement procedure for the asfo of n\nexecution or other enforcement procedure for the satisfaction of Tenant's\ninsure, and keep insured, at Tenant's expense, al plate and other glass in the\nremedies under or with respect to this lease, the relationship of Owner and\nTenant hereunder, or Tenant's use and occupancy of the demised premises.\ntherefor shal be rendered by Owner to Tenant at such times as Owner may\nelect,and shall be due from,and payable by,Tenant when rendered,and the\namount thereof shal be deemed to be, and be paid as, additional rent.\nPornographic 37. Tenant agrees that the value of the demised pre-\nUses Prohibited:\nmises and the reputation of the Owner will be\nseriously injured if the premises are used for any\nobscene or pomographic purposes or any sort of commercial sex\nestablishment. Tenant agrees that Tenant will not bring or permit any\nobscene or pomographic material on the premises, and shall not permit or\nnor permit use of the premises for nude modeling, rap sessions, or as a so\ncalled rubber goods shops, or as a sex club of any sort, or as a \"massage\nparlor,Tenant grees further that Tenant will not permit any of these\nsublease of the premises. This Article\nIn Witness Whereof, Owner and Tenant have respectively signed and sealed this lease as of the day and\nyear first above written.\n一\n.\n,\nOwner: T.C. Barclay LLC\nTenant: Kings Elevator Parts Inc.\nACKNOWLEDGEMENTS\nCORPORATE OWNER\nCORPORATE TENANT\nSTATE OF NEW YORK,\nss.:\nSTATE OF NEW YORK,\nss.:\nCounty of\nCounty of\nOn this\nday of\n,20\n,\nOn this\nday of\nbefore me personally came\n,20\nbefore me personally came\nto me known, who being by me duly swom, did depose and say that\nhe resides in\nto me known, who being by me duly sworn, did depose and say that\nhe resides in\nthat he is the\nof\nthat he is the\nthe corporation described in and which executed the foregoing\nof\ninstrument,as OWNER;that he knows the sal of said corporation:\nthe corporation described in and which executed the foregoing\nthe seal affixed to said instrument is such corporate seal; that it was\ninstrument,as OWNER;that he knows the sal of sid carporation;\nso affixed by order of the Board of Directors of said corporation,\nthe seal affixed to said instrument is such corporate seal;that it was\nand that he signed his name thereto by like order.\nso affixed by order of the Board of Directors of said corporation,\nand that he signed his name thereto by like order.\n......................\n......................\nINDIVIDUAL OWNER\nINDIVIDUAL OWNER\nSTATE OF NEW YORK,\nss.:\nSTATE OF NEW YORK,\nss.:\nCounty of\nCounty of\nOn this\nday of\n,20\n,\nOn this\nday of\nbefore me personally came\n,20\n,\nto be known and known to me to be the individual\nbefore me personally came\ndescribed in and who, as OWNER, executed the foregoing instru-\nto be known and known to me to be the individual\nment and acknowledged to me that\ndescribed in and who, as TENANT, executed the foregoing\nhe\ninstrument and acknowledged to me that\nexecuted the same.\nhe\nexecuted the same.\n\n--- Page 7 ---\nRIDER TO LEASE AGREEMENT\nLANDLORD:\nT.C. Barclay LLC\nTENANT:\nKings Elevator Parts Inc.\nDATED:\nJanuary 26,2024\nPREMISES:\n154-01 Barclay Avenue, Flushing, NY 11355\nIf there is any conflict between the form lease and this Rider, this Rider shall control or be\ndeemed as supplementary.\n40. The term of this lease shall be two and half(2%)years commencing January 1s,2024 and\nexpiring on May 31st, 2026. The rental to be paid during such term shall be as follows:\n01/01/2024-12/31/2024\n$ 7,700.00 per month\n$92,400.00 per year\n01/01/2025-12/31/2025\n$ 7,931.00 per month\nS95,172.00 per year\n01/01/2026-05/31/2026\n$ 8,168.93 per month\n$98,027.16 per year\nAll of the above installments of rent as herein above provided shall be paid in equal monthly\npayments, in advance, on the 1 day of each and every month, at such places as Landlord\nmay designate without any offset or deduction whatsoever. In the event the payment is not\nmade within five (5) days of the due date, the Landlord may, in addition to any and all other\nrights and remedies available to the Landlord, impose an additional late charge of 5% of the\namount due, and Tenant agrees to pay such late charge as an ADDITIONAL RENT. It is\nunderstood and agreed that no late charge shall be due hereunder unless the letter forwarding\nsuch payment is postmarked later than the date said late installment was due. Late payments\nof“additional rent” payable under this lease shall also be subject to such\"late charge”of 5%\nper month. Such late charges shall be payable for each month during which same remains\nunpaid. Such late charge shall be deemed the reasonable cost to the Landlord for such late\npayment. In addition, in the event of non-payment of the base rent or any additional rent as\nspecified herein, the Landlord may deem such non-payment as a default under paragraph 17\nof the printed lease and the lease may be terminated under the provisions of that paragraph.\nTenant agrees that payment of the base rent or any additional rent as specified herein\nsubsequent to the date of notice to terminate the lease shall not be a defense in any\nsubsequent action or proceeding to evict the Tenant.\n41. In the event Tenant's rent payment is made by check and that check is dishonored, there shall\nbe a returned check charge of One Hundred($100.00) dollars, for each dishonored check.\nSuch charge shall be deemed additional rent and shall be paid within five (5) days of the\nrendition of a statement thereof.\n42. Tenant agrees and covenants not to record this lease.\n43. It is understood and agreed that this lease is given to Tenant as a courtesy only, subject to the\nLandlord's acceptance and approval and this lease is not binding until the Landlord had\naffixed its signature thereto.\n44. In addition to the base rent as herein provided to be paid by Tenant to Landlord, Tenant shall\npay 100% of the real estate taxes imposed upon premises located at 154-01 Barclay Avenue,\nFlushing NY 11355. Such amount shall be paid on the 1 day of each and every month\ntogether with the base rent.\n45. Tenant acknowledges that the demised premises and the neighboring building with the\naddress of 154-05 Barclay Avenue share one water meter. Tenant agrees to be responsible for\n50% of total water charges billed to said water meter. Such payment shall be paid to\nLandlord within 3 business days upon tender of water bill to Tenant.\n46. Tenant has inspected the demised premises and accepts the same in \"AS IS\" condition\nwithout reliance upon any representation or warranty by Landlord or anyone. Taking\npossession of the demised premises by Tenant shall be condlusive evidence that the said\ncQW\n1.c\n\n--- Page 8 ---\npremises and the building of which the same form a part, were in satisfactory condition at the\ntime such possession was so taken except as herein expressly set forth\n47. Tenant is permitted to use half of the backyard adjacent to the driveway. Tenant shall be\nresponsible to maintain this side of the yard to keep it clean and orderly fashion\n48. Tenant shall, at its own cost and expense, secure and pay for the repair and maintenance of\nair conditioning (if any), plumbing, electrical, heating, and exhaust systems and equipment.\nLandlord shall have no obligation whatsoever to furnish or perform any repairs, maintenance\nor service, except as otherwise stated herein. Tenant shall also be responsible for structural\nrepairs as are made necessary by negligent acts of commission or omission of the Tenant.\nTenant shall also be required, at its own cost and expense to maintain and replace broken\nplate glass on the demised premises. Landlord shall have no obligation whatsoever to furnish\nor perform any repairs, maintenance or service, except as otherwise stated herein\nIn addition to and not in lieu of paragraph 3 of the printed form, it is agreed that any\nalterations consented to by Landlord shall be subject to the following terms and conditions:\n(a) All such tenant's alterations shall comply with all applicable provisions of this\nease and all applicable governmental rules and regulations of any Board of Fire\nUnderwriters or similar agency having jurisdiction:\n(b) Tenant shall first submit to Landlord for its approval, plans and specifications\ncovering said Tenant's work. Landlord agrees not to unreasonably withhold or delay its\nconsent to such plans and specifications and to any subsequent changes therein. In the\nevent that Landlord does not notify Tenant its decision within ten (10) business days,\nsuch approval is waived by Landlord;\n(c) Tenant, at its expense, shall procure each and every permit, license, franchise, or\nother authorization required for the performance of such work.\nTenant shall be responsible for all the interferences with the damages to the existing\nplumbing and heating systems, electrical wiring and structure of the demised premises\ncaused by the Tenant's alteration work. It is further agreed that in order to induce\nLandlord to enter into this lease agreement with Tenant, Tenant hereby agrees that the\n\"sign-offor “Certificate of Occupancy”of alteration performed in demised premises by\nTenant shall be completed and approved by the Department of Building within six (6)\nmonths from the date of commencement of such alteration. Failure to comply within six\nmonths as aforementioned will be deemed as a material breach of lease by Tenant.\n49. Tenant agrees to provide on or before the commencement date and keep in force during the\ndemised term: a) Comprehensive General Liability insurance relating to the demised\npremises and its appurtenances on an occurrence basis with minimum limits of liability in\namounts of $1,000,000.00 for bodily injury, or death to any one person, $2,000,000.00 for\nbodily injury, or death to more than one person; b) $500,000.00 with respect to any damage\nto property; and c) plate glass insurance. Upon failure of the Tenant to obtain and deliver\naforesaid insurance or certificates thereof, during the entire term hereof, the Landlord may\nthereupon obtain the same on behalf of the Tenant and the premiums for the same will be due\nupon the next day the rent is due hereunder as additional rent, and shall be collectible as\nadditional rent by summary proceeding or otherwise. If, by reason of Tenant's conduct or\nneglect or default, such insurance should become unobtainable, Landlord may terminate the\nlease on fifteen(15) day written notice of Landlord's intention to do so, at the end of which\nfifteen(15) day period the lease shall cease and terminate.\n50. All of the insurance required to be purchased by Tenant shall be issued in the name of the\nLandlord (and any designees of Landlord) and Tenant, and shall be written by one or more\nresponsible insurance companies doing business in the State of New York which shall be\nsatisfactory to the Landlord, and all such policies shall provide that: a) such insurance may\nnot be cancelled or amended with respect to Landlord (or its designees) except upon ten(10)\nday written notice by registered mail to Landlord (and such designees) by the insurance\ncompany; b)Tenant shall be solely responsible for payment of premiums and Landlord (or its\ndesignees) shall not be required to pay any premiums for such insurance; c) in the event of\npayment of any loss covered by such policy, Landlord (and its designees) shall be paid first\nby the insurance company for its loss.\nQw\nT\n\n--- Page 9 ---\n51. Notwithstanding the forms of insurance set forth herein, and the limits of required coverage\nset forth herein, Tenant agrees: a) to indemnify Landlord against all damage, loss or liability\nresulting from any of the risks referred to in this lease. Such indemnification shall operate\nwhether or not Tenant has placed and maintained the insurance, and whether or not proceeds\nfrom such insurance, and whether or not proceeds from such insurance actually are\ncollectible from one or more of the insurance companies.\n52. Tenant shall have no power to do any act or make any contract which may create or be the\nfoundation for any lien upon the reversion of Landlord, the demised premises herein or\nLandlord's building and improvements, it being agreed that should Tenant cause any\nalterations, changes, additions, improvements, or repairs to be made to the demised premises\nor material furnished or labor performed therein or thereon, neither Landlord nor the demised\npremises shall, under any circumstances, be liable for the payment of any expenses incurred\nor for the value of any such work done or material furnished to the demised premises or any\npart thereof, but all such alterations, changes, additions, improvements and repairs and\nmaterials and labor shall be at Tenant's expense, and Tenant shall solely and wholly be\nresponsible to contractors, laborers and material men furnishing labor and material to said\npremises and building, or any part thereof for or on behalf of Tenant.\n53. Tenant shall not suffer or permit any mechanic's liens to be filed against the fee ownership of\nthe demised premises nor against Tenant's leasehold interest in said premises, by reason or\nwork, labor, services or materials supplied or claimed to have been supplied to Tenant or to\nany occupant of the demised premises. If any such mechanic's lien shall at any time be filed\nagainst the demised premises or the building and improvements thereof, Tenant shall, at its\nown cost and expense, cause the same to be cancelled and discharged of record by surety\nbond or appropriate cash deposit within thirty (30) days after the date of filing the same and\nnotice thereof to Tenant, and Tenant shall indemnify and save harmless Landlord from and\nagainst any and all costs, expenses, claims, losses or damages resulting therefrom or by\nreason thereof.\n54. Tenant shall also defend on behalf of Landlord, at Tenant's sole cost and expense, any action\nsuit or proceedings which may be brought thereon or for the enforcement of such liens or\norders, and Tenant shall pay any damages and satisfy and discharge any judgment entered\nthereon and save harmless Landlord from any claim or damage resulting therefrom.\n55. If Tenant shall fail to discharge such mechanic's lien within such period, then in addition to\nany other right or remedy of Landlord, Landlord may, but shall not be obligated to, discharge\nthe same either by paying the amount claimed to be due or by procuring the discharge of\nsuch lien by deposit in court or bonding, and in any such event, Landlord shall be entitled, if\nLandlord so elects, to compel the prosecution of an action for the foreclosure of such\nmechanic's lien by the lienor and to pay the amount of the judgment, if any in favor of the\nlienor, with interest, cost and allowances.\n56. Any amount paid by Landlord for any of the aforesaid charges and all reasonable legal and\nther expenses of Landlord, including reasonable attorney's fees, in defending any such\naction or in or about procuring the discharge of said liens, with all necessary disbursements\nin connection therewith, with interest thereon at the rate of ten percent(10%) per annum\nfrom the date of payment, shall be repaid within a period of ten(10) days after written\ndemand therefore by Landlord to Tenant, and shall be treated as ADDITIONAL RENT.\n57. Anything to the contrary herein contained notwithstanding, it is expressly understood and\nagreed by the Tenant that it will not directly or indirectly or through the acts of any servant or\nagent cause a lien of any nature, mechanics or otherwise to be placed against the building or\nrealty in which the demised premises are located or which will adversely affect the\nLandlord's interest or estate in the demised premises or the property in which it is situated.\nThe placing of any such lien which is not removed by the Tenant in accordance with this\nprovision of this lease shall be construed to be material breach of this lease.\n58. Tenant further covenants and agrees to indemnify and save harmless the Landlord from any\nor all fines, suits, liability, proceedings, claims, demands, and actions of any kind of nature\narising or growing out of or in any way connected with the use and occupation of the said\npremises and/or by reason of any breach, violation, or non-performance of any covenant or\ncondition thereof on the part of the Tenant to be performed,\n0\n7\n\n--- Page 10 ---\n59. Tenant shall be responsible for all its own utilities including, but not limited to, heating, air-\nconditioning, gas and electric and rubbish removal and all charges imposed against the\ndemised premises.\nTenant shall at its own cost and expense, repair, maintain and replace all bulbs, fixtures and\nwiring and heating and air conditioning facilities in the demised premises and to install one if\nnecessary.\n60. Tenant shall employ a licensed exterminator for treatments of the premises when necessary\nTenant shall insure that no roaches, mice and other pests infest the demised premises. In the\nevent, Tenant fails to properly eliminate any pest problem, Landlord may employ an\nexterminator and any charges are to be additional rent plus a fifteen(15%) percent\nadministrative charge which shall be collectible.\n61. Tenant agrees that he shall maintain heat in the demised premises so that the temperature\ntherein shall at no time fall below 45 degree Fahrenheit.\n62. Tenant shall, at his own cost and expense, install in the demised premises a 2 % gallon\npressurized water type fire extinguisher and such other fire extinguishing devices as may be\nrequired by law.\n63. Tenant acknowledges being aware of the American Disabilities Act and that its requirements\nmay apply to the demised premises. Except as otherwise expressly provided in this lease.\nTenant agrees that compliance with the requirements of the American Disabilities Act as it\naffects the demised premises (and, if due to Tenant's acts, as it affects the building) shall be\nthe responsibility of the Tenant. Further, Landlord's approval of any plans, specifications and\nworking drawings for Tenant's alterations shall create no responsibility or liability on the\npart of Landlord for their completeness, design sufficiency, or compliance with the American\nDisabilities Act or any other laws, rules and regulations of governmental agencies or\nauthorities.\n64. Tenant agrees that in the event of default by Tenant in the performance of this lease, or the\nayment of any installment of rent or additional rent, or any other sum due under this lease\nthe Landlord is expressly authorized and entitled to use, apply or retain as Landlord's sole\nproperty that portion or all of the security deposited by the Tenant on signing of this lease to\nthe extent necessary to cure such default or to reimburse the Landlord for any sum which it\nmay expend or be required to expend by reason of Tenant's default. Any or all portion of the\nsecurity deposit thus used or applied by the Landlord shall be made and re-deposited by\nTenant promptly without demand to the original amount of the security deposit required\nunder this lease. This right shall not be construed as exclusive.\n65. Upon execution of this lease, Tenant agrees to deposit security deposits with the Landlord the\nsum of $23,100.00 which equal to three months rent. Said security deposit shall bear no\ninterest. Tenant shall not assign, hypothecate, encumber or attempt to assign, hypothecate or\nencumber the monies deposited herein as security and that neither Landlord nor its\nuccessors or assigns shall be bound by any assignment, hypothecation, encumbrance,\nattempted assignment or attempted encumbrance. Under no circumstances may Tenant apply\nthe security or any part thereof to the payment of any sum due hereunder, including, without\nlimitation, to the payment of basic rent and/or additional rents. In the event of a sale of the\nland and building or a lease of the building, Landlord shall have the right to transfer Tenant's\nsecurity deposit to the vendee or lessee and Landlord shall thereupon be released by Tenant\nfrom all liability for the return of such security and Tenant agrees to look to the new\nLandlord solely for the return of said security.\n66. Tenant agrees to look solely to the equity of the demised premises for the satisfaction of any\nremedies of Tenant in the event of any breach by Landlord of any of its obligations. Such\nexculpation of liability shall be absolute and without any exception whatsoever.\n67. This lease shall be construed under the laws of the State of New York.\n68. Tenant hereby represents to the Landlord that no broker was instrumental in bringing about\nthis lease agreement and hereby agrees to keep, save harmless, and indemnify the Landlord,\nof, from and against the payment of any brokerage commissions in connection therewith and\nof, from and against any and all loss, damage, cost and expense which may be incurred or\nsustained by the Landlord by reason thereof.\n√\n\n--- Page 11 ---\n69. Tenant is permitted to erect a sign at the demised premises. However, the size, shape and\nphysical appearance of said sign must be approved by the Landlord in advance. In the event\nthat Landlord does not notify Tenant its decision within ten(10) business days, such approval\nis waived by Landlord. Such signs shall comply with the laws and municipal regulations.\nSuch signs shall be furnished, installed, repaired or replaced by the Tenant at the Tenant's\nexpense, and Tenant shall hold the Landlord harmless from any damage or liability resulting\ntherefrom. If electrical signs are installed by the Tenant, all cost pertaining to said signs shall\nbe paid for by the Tenant.\n70. During the term of the lease, the Tenant shall not cause to be done in or upon the demised\npremises any act or thing which shall be may be nuisance, annoyance or damage to the\nLandlord, or his tenants and covenants that no business shall be carried on nor any acts\nuffered or permitted to be done on said premises that in any manner conflict with or are\ncontrary to any law which might result in damage or penalty to, or forfeiture by the Landlord.\n71. Landlord shall not be held responsible for any damage premises or its contents resulting from\nany party attempting to gain entrance to the demised premises either legally or otherwise. In\nadditional, Landlord shall not be held responsible for any water, drainage, snow or ice\ndamage the demised premises or its contents. It is specifically understood and agreed that\nLandlord is not responsible for any damage to the demised premises including the exterior as\nthe result of vandalism, malicious mischief, criminal trespassing or act, and that any such\ndamages are to be repaired and/or restored by Tenant at Tenant's own cost and expense\n72. If by reason of Tenant's breach of any covenant in this lease or defaults in the payment of\nrent, the Landlord incurs any damages, expenses, fees, including reasonable attorney's fees.\nin instituting, prosecuting and defending any action or proceeding, said expenses costs or\nfees shall be deemed ADDITIONAL RENT and shall be due and payable within five(5)\ndays of rendering a bill or statement for said sums.\n73. Tenant acknowledges that possession of the demised premises must be surrendered to\nLandlord at the expiration or sooner termination of the term of this lease. Tenant agrees to\nindemnify and save Landlord harmless against all cost, claims, loss or liability resulting from\ndelay by Tenant in so surrendering the demised premises, including, without limitation, any\nclaims made by any succeeding tenant founded on such delay. The parties recognize and\nagree that the damage to Landlord resulting from any failure by Tenant to timely surrender\npossession of the demised premises as aforesaid will be extremely substantial, will exceed\nthe amount of the monthly rent and additional rent theretofore payable hereunder, and will be\nimpossible to accurately measure. Tenant, therefore, agrees that if possession of the demised\npremises is not surrendered to Landlord within twenty-four (24) hours after the Expiration\nDate or sooner termination of the term of this lease, then Tenant shall pay to Landlord for\neach month and for each portion of any month during which Tenant holds over in the\ndemised premises after the expiration or sooner termination of the term of this lease, a sum\nequal to three(3) times the aggregate of that portion of the fixed rent and additional rent\nwhich was payable under this lease during the last month of the term hereof. Nothing herein\ncontained shall be deemed to permit Tenant to retain possession of the demised premises\nafter the Expiration Date. The provision of this paragraph shall survive the expiration or\nsooner termination of this lease.\n74. No receipt of monies by Landlord from Tenant, after any re-entry or after the cancellation or\ntermination of this lease in any lawful manner, shall reinstate the lease; and after the\nservice of notice to terminate this lease, or after the commencement of any action, proceeding\nor other remedy, Landlord may demand, receive and collect any monies due, and apply them\non account of Tenant's obligations under this lease but without in any respect affecting such\notice, action, proceeding or remedy, except that if a money judgment is being sought in any\nsuch action or proceeding the amount of such judgment shall be reduced by such payment\n75. Tenant shall use the demised premises only for the purpose set forth in first page of the\nrinted form of the Lease. The use of the demised premises for any other purpose or activity\nwhether continues or occasional, including, without limitation, any form of gambling,\nwagering, use or sale of counterfeit products in violation of patent and trademark laws\nmassage parlor or sex related activities are prohibited. In the event that tenant in breach of\nthis provision, tenant's security deposit will be forfeited by landlord\nQw\n\n--- Page 12 ---\n76. If in this lease it is provided that Landlord's consent or approval as to any matter will not be\nunreasonably withheld, and it is established by a court of body having final jurisdiction there\nover that Landlord has been unreasonable, the only effect of such finding shall be that\nLandlord shall be deemed to have given its consent or approval; but Landlord shall not be\nliable to Tenant in any respect for money damages by reason of withholding its consent.\n77. Tenant hereby agrees to pay, as additional rent, all attorneys' fees and disbursements(and all\nother court costs or expenses of legal proceeding) which Landlord may incur or pay out by\nreason of, or in connection with:\na. Any action or proceeding by Landlord to terminate this lease pursuant to provisions\nof this leases;\nb. Any other action or proceeding by Landlord against Tenant (including, but not\nlimited to, any arbitration proceeding);\nc. Any default by Tenant in the observance or performance of any obligation under this\nlease (including, but not limited to, matters involving: payment of rent and additional\nrent; computation of escalations; alternations or other Tenant's work and subletting or\nassignment) whether or not Landlord commences any action or proceeding against\nTenant;\nd. Any action or proceeding brought by Tenant against Landlord (or any officer\npartner, or employee of Landlord)in which Tenant fails to secure a final unappealable\njudgment against Landlord.\nTenant's obligation under this paragraph shall survive the expiration of the term hereof or\nany other termination of this lease. This paragraph is intended to supplement (and not to\nlimit) other provisions of this lease pertaining to indemnities and/or attorneys'fees.\nIf Landlord commences a Summary Proceeding because Tenant fails to comply with any\nobligation provided in this lease,then reasonable attorney's fee in the amount of $500.00\nshall be immediately due. If the summary proceeding results in a judgment for the\nLandlord, reasonable attorney's fee in the amount of $1,500.00 shall be immediately due\nand added to the judgment. If any injunction proceedings are commenced, reasonably\nattomey's fee in the minimum amount of $1,000.00 shall be immediately due. All of the\nabove shall consider as ADDITIONAL RENT.\n78. Tenant acknowledges that there is a sprinkler serving the demised premises along with the\nneighboring building (154-05 Barclay Avenue, Flushing, NY 11355)， Tenant shall be\nresponsible for the cost of annual sprinkler maintenance and/or any charge made by the\nmunicipality or company providing water either for the use of the sprinkler or for a standby\ncharge or any other charge applicable to the use or maintenance thereof.\n79. Notwithstanding the provisions of paragraph 11 of the printed lease, it is understood and\nagreed that the Tenant may assign this lease or sublease all or part of the premises only with\nthe Landlord's written consent, but such consent shall not be unreasonably withheld. The\nTenant shall not be entitled to assign or sublease pursuant to this paragraph at any time\nduring which it is in default of the payment of rent. Acceptance of rent by the Landlord from\nany occupant of the demised premises or assignee, subtenant or any successor or alleged\nsuccessor in interest of the Tenant, with or without notice, shall in no event relieve the\nTenant or guarantor from its obligation to pay rent under the terms of this lease or to perform\nany other obligation of the Tenant or guarantor hereunder. Further, acceptance of such rent\nshall not constitute recognition of any other occupant or person, firm or corporation as lawful\ntenant, subtenant o occupant of the demised premises under this lease. The transfer of the\nmajority stock of the Tenant, if the Tenant is a corporation, shall be deemed as assignment\nunder the terms of this lease.\nIn the event of the sale of the business or an assignment of the lease, the Tenant agrees to\ncomply with the following requirements:\na) Assignee shall maintain a similar business as provided for in this lease.\nb) Assignee shall by instruments in writing duly executed and acknowledged assume all of\nthe terms, conditions and provisions of this lease and agree to perform same which\nQW\n不\n\n--- Page 13 ---\nassumption agreement shall be sent to the Landlord by registered mail five(5) days\nafter said assignment.\nc)\nThere shall be added to the security deposit herein an additional monthly rental each\ntime that this lease is assigned.\nd)Tenant will pay Landlord reasonable attorney fee and credit report fee, the amount of\nwhich shall be determined Landlord's attorney, but in any event it shall not be less than\n$1,000.00.\n80. Tenant agrees to permit the Landlord or the Landlord's agents to place “FOR RENT” or\n\"FOR SALE\"sign at the demised premises or to show the demised premises during normal\nbusiness hours for the purpose of leasing within three months of the termination date of this\nlease or selling same.\n81. Tenant agrees to comply with the applicable laws, rules, regulations and codes of all\ngovernmental authorities and all recommendations and/or requirements of the insurance\ncompanies insuring said demised premises as well as the building of which the demised\npremises form a part.\n82. Landlord shall be responsible for the repair and maintenance of the roof and exterior wall for\nthe demised premises.\n83. Tenant shall maintain and pay for annual inspection fee for air conditioning and exhausting\nsystem along with all parts equipped to said systems if there is required by law.\n84. Landlord shall at all times have access to the demised premises for the purpose of\nmaintaining, repairing or replacing utility and sewer lines, metering equipment and related\npiping located therein. The merchandise in the demised premises shall be stored in such\nmanner so as not to interfere with access to such utility and sewer line, meters and related\npiping.\n85. Supplementing paragraph 10 of the printed form, a taking of any portion of the sidewalk in\nfront of the demised premises for street widening or other governmental purpose shall not in\nany respect affect this lease nor the rent payable hereunder or be deemed a taking of any part\nof the demised premises. The tenant further covenants and agrees not to sell, offer for sale,\nor display, outside, in front of or on the exterior of the demised premises, or any part hereof,\nany goods, wares, or merchandise, of any kind whatsoever, and shall also not obstruct or\npermit the obstruction of the sidewalk or the sidewalk entrance to the demised premises, or\nany part thereof, in any matter whatsoever.\n86. Tenant covenants and agrees that:\na) it will, at Tenant's sole cost and expense, clean the interior and exterior of the\nwindows and doors, including the frame thereof, in the demised premises and in\nthe perimeter walls thereof and keep same neat and clean at all time. Tenant\nagrees to keep the front of the said premises, and the sidewalk thereof, clean and\nneat and free and clear of debris at all time and to comply with the municipal rules\nand regulations regarding the removal of snow and ice;\nb)\nit will use and occupy subject premises only for the express purposes as set forth\nin paragraph 2 of the printed form and may not be used for any other purpose,\nincluding residential and any illegal activities;\nc)\nin the event of any damages caused to the sidewalk by Tenant's truck loading or\nunloading on the sidewalk, it shall be Tenant's sole responsibility.\nd)\nIt is understood and agreed that Tenant will not paint, mark or otherwise change\nthe exterior walls of the demised premises without the Landlord's prior written\nconsent.\ne)\nIt is agreed that at the commencement of this Lease, and at least twice each year,\nTenant will clean the front of the demised premises and keep same in good repair\nand appearance throughout the demised term, or any extension or renewal thereof.\n87. Any Tenant's inventory, equipment, machinery, trade fixtures and personal property\n(collectively \"Equipment\") not removed by Tenant after repossession of the demised\npremises by Landlord, whether or not this lease has been terminated, shall be considered\nabandoned by Tenant and may be appropriated, sold, destroyed or otherwise disposed of by\nTc\n\n--- Page 14 ---\nLandlord without notice to Tenant and without obligation to account therefore; and Tenant\nshall pay Landlord, on demand, all costs and expenses incurred by Landlord in removing,\nstoring or disposing of any of Tenant's Equipment.\n88. The Tenant shall maintain and operate its business in compliance with all laws, ordinances,\nand regulations of all governmental agencies having jurisdiction of the premises and/or\nbusiness. Tenant shall comply with al notices of violations and correct such violations within\nten(10) days of any notice. In the event the violations are not so corrected, the Landlord shall\nhave the right to terminate or cancel this lease upon five (5) days notice to the Tenant.\nNotwithstanding any termination or cancellation by the Landlord, the Tenant shall be\nresponsible and remain liable for all damages, costs, fines, expenses and attorney fees\nresulting from Tenant's failure to correct any violations.\nTenant shall be responsible for and immediately pay all fines and penalties levied by the\nDepartment of Sanitation, Environmental Control Board, Department of buildings or any\nother governmental agency, exercising jurisdiction and shall cure, correct, clear and dismiss\nof record any violations imposed against the business or demised premises. Tenant shall\nindemnify and hold harmless the Landlord from and against claims, penalties, judgments,\ncosts including attorney fees resulting from any such violation or correction or failure to\ncorrect same.\n89. The Tenant is prohibited from storing or using materials in the demised premises classified as\nhazardous or toxic under any local, state or federal law or regulation. Tenant shall further\nindemnify the Landlord from any cost and expenses incurred due to environmental\ncontamination caused by the Tenant.\nLANDLORD:\nT.C. Barclay LLC\ns'Byce Cheng\nTENANT:\nKings Elevator Parts Inc.\nBy:Qingxiang Wang\n8\n不\n\n--- Page 15 ---\nGUARANTY\nLandlord:T.C.Barclay LLC\n...\nTenant: Kings Elevator Parts Inc.\nPremises: 154-01 Barclay Avenue, Flushing, NY 11355\nDated: January6,2024\nIn consideration of That in consideration of the sum of One (S1.00)Dollar to the undersigned in hand paid by the\nLandlord and as inducement to the Landlord to enter into a lease by and between the above parties the letting of\nthe premises mentioned in said lease to the Tenant, the undersigned, Qingxiang Wang, residing at 3595 Somerset\nDrive Seaford.NY 11783,SS#:059-80-6562 as Guarantor(\"Guarantor)hereby unconditionally guarantees to\nLandlord, its successors and assigns, the full and prompt payment of base rent, additional rent(as same are defined\nin the Lease)and all other charges payable by Tenant, its successors and assigns under the Lease and any renewal\nand modification or extension thereof, and hereby further guarantees the ful and timely performance and\nobservance of al the covenants, terms, conditions and agreements therein provided to be performed and observed\nby Tenant and its successors and assigns under the Lease and any renewal and modification or extension thereof;\nand Guarantor hereby covenants and agrees to and with Landlord that if default shall at any time be made by\nTenant or its successors or assigns, in the payment of any base rent, additional rent or other charges under the\nLease and any renewal and modification or extension thereof, and observance of any of the covenants, terms,\nconditions and agreements contained in the Lease to be performed or observed under the Lease and any renewal\nand modification or extension thereof, Guarantor, in each and every instance, shall and will forthwith pay such\nbase rent, additional rent and other charges to Landlord and any arrears thereof, and shall and will forthwith\nfaithfully perform and fulfil all of such covenants, terms, conditions and agreements, and will forthwith pay to\nLandlord al damages that may arise in consequence of any default by Tenant or its successors or asigns under\nthe Lease, including without limitation, all attorneys'fees and disbursements incurred by Landlord or caused by\nor in any way related to any such default and/or the enforcement of this Guaranty.\nThis Guaranty is an irevocable, absolute and unconditional guaranty of payment and of performance. It shall be\nenforceable against Guarantor without the necesity of any suit or proceedings on Landlord's party of any kind or\nnature whatsoever against Tenant or its successors or assigns, and without the necessity of resorting to any\nsecurity under the Lease or any need to give notice of non-payment, observance or of any notice of acceptance of\nthis Guaranty or of any other notice or demand to which Guarantor might otherwise be entitled, all of which\nGuarantor hereby expressly waives;and Guarantor hereby expressly agrees that the validity of this Guaranty and\nthe obligations of Guarantor hereunder shall in no way be terminated, affected, diminished or impaired by reason\nof the assertion or the failure to assert by Landlord against Tenant,or against Tenant's successors or assigns,any\nof the rights or remedies reserved to Landlord pursuant to the provisions of the Lease.\nIn addition to and not in limitation of any provision hereof, Guarantor confirms his intent, agreement and\nunderstanding to be primarily obligated under the Lease, as if he had executed the same as Tenant.\nThis Guaranty shall be a continuing guaranty,and the liability of Guarantor hereunder shall in no way be affected,\nmodified, impaired or diminished by reason of any event or circumstance which might otherwise constitute a legal\nor equitable discharge of Guarantor, including, without limitation: (i) any assignment, renewal or modification of\nthe Lease;(ii) any modification or waiver of or change in any of the terms, covenants, conditions or provisions of\nthe Lease by Landlord to Tenant or its successors or assigns notwithstanding that such modifications or\namendments increase the liability of Guarantor under this Guaranty; (ii) any dealings or transactions or matter or\nthing of any kind or nature occurring between Landlord and Tenant or Tenant's successors or assigns;(iv) any\nconsent, indulgence or other action, inaction or omission with respect to Tenant under or in respect to the Lease;\n(v) any failure to act, delay, indulgence, or lack of diligence on the part of Landlord to enforce, assert or exercise\nany right, power of remedy conferred on Landlord under the Lease or this Guaranty; (vi) any compromise,\nsettlement,release or termination or any or all of the obligations of Tenant under the Lease;or (vi)any\nbankruptcy, insolvency, reorganization, arrangement, assignment for the benefit of creditors, receivership or\ntrusteeship affecting Tenant or Tenant's successors or assigns, whether or not notice thereof is given to Guarantor.\n1\n\n--- Page 16 ---\nAll of Landlord's rights and remedies under the Lease and/or under this Guaranty are intended to be distinct,\nseparate and cumulative and no such right or remedy therein or herein mentioned is intended to be in exclusion of\nor a waiver of any of the others. This Guaranty and/or any of the provisions hereof cannot be modified, waived or\nterminated unless such modification, waiver or termination is in writing, signed by Landlord.\nGuarantor hereby agrees that whenever at any time or from time-to-time Guarantor shall make any payment to\nLandlord or perform or fulfill any covenant, term, condition or agreement hereunder on account of the liability of\nGuarantor hereunder, Guarantor will notify Landlord in writing that such payment or performance as the case may\nbe is for such entitle Guarantor by subrogation or otherwise to the rights of Landlord to any payment by Tenant or\nout of the property of Tenant, except after payment of all sums and fulfillments of all covenants, terms, conditions\nor agreements to be paid or performed by Tenant or its permitted successors or assigns under the Lease. Any\npayments Guarantor may receive from Tenant shall be considered trust funds for the benefit of Landlord.\nGuarantor agrees that Guarantor will, at any time and from time-to-time, within five (5) days following written\nrequest by Landlord and without charge therefore, execute, acknowledge and deliver to Landlord a statement\ncertifying that this Guaranty is unmodified and in full force and effect (or if there have been modifications, that\nhe same is in full force and effect as modified and stating such modification). Guarantor agrees that such\ncertificates may be relied upon by anyone holding or proposing to acquire any interest in the Building (as the\nsame is defined in the Lease) from or through Landlord or by any mortgagee or prospective mortgagee of the\nBuilding or of any interest therein.\nAs a further inducement to Landlord to make and enter into the Lease and in consideration thereof, Guarantor\novenants and agrees that in any action or proceeding brought on, under or by virtue of this Guaranty, Guarantor\nshall and does hereby waive trial by jury.\nThis Guaranty shall enforced and construed in accordance with the internal laws of the State of New York\n(without regard to principles of conflict of laws) and shall be binding upon and inure to the benefit of Landlord\nand Guarantor and their heirs, legal representatives, successors and assigns.\nDate:\n126/2024\nBY:\nSTATE OF NEW YORK\nCOUNTY OF OUEENS\nOn the  day of Tay\n, in the year of 20 before me, the undersigned, proved to me on\nthe basis of satisfactory evidence to be the individual whose name is subscribed to the within instrument and\nacknowledged to me that he executed the same in his capacity and tat by his signature on the instrument, the\nindividual or the person upon behalf of which the individual acted.executed the instrument.\nKEm\nN. YUNG\nMobrb\nNOTARY PUBLIC\nState of New York\nRegistratio\n6076235\nfied in ou\nCommission Expires\nount\n241201\n2\n\n--- Page 17 ---\nNYCityMap\nLot Info\nMap Explorer\nNYCOTI\n+\nClear search location\n154.01 barclay ave, flushing Ny 11355\n×\nLot Information\nBlock: 5326\nLot: 64\nBBL:4053260064\nZIP:11355\nOwner: T.C. BARCLAYLLC\nLot Area: 4.240 sf\nLot Frontage:106.00\n16321\nLot Depth:40.00\nNumber of Buildings:1\nNumber of Floors:1\nGross Floor Area: 4,000 sf (estimated)\nResidential Units:0\nTotal Units: 1\nLand Use: Industrial & Manufacturing Buildings\nZoning: R5\nCommercial Overlay: C1-2\n154-01 Barclay Ave\n154-17\n153-27\nZoning Map #：10c\nFlushing, New York, 11355\nLearn more about zoning\n53-11\nDepartment of City Planning\nZoning & Land Use Map (ZoLa\nBARCLAY AVE\nBARCLAYAVE\n2\nDepartment of Finance\nAutomated City Register Information System (ACRIS)\nBuilding Information\n154-16\n154-18\nBuilding ldentification Number (BIN): 4120319\n15420\n154-22\nConstruction Year: 1930\n15424\nRoof Height: 15.26\nStreet View\nDepartment of Buildings\nProperty.Profile\nOATH/ECB Violations\nContact Us\n8\nElevator Records\nOURCE: NYC OTIINYC Open DataIEsri\nPowered by Esri\n\n--- Page 18 ---\nTDBank\n1-1367/280\n0198\nxings Elevator parts Inc.\n154-01 Barelay Ave\nglusfing,wor11355\n8/2/2024\nPAY TO THE TC Barclay LLC\n*7,700.00\nORDER OF\n$\nSeven Thousand Seven Hundred and 00/100\nDOLLARS\nTC Barclay LLC\nMP\nMEMO\nAugust 2024 Warehouse Rent\n00019802601367304414084460\nKings Elevator Parts Inc.\n0198\nTC Barclay LLC\n8/2/2024\nDate\nType Reference\nOriginal Amt.\nBalance Due\nDiscount\nPayment\n8/1/2024\nBill\n7,700.00\n7,700.00\n7,700.00\nCheck Amount\n7,700.00\nTD Bank Checking# 4 August 2024 Warehouse Rent\n770000\nKings Elevator Parts Inc.\n0198\nTC Barclay LLC\n8/2/2024\nDate\nType Reference\nOriginal Amt.\nBalance Due\nDiscount\nPayment\n8/1/2024\nBill\n7,700.00\n7,700.00\n7,700.00\nCheck Amount\n7,700.00\nTD Bank Checking# 4 August 2024 Warehouse Rent\n7,700.00\nRee 3 155\n104761\n10476\n\n--- Page 19 ---\nTD Bank\n1-1367/260\n0170\nXings Elevator Parts Inc.\n154 01 Barclay Ave\nslushing,wor21355\n6/21/2024\nPAY TO THE\nTC Barclay LLC\n$\n*38,500.00\nORDEROF\nThirty-Eight Thousand Five Hundred and 00/100\nDOLLARS\nTC Barclay LLC\nMEMO\nFeb 2024 to Jun 2024 154-01 Barclay Ave Rent\n900\nP\nAUTHORIZED\n0001700260136734414084460\nKings Elevator Parts Inc.\n0170\nTC Barclay LLC\n6/21/2024\nDate\nType Reference\nOriginal Amt.\nBalance Due\nDiscount\nPayment\n2/1/2024\nBill\n7,700.00\n7,700.00\n7,700.00\n3/1/2024\nBill\n7,700.00\n7,700.00\n7,700.00\n4/1/2024\nBill\n7,700.00\n7,700.00\n7,700.00\n5/1/2024\nBill\n7,700.00\n7,700.00\n7,700.00\n6/1/2024\nBill\n7,700.00\n7,700.00\n7,700.00\nCheck Amount\n38,500.00\nTD Bank Checking# 4 Feb 2024 to Jun 2024 154-01 Barclay Ave Rent\n38,500.00\nKings Elevator Parts Inc\n0170\nTC Barclay LLC\n6/21/2024\nDate\nType Reference\nOriginalAmt.\nBalance Due\nDiscount\nPayment\n2/1/2024\nBill\n7,700.00\n7,700.00\n7,700.00\n3/1/2024\nBill\n7,700.00\n7,700.00\n7,700.00\n4/1/2024\nBill\n7,700.00\n7,700.00\n7,700.00\n5/1/2024\nBill\n7,700.00\n7,700.00\n7,700.00\n6/1/2024\nBill\n7,700.00\n7,700.00\n7,700.00\nCheck Amount\n38,500.00\nTD Bank Checking# 4 Feb 2024 to Jun 2024 154-01 Barclay Ave Rent\n38,500.00\nRev3/19\n104761\n104/6\n\n--- Page 20 ---\nTD Bank\nKings Elevator Parts Inc.\n1-1367/260\n0125\n154-01 Barclay Ave\nFlusfing,Ny11355\n112512024\nPAY TO THE\nORDER OF\nTC Bastay uc\n$23100—\nwenty three thasand one hundred aif(ov\nDOLLARS\nMEMo 3mentns secunty dopot\nMP\ntor 5-01 Bardey Are.\n00012502601367304414084460\nKings Elevator Parts Inc.\n0125\nKings Elevator Parts Inc\n0125\nRav 3/19\n104761\n10476","ocr_status":"completed","exhibit_number":"A-4","exhibit_title":"Exhibit A4_pdf","created_at":"2025-11-27T19:44:48.078586"}],"analysisResults":{"01051c79-8e0a-4669-9135-728b0b754c00":{"document_type":"Corporate Filing and IRS Notice","document_date":"2022-04-22","entities":[{"type":"company","name":"KINGS ELEVATOR PARTS INC.","role":"entity","context":"Business Corporation"},{"type":"person","name":"QING XIANG WANG","role":"incorporator","context":"Certificate of Incorporation"},{"type":"company","name":"Department of State","role":"issuer","context":"Certificate of Incorporation"},{"type":"company","name":"Internal Revenue Service","role":"issuer","context":"EIN Assignment"},{"type":"date","name":"2022-04-22","role":"filing date","context":"Certificate of Incorporation"},{"type":"date","name":"2022-04-22","role":"notice date","context":"IRS Notice"},{"type":"amount","name":"200","role":"shares","context":"Authorized Shares"},{"type":"amount","name":"88-1927324","role":"EIN","context":"IRS Notice"},{"type":"address","name":"154-05 BARCLAY AVE, FLUSHING, NY 11355","role":"corporate address","context":"Service of Process"}],"tags":["corporation","incorporation","irs","ein","business","new york"],"key_quotes":[{"text":"ENTITY NAME: KINGS ELEVATOR PARTS INC.","page":2,"topic":"Entity Information"},{"text":"The Secretary of State is designated as agent of the corporation upon whom process against it may be served.","page":5,"topic":"Certificate of Incorporation"},{"text":"We assigned you EIN 88-1927324.","page":6,"topic":"IRS Notice"}],"summary":"The document contains corporate filing information for KINGS ELEVATOR PARTS INC., a domestic business corporation registered in New York. It includes the Certificate of Incorporation filed on April 22, 2022, and an IRS notice assigning the company an Employer Identification Number (EIN) of 88-1927324. The corporation is authorized to issue 200 shares with no par value and is located in Queens, New York.","docName":"Exhibit A1.pdf","exhibitNumber":"A-1"},"db5489c9-7911-4bdd-ba15-82c6ee05cf3f":{"document_type":"Corporate Documents and Financial Statement","document_date":"2024-06-30","entities":[{"type":"company","name":"KINGS ELEVATOR PARTS INC.","role":"Corporation","context":"Subject of the document"},{"type":"person","name":"Qing Xiang Wang","role":"Shareholder","context":"Owner of shares"},{"type":"company","name":"Fuzhou Shinestone Trade Co., Ltd.","role":"Shareholder","context":"Owner of shares"},{"type":"amount","name":"49%","role":"Shareholding","context":"Qing Xiang Wang's share percentage"},{"type":"amount","name":"51%","role":"Shareholding","context":"Fuzhou Shinestone Trade Co., Ltd.'s share percentage"},{"type":"amount","name":"386,480.61","role":"Ending Balance","context":"Bank account balance as of June 30, 2024"},{"type":"date","name":"2022-04-26","role":"Adoption Date","context":"Date bylaws were adopted"}],"tags":["corporate","bylaws","shareholders","financial","bank statement"],"key_quotes":[{"text":"Total Authorized Issue 200 Shares Without Par Value Common Stock","page":2,"topic":"Share Authorization"},{"text":"The fiscal year of the corporation shall begin on the first day of January","page":12,"topic":"Fiscal Year"},{"text":"Eliminating the Non-Sufficient Funds (NSF) Fee.","page":20,"topic":"Bank Policy Update"}],"summary":"The document contains corporate bylaws and financial statements for Kings Elevator Parts Inc., a New York corporation. It details the shareholding structure, with Qing Xiang Wang and Fuzhou Shinestone Trade Co., Ltd. as shareholders. The financial statement shows a bank account ending balance of $386,480.61 as of June 30, 2024, and includes updates to the bank's deposit account agreement.","docName":"Exhibit A2.pdf","exhibitNumber":"A-2"},"fd6e1c92-a55f-4137-af81-a9ebac447c7a":{"document_type":"Financial Statement","document_date":"2023-04-01","entities":[{"type":"company","name":"KINGS ELEVATOR PARTS INC","role":"reporting corporation","context":"Form 1120"},{"type":"amount","name":"670,867","role":"total assets","context":"Form 1120"},{"type":"amount","name":"741,227","role":"gross receipts or sales","context":"Form 1120"},{"type":"amount","name":"588,257","role":"cost of goods sold","context":"Form 1120"},{"type":"amount","name":"2,817","role":"taxable income","context":"Form 1120"},{"type":"amount","name":"592","role":"total tax","context":"Form 1120"},{"type":"date","name":"2022-04-22","role":"date incorporated","context":"Form 1120"},{"type":"person","name":"VINCENT HUANG, CPA","role":"preparer","context":"Form 1120"},{"type":"company","name":"FUZHOU SHINESTONE TRADE CO., LTD","role":"25% foreign shareholder","context":"Form 5472"},{"type":"amount","name":"500,000","role":"total value of gross payments","context":"Form 5472"}],"tags":["financial statement","tax return","corporation","income","deductions","assets","liabilities","shareholder","foreign ownership"],"key_quotes":[{"text":"KINGS ELEVATOR PARTS INC","page":2,"topic":"Company Name"},{"text":"Total assets: $670,867","page":2,"topic":"Assets"},{"text":"Gross receipts or sales: $741,227","page":2,"topic":"Income"},{"text":"Taxable income: $2,817","page":2,"topic":"Income"},{"text":"Total tax: $592","page":4,"topic":"Tax"}],"summary":"The document is a financial statement for KINGS ELEVATOR PARTS INC, detailing their U.S. Corporation Income Tax Return for the tax year beginning April 1, 2023, and ending March 31, 2024. It includes information on gross receipts, taxable income, total assets, and tax liabilities. The company is partially foreign-owned by FUZHOU SHINESTONE TRADE CO., LTD.","docName":"Exhibit A3.pdf","exhibitNumber":"A-3"}},"relationshipData":{"entities":[{"id":"e1","type":"company","name":"KINGS ELEVATOR PARTS INC.","documents":["01051c79-8e0a-4669-9135-728b0b754c00","db5489c9-7911-4bdd-ba15-82c6ee05cf3f","fd6e1c92-a55f-4137-af81-a9ebac447c7a"],"attributes":{"role":["entity","Corporation","reporting corporation"],"context":["Business Corporation","Subject of the document","Form 1120"]}},{"id":"e2","type":"person","name":"QING XIANG WANG","documents":["01051c79-8e0a-4669-9135-728b0b754c00","db5489c9-7911-4bdd-ba15-82c6ee05cf3f"],"attributes":{"role":["incorporator","Shareholder"],"context":["Certificate of Incorporation","Owner of shares"]}},{"id":"e3","type":"company","name":"Department of State","documents":["01051c79-8e0a-4669-9135-728b0b754c00"],"attributes":{"role":"issuer","context":"Certificate of Incorporation"}},{"id":"e4","type":"company","name":"Internal Revenue Service","documents":["01051c79-8e0a-4669-9135-728b0b754c00"],"attributes":{"role":"issuer","context":"EIN Assignment"}},{"id":"e5","type":"company","name":"Fuzhou Shinestone Trade Co., Ltd.","documents":["db5489c9-7911-4bdd-ba15-82c6ee05cf3f","fd6e1c92-a55f-4137-af81-a9ebac447c7a"],"attributes":{"role":["Shareholder","25% foreign shareholder"],"context":["Owner of shares","Form 5472"]}},{"id":"e6","type":"person","name":"VINCENT HUANG, CPA","documents":["fd6e1c92-a55f-4137-af81-a9ebac447c7a"],"attributes":{"role":"preparer","context":"Form 1120"}}],"relations":[{"source_id":"e2","target_id":"e1","relation_type":"incorporator_of","evidence":["01051c79-8e0a-4669-9135-728b0b754c00"],"description":"QING XIANG WANG is the incorporator of KINGS ELEVATOR PARTS INC."},{"source_id":"e2","target_id":"e1","relation_type":"shareholder_of","evidence":["db5489c9-7911-4bdd-ba15-82c6ee05cf3f"],"description":"QING XIANG WANG holds 49% shares in KINGS ELEVATOR PARTS INC."},{"source_id":"e5","target_id":"e1","relation_type":"shareholder_of","evidence":["db5489c9-7911-4bdd-ba15-82c6ee05cf3f"],"description":"Fuzhou Shinestone Trade Co., Ltd. holds 51% shares in KINGS ELEVATOR PARTS INC."},{"source_id":"e5","target_id":"e1","relation_type":"foreign_shareholder_of","evidence":["fd6e1c92-a55f-4137-af81-a9ebac447c7a"],"description":"Fuzhou Shinestone Trade Co., Ltd. is a 25% foreign shareholder of KINGS ELEVATOR PARTS INC."}],"evidence_chains":[{"claim":"Executive Capacity","documents":["01051c79-8e0a-4669-9135-728b0b754c00","db5489c9-7911-4bdd-ba15-82c6ee05cf3f"],"strength":"strong","reasoning":"QING XIANG WANG is both the incorporator and a significant shareholder of KINGS ELEVATOR PARTS INC., indicating an executive role."}]},"writingResults":[],"analysisHistory":[{"timestamp":"2025-11-27T19:47:21.533Z","results":{"01051c79-8e0a-4669-9135-728b0b754c00":{"document_type":"Corporate Filing and IRS Notice","document_date":"2022-04-22","entities":[{"type":"company","name":"KINGS ELEVATOR PARTS INC.","role":"entity","context":"Entity Information"},{"type":"person","name":"QING XIANG WANG","role":"incorporator","context":"Certificate of Incorporation"},{"type":"company","name":"WANG C/O VINCENT HUANG CPA P.C.","role":"filer","context":"Certificate of Incorporation"},{"type":"address","name":"154-05 BARCLAY AVE, FLUSHING, NY 11355","role":"corporate address","context":"Entity Information"},{"type":"date","name":"2022-04-22","role":"filing date","context":"Certificate of Incorporation"},{"type":"date","name":"2024-04-30","role":"next statement due date","context":"Entity Information"},{"type":"number","name":"6464635","role":"DOS ID","context":"Entity Information"},{"type":"number","name":"88-1927324","role":"EIN","context":"IRS Notice"}],"tags":["corporation","incorporation","irs","tax","business","new york"],"key_quotes":[{"text":"ENTITY NAME: KINGS ELEVATOR PARTS INC.","page":2,"topic":"Entity Information"},{"text":"The Secretary of State is designated as agent of the corporation upon whom process against it may be served.","page":5,"topic":"Certificate of Incorporation"},{"text":"We assigned you EIN 88-1927324.","page":6,"topic":"IRS Notice"}],"summary":"The document is a corporate filing for KINGS ELEVATOR PARTS INC., a domestic business corporation registered in New York, with an initial filing date of April 22, 2022. It includes the Certificate of Incorporation and an IRS notice assigning the company an Employer Identification Number (EIN) of 88-1927324. The corporation is located in Queens, New York, and has a next statement due date of April 30, 2024.","docName":"Exhibit A1.pdf","exhibitNumber":"A-1"},"db5489c9-7911-4bdd-ba15-82c6ee05cf3f":{"document_type":"Corporate Documents and Financial Statement","document_date":"2024-06-30","entities":[{"type":"company","name":"KINGS ELEVATOR PARTS INC.","role":"corporation","context":"Subject of the document"},{"type":"person","name":"Qing Xiang Wang","role":"shareholder","context":"Owner of shares"},{"type":"company","name":"Fuzhou Shinestone Trade Co., Ltd.","role":"shareholder","context":"Owner of shares"},{"type":"amount","name":"49%","role":"share percentage","context":"Qing Xiang Wang's share"},{"type":"amount","name":"51%","role":"share percentage","context":"Fuzhou Shinestone Trade Co., Ltd.'s share"},{"type":"amount","name":"386,480.61","role":"ending balance","context":"Bank account balance"},{"type":"date","name":"2022-04-26","role":"adoption date","context":"Bylaws adoption"},{"type":"date","name":"2023-12-15","role":"signature date","context":"Shareholder meeting"},{"type":"amount","name":"500,000.00","role":"wire transfer","context":"Incoming from Fuzhou Shinestone Trade Co., Ltd."}],"tags":["corporate","bylaws","shareholders","financial","banking","meeting","stock","new york"],"key_quotes":[{"text":"Total Authorized Issue 200 Shares Without Par Value Common Stock","page":2,"topic":"Stock Information"},{"text":"The fiscal year of the corporation shall begin on the first day of January","page":12,"topic":"Fiscal Year"},{"text":"The meeting was held at 154-05 Barclay Ave, Flushing NY 11355","page":15,"topic":"Meeting Location"},{"text":"We're committed to keeping you informed when it comes to your banking.","page":20,"topic":"Bank Statement Notice"}],"summary":"The document contains corporate bylaws, shareholder meeting minutes, and a financial statement for Kings Elevator Parts Inc., a New York corporation. It details the ownership structure, with Qing Xiang Wang and Fuzhou Shinestone Trade Co., Ltd. as shareholders, and provides a financial overview including a bank statement ending balance of $386,480.61 as of June 30, 2024.","docName":"Exhibit A2.pdf","exhibitNumber":"A-2"},"fd6e1c92-a55f-4137-af81-a9ebac447c7a":{"document_type":"Financial Statement","document_date":"2023-04-01","entities":[{"type":"company","name":"KINGS ELEVATOR PARTS INC","role":"reporting corporation","context":"Form 1120"},{"type":"company","name":"FUZHOU SHINESTONE TRADE CO., LTD","role":"25% foreign shareholder","context":"Form 5472"},{"type":"person","name":"VINCENT HUANG, CPA","role":"preparer","context":"Form 1120"},{"type":"amount","name":"$670,867","role":"total assets","context":"Form 1120"},{"type":"amount","name":"$741,227","role":"gross receipts or sales","context":"Form 1120"},{"type":"amount","name":"$588,257","role":"cost of goods sold","context":"Form 1120"},{"type":"amount","name":"$152,970","role":"gross profit","context":"Form 1120"},{"type":"amount","name":"$2,817","role":"taxable income","context":"Form 1120"},{"type":"amount","name":"$592","role":"total tax","context":"Form 1120"},{"type":"amount","name":"$500,000","role":"additional paid-in capital","context":"Form 5472"},{"type":"date","name":"2022-04-22","role":"date incorporated","context":"Form 1120"}],"tags":["financial","tax","corporation","irs","income","assets","liabilities"],"key_quotes":[{"text":"KINGS ELEVATOR PARTS INC","page":2,"topic":"Company Name"},{"text":"Total assets $670,867","page":2,"topic":"Assets"},{"text":"Gross receipts or sales 741,227","page":2,"topic":"Sales"},{"text":"Cost of goods sold 588,257","page":2,"topic":"Cost of Goods Sold"},{"text":"Taxable income 2,817","page":2,"topic":"Income"},{"text":"Total tax 592","page":4,"topic":"Tax"}],"summary":"The document is a financial statement for KINGS ELEVATOR PARTS INC, detailing their U.S. Corporation Income Tax Return for the tax year beginning April 1, 2023, and ending March 31, 2024. It includes information on gross receipts, cost of goods sold, taxable income, and total tax. The company has total assets of $670,867 and is partially owned by FUZHOU SHINESTONE TRADE CO., LTD, a foreign entity.","docName":"Exhibit A3.pdf","exhibitNumber":"A-3"}}}],"relationshipHistory":[],"writingHistory":[]}]